{"The Last Voyage of the Demeter": {"desc": "Based on a single chapter, the Captain's Log, from Bram Stoker's classic 1897 novel \"Dracula\", the story is set aboard the Russian schooner Demeter, which was chartered to carry private cargo - 24 unmarked wooden crates - from Carpathia to London. The film will detail the strange events that befell the doomed crew as they attempt to survive the ocean voyage, stalked each night by a terrifying presence on board the ship. When it finally arrived near Whitby Harbour, it was derelict. There was no trace of the crew.", "cast": "Corey Hawkins, Aisling Franciosi, Liam Cunningham, David Dastmalchian", "director": "André Øvredal", "genres": ["Fantasy", "Horror"], "year": "2023", "rating": "R"}, "The Secret Kingdom": {"desc": "Join Peter and Verity on a magical journey, as they embark on a quest to unite five mystical treasures to defeat an ancient enemy - the evil Shroud, and save an enchanted land in this thrilling fantasy adventure fit for the whole family!", "cast": "Alyla Browne, Alice Parkinson, Sam Everingham, Gabrielle Chan", "director": "Matt Drummond", "genres": ["Adventure", "Family"], "year": "2023", "rating": "PG"}, "The Unlikely Pilgrimage of Harold Fry": {"desc": "Harold is an ordinary man who has passed through life, living on the side lines, until he goes to post a letter one day...and just keeps walking.", "cast": "Jim Broadbent, Penelope Wilton, Earl Cave, Linda Bassett", "director": "Hettie Macdonald", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "A Haunting in Venice": {"desc": "In post-World War II Venice, Poirot, now retired and living in his own exile, reluctantly attends a seance. But when one of the guests is murdered, it is up to the former detective to once again uncover the killer.", "cast": "Kelly Reilly, Michelle Yeoh, Kenneth Branagh, Jamie Dornan", "director": "Kenneth Branagh", "genres": ["Crime", "Drama", "Horror", "Mystery", "Thriller"], "year": "2023", "rating": "PG-13"}, "On the Line: The Richard Williams Story": {"desc": "With never-before-seen archive material and new, in-depth intimate interviews, Richard Williams - the father and coach of Venus and Serena Williams - retraces his family's meteoric journey. This is the real story of one man's fight against racism, suppression, and violence and an emotional reckoning on race in America, family, courage, and determination.", "cast": "Katrina Adams, Kelvin Brown, Dale Caldwell, Kenna Franklin", "director": "Stuart McClave", "genres": ["Documentary"], "year": "2022", "rating": "NR"}, "TLC Forever": {"desc": "Follow the iconic group that influenced an entire generation and survived against all odds, showing personal stories about their world fame.", "cast": "Rozonda 'Chilli' Thomas, Lisa 'Left Eye' Lopes, Tionne 'T-Boz' Watkins, Matt Kay", "director": "Matt Kay", "genres": ["Documentary", "Music"], "year": "2023", "rating": "NR"}, "Tom Cruise: The Last Movie Star": {"desc": "From \"Top Gun\" to the \"Mission Impossible\" franchise , Tom Cruise becomes the world's biggest movie star by risking life and limb to perform death-defying stunts .", "cast": "Thomas Arnold, A.A. Dowd, Bilge Ebiri, Dan Jolin", "director": "Tom O'Dell", "genres": ["Documentary"], "year": "2023", "rating": "NR"}, "We Were Hyphy": {"desc": "We Were Hyphy is a love song to the artists, dance, music, clothes, cars and people who came of age during the Hyphy Movement. The film is a fun, nostalgic experience for those lucky enough to experience Hyphy the first time around, and a tantalizing introduction to those discovering it now. Whether you \"went dumb\" or have no idea what that means, WE WERE HYPHY is a documentary with universal appeal that will excite, entice and entertain you.", "cast": "Benjamin Earl Turner, G-Eazy, Kamaiyah, Rafael Casal", "director": "Laurence Madrigal", "genres": ["Documentary"], "year": "2022", "rating": "NR"}, "Joy Ride": {"desc": "Four Asian-American women travel through Asia in search of one of their birth mothers. Along the way, their experience becomes one of bonding, friendship, belonging and no-holds-barred debauchery.", "cast": "Stephanie Hsu, Ashley Park, Sherry Cola, Sabrina Wu", "director": "Adele Lim", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "The List": {"desc": "After her fiance sleeps with a celebrity on his free pass list, Abby Meyers, with nothing but five names and a fantasy shared by millions, sets out for Los Angeles to sleep with someone from hers.", "cast": "Halston Sage, Shelley Hennig, Gregg Sulkin, Lucy DeVito", "director": "Melissa Miller Costanzo", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "Christmas with the Campbells": {"desc": "Jess gets dumped by her boyfriend right before Christmas but his parents still want to celebrate Christmas with her while their son is away. Then she meets his cousin, but once he returns, Christmas gets a lot more complicated.", "cast": "Brittany Snow, Justin Long, Alex Moffat", "director": "Clare Niederpruem", "genres": ["Comedy", "Romance"], "year": "2022", "rating": "NR"}, "My Big Fat Greek Wedding 3": {"desc": "After travelling to Greece for a family reunion, a woman attempts to locate her deceased father's childhood friends.", "cast": "Nia Vardalos, John Corbett, Andrea Martin, Elena Kampouris", "director": "Nia Vardalos", "genres": ["Comedy", "Drama", "Romance"], "year": "2023", "rating": "PG-13"}, "The Re-Education of Molly Singer": {"desc": "To save her job, a young lawyer must go undercover, enrolling as a freshman at her old alma mater, in order to resuscitate the well being of her Boss' terribly awkward teenage son", "cast": "Jaime Pressly, Britt Robertson, Wendie Malick, Ty Simpkins", "director": "Andy Palmer", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "Barbie": {"desc": "To live in Barbie Land is to be a perfect being in a perfect place. Unless you have a full-on existential crisis. Or you're a Ken.", "cast": "Margot Robbie, Ryan Gosling, America Ferrera, Kate McKinnon", "director": "Greta Gerwig", "genres": ["Adventure", "Comedy", "Fantasy"], "year": "2023", "rating": "PG-13"}, "Blue Beetle": {"desc": "An alien scarab chooses Jaime Reyes to be its symbiotic host, bestowing the recent college graduate with a suit of armor that's capable of extraordinary powers, forever changing his destiny as he becomes the superhero known as Blue Beetle.", "cast": "Xolo Maridueña, Adriana Barraza, Damián Alcázar, Raoul Max Trujillo", "director": "Angel Manuel Soto", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2023", "rating": "PG-13"}, "Mission: Impossible - Dead Reckoning Part One": {"desc": "Ethan Hunt and his IMF team must track down a dangerous weapon before it falls into the wrong hands.", "cast": "Tom Cruise, Hayley Atwell, Ving Rhames, Simon Pegg", "director": "Christopher McQuarrie", "genres": ["Action", "Adventure", "Thriller"], "year": "2023", "rating": "PG-13"}, "Gran Turismo : Based on A True Story": {"desc": "A teenage Gran Turismo player wins a series of Nissan competitions and later becomes an actual professional race car driver.", "cast": "Djimon Hounsou, Orlando Bloom, David Harbour, Darren Barnet", "director": "Neill Blomkamp", "genres": ["Action", "Adventure", "Drama"], "year": "2023", "rating": "PG-13"}, "Expend4bles": {"desc": "A new generation of stars join the world's top action stars for an adrenaline-fueled adventure in Expend4bles. Reuniting as the team of elite mercenaries, Jason Statham, Dolph Lundgren, Randy Couture, and Sylvester Stallone are joined for the first time by Curtis \"50 Cent\" Jackson, Megan Fox, Tony Jaa, Iko Uwais, Jacob Scipio, Levy Tran, and Andy Garcia. Armed with every weapon they can get their hands on and the skills to use them, The Expendables are the world's last line of defense and the team that gets called when all other options are off the table. But new team members with new styles and tactics are going to give \"new blood\" a whole new meaning.", "cast": "Jason Statham, 50 Cent, Megan Fox, Dolph Lundgren", "director": "Scott Waugh", "genres": ["Action", "Adventure", "Thriller", "War"], "year": "2023", "rating": "R"}, "The Equalizer 3": {"desc": "Robert McCall finds himself at home in Southern Italy but he discovers his friends are under the control of local crime bosses. As events turn deadly, McCall knows what he has to do: become his friends' protector by taking on the mafia.", "cast": "Denzel Washington, Dakota Fanning, David Denman, Sonia Ammar", "director": "Antoine Fuqua", "genres": ["Action", "Crime", "Thriller"], "year": "2023", "rating": "R"}, "Inside Man": {"desc": "Based on true events, Inside Man follows disgraced New York Police Detective Bobby Belucci (Emile Hirsch) as his life falls apart when he discovers his wife (Ashley Greene) is having an affair. After beating her lover to a pulp, she leaves him and Bobby gets demoted at work, triggering his determination to prove he's worthy of redemption. His plan is to go undercover as a grunt and infiltrate the Gambino crime family's notorious \"DeMeo Crew,\" a violent and bloody faction that reigned terror in the 1960s and '70s. Bobby will stop at nothing to get close to the head of the crew, Roy DeMeo (Danny Abeckaser), to expose the murder and corruption. But as Bobby sinks deeper into the mob and more bodies drop, the price for absolution may be higher than he can afford.", "cast": "Emile Hirsch, Jake Cannavale, Lucy Hale, Ashley Greene", "director": "Danny A. Abeckaser", "genres": ["Crime", "Drama", "Thriller"], "year": "2023", "rating": "NR"}, "Violent Night": {"desc": "On Christmas Eve, Santa Claus finds himself on a surprise mission to protect a group of hostages. When a group of mercenaries breaks into the compound of a rich family, they don't foresee Santa's combative skills. What follows is a holy but hostile night of gifts, guns, and gore.", "cast": "David Harbour, John Leguizamo, Beverly D'Angelo, Alex Hassell", "director": "Tommy Wirkola", "genres": ["Action", "Comedy", "Thriller"], "year": "2022", "rating": "R"}, "Spider-Man: Far From Home": {"desc": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.", "cast": "Tom Holland, Samuel L. Jackson, Jake Gyllenhaal, Marisa Tomei", "director": "Jon Watts", "genres": ["Action", "Adventure", "Comedy"], "year": "2019", "rating": "PG-13"}, "City of God": {"desc": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.", "cast": "Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva", "director": "Fernando Meirelles", "genres": ["Crime", "Drama"], "year": "2002", "rating": "R"}, "Emma (MEXICO)": {"desc": "8 year old Emma suffers a head concussion as a result of which she decides she wants to become a Saint. In school she meets Andres a rebellious boy who doesn’t like religion. Andres and Emma share a passion for Soccer and Emma thinks that she will be able to convert him. In the end she doesn’t convert him but they remain unconditional friends.", "cast": "Cassandra Iturralde, Esaú Ávila, Áxel Ricco, Astrid Romo", "director": "Julio Bárcenas", "genres": ["Adventure", "Comedy", "Family", "Fantasy"], "year": "2019", "rating": "NR"}, "Baby": {"desc": "A love story between neighbours and childhood friends played and what happens to their relationship when they go to college and meets a new person.", "cast": "Anand Deverakonda, Vaishnavi Chaitanya, Viraj Ashwin, Kirrak Seetha", "director": "Sai Rajesh Neelam", "genres": ["Drama", "Romance"], "year": "2023", "rating": "NR"}, "Josefina": {"desc": "Juan is a shy and sloppy fifty-year-old man who works as a prison officer. Through the safety monitors, he silently observes every Sunday the visit of Berta, the mother of one of the inmates. Even though they have never spoken, he begins to feel an attraction to her. Berta spends most of her time enclosed at home, taking care of his sick husband, who has been bedridden for years. The day he finally approaches her, he surprises himself by pretending to be the father of a made-up inmate daughter: Josefina.", "cast": "Emma Suárez, Roberto Álamo, Miguel Bernardeau, Olivia Delcán", "director": "Javier Marco", "genres": ["Drama", "Romance"], "year": "2021", "rating": "PG-13"}, "Asedio": {"desc": "During an eviction in a troubled neighborhood in Madrid, Dani will come across hidden money, a plot of police corruption and a crime that will make him have to flee for his life in a hostile territory, where he does not know the language, is not welcome and your authority is worthless.", "cast": "Natalia de Molina, Bella Agossou, Francisco Reyes, Fran Cantos", "director": "Miguel Ángel Vivas", "genres": ["Spanish (Castilian)"], "year": "2023", "rating": "R"}, "Rose": {"desc": "ROSE is the story of two sisters, Inger and Ellen, and how their relationship is challenged on a highly anticipated coach trip to Paris. When Inger announces her struggles with mental health to the group, the sisters are faced with pity from some and discrimination from others. On arrival in Paris, it soon becomes clear that Inger has a hidden agenda concerning a figure from her past, ultimately involving the entire group in her hunt for answers. A film about love and care for each other, in spite of our differences, as much as it is a film about not judging a book by its cover.", "cast": "Sofie Gråbøl, Lene Maria Christensen, Anders W. Berthelsen, Søren Malling", "director": "Niels Arden Oplev", "genres": ["Comedy", "Drama"], "year": "2022", "rating": "NR"}, "Ajoomma": {"desc": "A middle-aged, Korean-drama obsessed widow from Singapore travels out of the country for the first time to Seoul, and ends up getting lost. Her journey becomes an unexpected road of self discovery, as she comes to terms with the life she truly wants for herself, beyond her roles of daughter, wife and mother.", "cast": "Huifang Hong, Kang Hyoung-suk, Jung Dong-hwan, Yeo Jin-goo", "director": "Shuming He", "genres": ["Adventure", "Comedy", "Drama", "Romance"], "year": "2022", "rating": "PG-13"}, "Red Line (Su ming dao)": {"desc": "A thrilling scene unfolds as an ambulance and a mysterious sports car, the \"Hellcat,\" engage in a fierce race from the harbour to the mountain roads, onto the highway and the city. It feels like a showdown between two masters. Who will emerge as the new generation's racing champion? If only one can survive, who will get the last laugh? The ambulance is driven by \"Le\" (E.SO), a former racing expert. Le accidentally caused the death of his brother, Chieh (Alan Kuo), during a competition. Devastated by guilt, he spiralled into despair until he met Hui (Ella), a doctor. With her help, he decided to become an ambulance driver, vowing to \"save lives with speed.\" Alas, the owner of a mysterious race car \"Hellcat\" suddenly appears, he holds the list, the challenged racer is bound to die in the end ......", "cast": "E.SO, Ella Chen, Alan Ko, Ning Ding", "director": "Yu-Chien Ko", "genres": ["Action", "Drama", "Thriller"], "year": "2023", "rating": "PG-13"}, "My Worst Neighbor": {"desc": "Seung-Jin dreams of becoming a singer. He prepares for an audition that could help him make his dream come true. In the process, he moves to a new home. On the first night in his new home, he hears loud noises. The noises are from his next-door neighbor Ra-Ni . Their homes are so close to each other that they can practically hear everything from the other side. Whenever a new person moves next door to Ra-Ni, she makes sure to make loud enough noises that they move out. But, Seung-Jin is different. He responds with even more noise. As the days go by, they share their daily lives with each other unintentionally. They also begin to develop feelings for each other.", "cast": "Seung-Yeon Han, Ji-Hoon Lee, Kim Yool-ho, Woo-cheol Lee", "director": "Woo-cheol Lee", "genres": ["Comedy", "Romance"], "year": "2023", "rating": "PG"}, "Father Of The Milky Way Railroad (Ginga Tetsudo no Chichi)": {"desc": "Masajiro Miyazawa owns and runs a pawn shop for generations. His first son is Kenji and his daughter is Toshi Miyazawa. Kenji is supposed to take over the pawn shop as the first son, but he refuses. Masajiro is soft on his son. Meanwhile, Toshi is smart and wise. She gives advice to her father and her older brother. One day, Toshi gets sick.", "cast": "Nana Mori, Maki Sakai, Masaki Suda, Min Tanaka", "director": "Izuru Narushima", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "The Princess Diaries": {"desc": "In director Garry Marshall's charming modern-day fable, Julie Andrews plays a European queen who grooms her awkward, long-lost American granddaughter (Anne Hathaway) for the throne. Hector Elizondo, Heather Matarazzo and Mandy Moore round out the cast. Caroline Goodall, Robert Schwartzman, Erik von Detten.", "cast": "Anne Hathaway, Julie Andrews, Patrick John Flueger, Heather Matarazzo", "director": "Garry Marshall", "genres": ["Comedy", "Family", "Romance"], "year": "2001", "rating": "G"}, "The Devil Wears Prada": {"desc": "A college grad gets her first job as an assistant to a tempestuously toxic editrix at a fashion magazine. Meryl Streep gives a haute-couture-de-force performance as the boss from hell in this caustically hilarious adaptation.", "cast": "Meryl Streep, Anne Hathaway, Stanley Tucci, Emily Blunt", "director": "David Frankel", "genres": ["Comedy", "Drama"], "year": "2006", "rating": "PG-13"}, "Sex and the City 2": {"desc": "Carrie, Charlotte, and Miranda are all married now, but they're still up for a little fun in the sun. When Samantha gets the chance to visit one of the most extravagant vacation destinations on the planet and offers to bring them all along, they surmise that a women-only retreat may be the perfect excuse to eschew their responsibilities and remember what life was like before they decided to settle down.", "cast": "Sarah Jessica Parker, Kristin Davis, Cynthia Nixon, Kim Cattrall", "director": "Michael Patrick King", "genres": ["Comedy", "Drama", "Romance"], "year": "2010", "rating": "R"}}