{"The Last Voyage of the Demeter": {"desc": "Based on a single chapter, the Captain's Log, from Bram Stoker's classic 1897 novel \"Dracula\", the story is set aboard the Russian schooner Demeter, which was chartered to carry private cargo - 24 unmarked wooden crates - from Carpathia to London. The film will detail the strange events that befell the doomed crew as they attempt to survive the ocean voyage, stalked each night by a terrifying presence on board the ship. When it finally arrived near Whitby Harbour, it was derelict. There was no trace of the crew.", "cast": "Corey Hawkins, Aisling Franciosi, Liam Cunningham, David Dastmalchian", "director": "André Øvredal", "genres": ["Fantasy", "Horror"], "year": "2023", "rating": "R"}, "The Secret Kingdom": {"desc": "Join Peter and Verity on a magical journey, as they embark on a quest to unite five mystical treasures to defeat an ancient enemy - the evil Shroud, and save an enchanted land in this thrilling fantasy adventure fit for the whole family!", "cast": "Alyla Browne, Alice Parkinson, Sam Everingham, Gabrielle Chan", "director": "Matt Drummond", "genres": ["Adventure", "Family"], "year": "2023", "rating": "PG"}, "The Unlikely Pilgrimage of Harold Fry": {"desc": "Harold is an ordinary man who has passed through life, living on the side lines, until he goes to post a letter one day...and just keeps walking.", "cast": "Jim Broadbent, Penelope Wilton, Earl Cave, Linda Bassett", "director": "Hettie Macdonald", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "A Haunting in Venice": {"desc": "In post-World War II Venice, Poirot, now retired and living in his own exile, reluctantly attends a seance. But when one of the guests is murdered, it is up to the former detective to once again uncover the killer.", "cast": "Kelly Reilly, Michelle Yeoh, Kenneth Branagh, Jamie Dornan", "director": "Kenneth Branagh", "genres": ["Crime", "Drama", "Horror", "Mystery", "Thriller"], "year": "2023", "rating": "PG-13"}, "On the Line: The Richard Williams Story": {"desc": "With never-before-seen archive material and new, in-depth intimate interviews, Richard Williams - the father and coach of Venus and Serena Williams - retraces his family's meteoric journey. This is the real story of one man's fight against racism, suppression, and violence and an emotional reckoning on race in America, family, courage, and determination.", "cast": "Katrina Adams, Kelvin Brown, Dale Caldwell, Kenna Franklin", "director": "Stuart McClave", "genres": ["Documentary"], "year": "2022", "rating": "NR"}, "TLC Forever": {"desc": "Follow the iconic group that influenced an entire generation and survived against all odds, showing personal stories about their world fame.", "cast": "Rozonda 'Chilli' Thomas, Lisa 'Left Eye' Lopes, Tionne 'T-Boz' Watkins, Matt Kay", "director": "Matt Kay", "genres": ["Documentary", "Music"], "year": "2023", "rating": "NR"}, "Tom Cruise: The Last Movie Star": {"desc": "From \"Top Gun\" to the \"Mission Impossible\" franchise , Tom Cruise becomes the world's biggest movie star by risking life and limb to perform death-defying stunts .", "cast": "Thomas Arnold, A.A. Dowd, Bilge Ebiri, Dan Jolin", "director": "Tom O'Dell", "genres": ["Documentary"], "year": "2023", "rating": "NR"}, "We Were Hyphy": {"desc": "We Were Hyphy is a love song to the artists, dance, music, clothes, cars and people who came of age during the Hyphy Movement. The film is a fun, nostalgic experience for those lucky enough to experience Hyphy the first time around, and a tantalizing introduction to those discovering it now. Whether you \"went dumb\" or have no idea what that means, WE WERE HYPHY is a documentary with universal appeal that will excite, entice and entertain you.", "cast": "Benjamin Earl Turner, G-Eazy, Kamaiyah, Rafael Casal", "director": "Laurence Madrigal", "genres": ["Documentary"], "year": "2022", "rating": "NR"}, "Joy Ride": {"desc": "Four Asian-American women travel through Asia in search of one of their birth mothers. Along the way, their experience becomes one of bonding, friendship, belonging and no-holds-barred debauchery.", "cast": "Stephanie Hsu, Ashley Park, Sherry Cola, Sabrina Wu", "director": "Adele Lim", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "The List": {"desc": "After her fiance sleeps with a celebrity on his free pass list, Abby Meyers, with nothing but five names and a fantasy shared by millions, sets out for Los Angeles to sleep with someone from hers.", "cast": "Halston Sage, Shelley Hennig, Gregg Sulkin, Lucy DeVito", "director": "Melissa Miller Costanzo", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "Christmas with the Campbells": {"desc": "Jess gets dumped by her boyfriend right before Christmas but his parents still want to celebrate Christmas with her while their son is away. Then she meets his cousin, but once he returns, Christmas gets a lot more complicated.", "cast": "Brittany Snow, Justin Long, Alex Moffat", "director": "Clare Niederpruem", "genres": ["Comedy", "Romance"], "year": "2022", "rating": "NR"}, "My Big Fat Greek Wedding 3": {"desc": "After travelling to Greece for a family reunion, a woman attempts to locate her deceased father's childhood friends.", "cast": "Nia Vardalos, John Corbett, Andrea Martin, Elena Kampouris", "director": "Nia Vardalos", "genres": ["Comedy", "Drama", "Romance"], "year": "2023", "rating": "PG-13"}, "The Re-Education of Molly Singer": {"desc": "To save her job, a young lawyer must go undercover, enrolling as a freshman at her old alma mater, in order to resuscitate the well being of her Boss' terribly awkward teenage son", "cast": "Jaime Pressly, Britt Robertson, Wendie Malick, Ty Simpkins", "director": "Andy Palmer", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "Barbie": {"desc": "To live in Barbie Land is to be a perfect being in a perfect place. Unless you have a full-on existential crisis. Or you're a Ken.", "cast": "Margot Robbie, Ryan Gosling, America Ferrera, Kate McKinnon", "director": "Greta Gerwig", "genres": ["Adventure", "Comedy", "Fantasy"], "year": "2023", "rating": "PG-13"}, "Blue Beetle": {"desc": "An alien scarab chooses Jaime Reyes to be its symbiotic host, bestowing the recent college graduate with a suit of armor that's capable of extraordinary powers, forever changing his destiny as he becomes the superhero known as Blue Beetle.", "cast": "Xolo Maridueña, Adriana Barraza, Damián Alcázar, Raoul Max Trujillo", "director": "Angel Manuel Soto", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2023", "rating": "PG-13"}, "Mission: Impossible - Dead Reckoning Part One": {"desc": "Ethan Hunt and his IMF team must track down a dangerous weapon before it falls into the wrong hands.", "cast": "Tom Cruise, Hayley Atwell, Ving Rhames, Simon Pegg", "director": "Christopher McQuarrie", "genres": ["Action", "Adventure", "Thriller"], "year": "2023", "rating": "PG-13"}, "Gran Turismo : Based on A True Story": {"desc": "A teenage Gran Turismo player wins a series of Nissan competitions and later becomes an actual professional race car driver.", "cast": "Djimon Hounsou, Orlando Bloom, David Harbour, Darren Barnet", "director": "Neill Blomkamp", "genres": ["Action", "Adventure", "Drama"], "year": "2023", "rating": "PG-13"}, "Expend4bles": {"desc": "A new generation of stars join the world's top action stars for an adrenaline-fueled adventure in Expend4bles. Reuniting as the team of elite mercenaries, Jason Statham, Dolph Lundgren, Randy Couture, and Sylvester Stallone are joined for the first time by Curtis \"50 Cent\" Jackson, Megan Fox, Tony Jaa, Iko Uwais, Jacob Scipio, Levy Tran, and Andy Garcia. Armed with every weapon they can get their hands on and the skills to use them, The Expendables are the world's last line of defense and the team that gets called when all other options are off the table. But new team members with new styles and tactics are going to give \"new blood\" a whole new meaning.", "cast": "Jason Statham, 50 Cent, Megan Fox, Dolph Lundgren", "director": "Scott Waugh", "genres": ["Action", "Adventure", "Thriller", "War"], "year": "2023", "rating": "R"}, "The Equalizer 3": {"desc": "Robert McCall finds himself at home in Southern Italy but he discovers his friends are under the control of local crime bosses. As events turn deadly, McCall knows what he has to do: become his friends' protector by taking on the mafia.", "cast": "Denzel Washington, Dakota Fanning, David Denman, Sonia Ammar", "director": "Antoine Fuqua", "genres": ["Action", "Crime", "Thriller"], "year": "2023", "rating": "R"}, "Inside Man": {"desc": "Based on true events, Inside Man follows disgraced New York Police Detective Bobby Belucci (Emile Hirsch) as his life falls apart when he discovers his wife (Ashley Greene) is having an affair. After beating her lover to a pulp, she leaves him and Bobby gets demoted at work, triggering his determination to prove he's worthy of redemption. His plan is to go undercover as a grunt and infiltrate the Gambino crime family's notorious \"DeMeo Crew,\" a violent and bloody faction that reigned terror in the 1960s and '70s. Bobby will stop at nothing to get close to the head of the crew, Roy DeMeo (Danny Abeckaser), to expose the murder and corruption. But as Bobby sinks deeper into the mob and more bodies drop, the price for absolution may be higher than he can afford.", "cast": "Emile Hirsch, Jake Cannavale, Lucy Hale, Ashley Greene", "director": "Danny A. Abeckaser", "genres": ["Crime", "Drama", "Thriller"], "year": "2023", "rating": "NR"}, "Violent Night": {"desc": "On Christmas Eve, Santa Claus finds himself on a surprise mission to protect a group of hostages. When a group of mercenaries breaks into the compound of a rich family, they don't foresee Santa's combative skills. What follows is a holy but hostile night of gifts, guns, and gore.", "cast": "David Harbour, John Leguizamo, Beverly D'Angelo, Alex Hassell", "director": "Tommy Wirkola", "genres": ["Action", "Comedy", "Thriller"], "year": "2022", "rating": "R"}, "Spider-Man: Far From Home": {"desc": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.", "cast": "Tom Holland, Samuel L. Jackson, Jake Gyllenhaal, Marisa Tomei", "director": "Jon Watts", "genres": ["Action", "Adventure", "Comedy"], "year": "2019", "rating": "PG-13"}, "City of God": {"desc": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.", "cast": "Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva", "director": "Fernando Meirelles", "genres": ["Crime", "Drama"], "year": "2002", "rating": "R"}, "Emma (MEXICO)": {"desc": "8 year old Emma suffers a head concussion as a result of which she decides she wants to become a Saint. In school she meets Andres a rebellious boy who doesn’t like religion. Andres and Emma share a passion for Soccer and Emma thinks that she will be able to convert him. In the end she doesn’t convert him but they remain unconditional friends.", "cast": "Cassandra Iturralde, Esaú Ávila, Áxel Ricco, Astrid Romo", "director": "Julio Bárcenas", "genres": ["Adventure", "Comedy", "Family", "Fantasy"], "year": "2019", "rating": "NR"}, "Baby": {"desc": "A love story between neighbours and childhood friends played and what happens to their relationship when they go to college and meets a new person.", "cast": "Anand Deverakonda, Vaishnavi Chaitanya, Viraj Ashwin, Kirrak Seetha", "director": "Sai Rajesh Neelam", "genres": ["Drama", "Romance"], "year": "2023", "rating": "NR"}, "Josefina": {"desc": "Juan is a shy and sloppy fifty-year-old man who works as a prison officer. Through the safety monitors, he silently observes every Sunday the visit of Berta, the mother of one of the inmates. Even though they have never spoken, he begins to feel an attraction to her. Berta spends most of her time enclosed at home, taking care of his sick husband, who has been bedridden for years. The day he finally approaches her, he surprises himself by pretending to be the father of a made-up inmate daughter: Josefina.", "cast": "Emma Suárez, Roberto Álamo, Miguel Bernardeau, Olivia Delcán", "director": "Javier Marco", "genres": ["Drama", "Romance"], "year": "2021", "rating": "PG-13"}, "Asedio": {"desc": "During an eviction in a troubled neighborhood in Madrid, Dani will come across hidden money, a plot of police corruption and a crime that will make him have to flee for his life in a hostile territory, where he does not know the language, is not welcome and your authority is worthless.", "cast": "Natalia de Molina, Bella Agossou, Francisco Reyes, Fran Cantos", "director": "Miguel Ángel Vivas", "genres": ["Spanish (Castilian)"], "year": "2023", "rating": "R"}, "Rose": {"desc": "ROSE is the story of two sisters, Inger and Ellen, and how their relationship is challenged on a highly anticipated coach trip to Paris. When Inger announces her struggles with mental health to the group, the sisters are faced with pity from some and discrimination from others. On arrival in Paris, it soon becomes clear that Inger has a hidden agenda concerning a figure from her past, ultimately involving the entire group in her hunt for answers. A film about love and care for each other, in spite of our differences, as much as it is a film about not judging a book by its cover.", "cast": "Sofie Gråbøl, Lene Maria Christensen, Anders W. Berthelsen, Søren Malling", "director": "Niels Arden Oplev", "genres": ["Comedy", "Drama"], "year": "2022", "rating": "NR"}, "Ajoomma": {"desc": "A middle-aged, Korean-drama obsessed widow from Singapore travels out of the country for the first time to Seoul, and ends up getting lost. Her journey becomes an unexpected road of self discovery, as she comes to terms with the life she truly wants for herself, beyond her roles of daughter, wife and mother.", "cast": "Huifang Hong, Kang Hyoung-suk, Jung Dong-hwan, Yeo Jin-goo", "director": "Shuming He", "genres": ["Adventure", "Comedy", "Drama", "Romance"], "year": "2022", "rating": "PG-13"}, "Red Line (Su ming dao)": {"desc": "A thrilling scene unfolds as an ambulance and a mysterious sports car, the \"Hellcat,\" engage in a fierce race from the harbour to the mountain roads, onto the highway and the city. It feels like a showdown between two masters. Who will emerge as the new generation's racing champion? If only one can survive, who will get the last laugh? The ambulance is driven by \"Le\" (E.SO), a former racing expert. Le accidentally caused the death of his brother, Chieh (Alan Kuo), during a competition. Devastated by guilt, he spiralled into despair until he met Hui (Ella), a doctor. With her help, he decided to become an ambulance driver, vowing to \"save lives with speed.\" Alas, the owner of a mysterious race car \"Hellcat\" suddenly appears, he holds the list, the challenged racer is bound to die in the end ......", "cast": "E.SO, Ella Chen, Alan Ko, Ning Ding", "director": "Yu-Chien Ko", "genres": ["Action", "Drama", "Thriller"], "year": "2023", "rating": "PG-13"}, "My Worst Neighbor": {"desc": "Seung-Jin dreams of becoming a singer. He prepares for an audition that could help him make his dream come true. In the process, he moves to a new home. On the first night in his new home, he hears loud noises. The noises are from his next-door neighbor Ra-Ni . Their homes are so close to each other that they can practically hear everything from the other side. Whenever a new person moves next door to Ra-Ni, she makes sure to make loud enough noises that they move out. But, Seung-Jin is different. He responds with even more noise. As the days go by, they share their daily lives with each other unintentionally. They also begin to develop feelings for each other.", "cast": "Seung-Yeon Han, Ji-Hoon Lee, Kim Yool-ho, Woo-cheol Lee", "director": "Woo-cheol Lee", "genres": ["Comedy", "Romance"], "year": "2023", "rating": "PG"}, "Father Of The Milky Way Railroad (Ginga Tetsudo no Chichi)": {"desc": "Masajiro Miyazawa owns and runs a pawn shop for generations. His first son is Kenji and his daughter is Toshi Miyazawa. Kenji is supposed to take over the pawn shop as the first son, but he refuses. Masajiro is soft on his son. Meanwhile, Toshi is smart and wise. She gives advice to her father and her older brother. One day, Toshi gets sick.", "cast": "Nana Mori, Maki Sakai, Masaki Suda, Min Tanaka", "director": "Izuru Narushima", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "The Princess Diaries": {"desc": "In director Garry Marshall's charming modern-day fable, Julie Andrews plays a European queen who grooms her awkward, long-lost American granddaughter (Anne Hathaway) for the throne. Hector Elizondo, Heather Matarazzo and Mandy Moore round out the cast. Caroline Goodall, Robert Schwartzman, Erik von Detten.", "cast": "Anne Hathaway, Julie Andrews, Patrick John Flueger, Heather Matarazzo", "director": "Garry Marshall", "genres": ["Comedy", "Family", "Romance"], "year": "2001", "rating": "G"}, "The Devil Wears Prada": {"desc": "A college grad gets her first job as an assistant to a tempestuously toxic editrix at a fashion magazine. Meryl Streep gives a haute-couture-de-force performance as the boss from hell in this caustically hilarious adaptation.", "cast": "Meryl Streep, Anne Hathaway, Stanley Tucci, Emily Blunt", "director": "David Frankel", "genres": ["Comedy", "Drama"], "year": "2006", "rating": "PG-13"}, "Sex and the City 2": {"desc": "Carrie, Charlotte, and Miranda are all married now, but they're still up for a little fun in the sun. When Samantha gets the chance to visit one of the most extravagant vacation destinations on the planet and offers to bring them all along, they surmise that a women-only retreat may be the perfect excuse to eschew their responsibilities and remember what life was like before they decided to settle down.", "cast": "Sarah Jessica Parker, Kristin Davis, Cynthia Nixon, Kim Cattrall", "director": "Michael Patrick King", "genres": ["Comedy", "Drama", "Romance"], "year": "2010", "rating": "R"}, "The Best Man Holiday": {"desc": "Mia Sullivan (Monica Calhoun), wife of Lance Sullivan (Morris Chestnut), has written letters requesting that the old gang should join them for Christmas: Harper Stewart (Taye Diggs) and his almost-nine-month-pregnant wife Robyn (Sanaa Lathan), Julian \"Murch\" Murchison (Harold Perrineau) and wife Candace Sparks (Regina Hall), her best friend Jordan Armstrong (Nia Long) and boyfriend Brian McDonald (Eddie Cibrian), Quentin \"Q\" Spivey (Terrence Howard), and Shelby Taylor (Melissa De Sousa). All the friends arrive at the house, the first time they've come together in 14 years, and the celebration begins. At dinner, the old friends catch up while tensions grow between Shelby and Candace. Years after his debut novel, Harper is struggling with writer's block, financial difficulties, and pressure from his publisher to come up with newer and better material for his next book. He has also been recently relieved of his faculty position at New York University, further complicating the couple's financial position. He kept all this from Robyn, as she is finally pregnant with their first child after years of expensive fertility treatments and the baby is almost full-term. His agent suggests he write a biography on his estranged friend, Lance, who is set to retire from football. Harper reluctantly agrees, but keeps the biography a secret..", "cast": "Monica Calhoun, Morris Chestnut, Melissa De Sousa, Taye Diggs", "director": "Malcolm D. Lee", "genres": ["Comedy", "Drama"], "year": "2013", "rating": "R"}, "New Year's Eve": {"desc": "The lives of several couples and singles in New York intertwine over the course of New Year's Eve.", "cast": "Robert De Niro, Katherine Heigl, Ashton Kutcher, Carla Gugino", "director": "Garry Marshall", "genres": ["Comedy", "Romance"], "year": "2011", "rating": "PG-13"}, "Letters to Juliet": {"desc": "An American girl on vacation in Italy finds an unanswered \"letter to Juliet\" -- one of thousands of missives left at the fictional lover's Verona courtyard, which are typically answered by the \"secretaries of Juliet\" -- and she goes on a quest to find the lovers referenced in the letter.", "cast": "Amanda Seyfried, Christopher Egan, Gael García Bernal, Vanessa Redgrave", "director": "Gary Winick", "genres": ["Adventure", "Comedy", "Drama", "Romance"], "year": "2010", "rating": "PG"}, "Love Actually": {"desc": "Follows seemingly unrelated people as their lives begin to intertwine while they fall in – and out – of love. Affections languish and develop as Christmas draws near.", "cast": "Adam Godley, Hugh Grant, Heike Makatsch, Alan Rickman", "director": "Richard Curtis", "genres": ["Comedy", "Drama", "Romance"], "year": "2003", "rating": "R"}, "The Polar Express": {"desc": "A doubting 8-year-old boy is whisked to the North Pole on a magical train for a meeting with Santa in this dazzling animated Christmas fable. Meanwhile, the boy's crisis in faith turns into a wondrous journey of self-discovery.", "cast": "Tom Hanks, Nona Gaye, Peter Scolari, Leslie Zemeckis", "director": "Robert Zemeckis", "genres": ["Animation", "Adventure", "Comedy"], "year": "2004", "rating": "G"}, "Rise of the Guardians": {"desc": "When an evil spirit known as Pitch lays down the gauntlet to take over the world, the immortal Guardians must join forces for the first time to protect the hopes, beliefs, and imaginations of children all over the world.", "cast": "Chris Pine, Alec Baldwin, Jude Law, Isla Fisher", "director": "Peter Ramsey", "genres": ["Animation", "Action", "Adventure", "Comedy", "Drama", "Family", "Fantasy"], "year": "2012", "rating": "PG"}, "The Adventures of Tintin": {"desc": "Having bought a model ship, the Unicorn, for a pound off a market stall Tintin is initially puzzled that the sinister Mr. Sakharine should be so eager to buy it from him, resorting to murder and kidnapping Tintin - accompanied by his marvellous dog Snowy - to join him and his gang as they sail to Morocco on an old cargo ship. Sakharine has bribed the crew to revolt against the ship's master, drunken Captain Haddock, but Tintin, Snowy and Haddock escape, arriving in Morocco at the court of a sheikh, who also has a model of the Unicorn. Haddock tells Tintin that over three hundred years earlier his ancestor Sir Francis Haddock was forced to scuttle the original Unicorn when attacked by a piratical forebear of Sakharine but he managed to save his treasure and provide clues to its location in three separate scrolls, all of which were secreted in models of the Unicorn. Tintin and Sakharine have one each and the villain intends to use the glass-shattering top Cs of operatic soprano the Milanese Nightingale to secure the third. With aid from bumbling Interpol agents the Thompson Twins our boy hero, his dog and the captain must prevent Sakharine from obtaining all three scrolls to fulfil the prophesy that only the last of the Haddocks can discover the treasure's whereabouts.", "cast": "Jamie Bell, Andy Serkis, Daniel Craig, Nick Frost", "director": "Steven Spielberg", "genres": ["Animation", "Action", "Adventure", "Family", "Mystery"], "year": "2011", "rating": "PG"}, "Shrek 2": {"desc": "This hilarious, entertaining and clever sequel to the 2001 hit follows Shrek and his princess bride as they travel to meet the in-laws, who are unaware their daughter has turned into the same kind of green ogre as her husband.", "cast": "Mike Myers, Eddie Murphy, Cameron Diaz, Julie Andrews", "director": "Conrad Vernon, Andrew Adamson, Kelly Asbury", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy", "Romance"], "year": "2004", "rating": "PG"}, "Adam Sandler's Eight Crazy Nights": {"desc": "Adam Sandler invites you to share some holiday cheer in the new, no-holds-barred musical comedy Adam Sandler's 8 Crazy Nights. Davey Stone, a 33-year old party animal, finds himself in trouble with the law after his wild ways go too far. In keeping with the holiday spirit, the judge gives Davey one last chance at redemption-spend the holiday performing community service as the assistant referee for the youth basketball league or go to jail. Davey thinks he's gotten off easy until he meets Whitey Duvall, the eccentric, elf-like head referee. The mismatch between Whitey's good heart and never-ending optimism and Davey's constant troublemaking soon have them both wondering if going to jail wouldn't have been easier! In this new, full-length animated feature about basketball, old girlfriends, holiday spirits, and the mall, Adam Sandler voices the three lead characters of Whitey, Davey, and Whitey's fraternal twin sister Eleanore!", "cast": "Adam Sandler, Jackie Sandler, Austin Stout, Kevin Nealon", "director": "Seth Kearsley", "genres": ["Animation", "Comedy", "Musical"], "year": "2002", "rating": "PG-13"}, "The Hunger Games": {"desc": "In this exciting adaptation of the popular novel, 16-year-old Katniss Everdeen must compete in a cruel televised tournament in which 24 teenagers from a postapocalyptic society fight to the death for the entertainment of the masses.", "cast": "Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson", "director": "Gary Ross", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2012", "rating": "PG-13"}, "Her": {"desc": "In the not so distant future, Theodore, a lonely writer purchases a newly developed operating system designed to meet the user's every needs. To Theodore's surprise, a romantic relationship develops between him and his operating system. This unconventional love story blends science fiction and romance in a sweet tale that explores the nature of love and the ways that technology isolates and connects us all.", "cast": "Joaquin Phoenix, Scarlett Johansson, Amy Adams, Rooney Mara", "director": "Spike Jonze", "genres": ["Drama", "Romance", "Sci-Fi"], "year": "2013", "rating": "R"}, "Carol": {"desc": "In this achingly beautiful drama, a female department-store employee in 1950s New York falls for a woman stuck in a loveless marriage. Unfortunately, the latter's husband threatens to take their child if the relationship between the two women continues.", "cast": "Rooney Mara, Cate Blanchett, Kyle Chandler, Sarah Paulson", "director": "Todd Haynes", "genres": ["Drama", "Romance"], "year": "2015", "rating": "R"}, "West Side Story": {"desc": "In the slums of the upper West Side of Manhattan, New York, a gang of Polish-American teenagers called the Jets compete with a rival gang of recently immigrated Puerto Ricans, the Sharks, to \"own\" the neighborhood streets. Tensions are high between the gangs but two kids, one from each rival gang, fall in love leading to tragedy.", "cast": "Natalie Wood, Richard Beymer, Russ Tamblyn, Rita Moreno", "director": "Robert Wise", "genres": ["Crime", "Drama", "Musical"], "year": "1961", "rating": "G"}, "Pride & Prejudice": {"desc": "The story is based on Jane Austen's novel about five sisters - Jane (Rosamund Pike), Elizabeth (Keira Knightley), Mary (Talulah Riley), Kitty (Carey Mulligan), and Lydia Bennet (Jena Malone) - in Georgian England. Their lives are turned upside down when wealthy young Mr. Bingley (Simon Woods) and his best friend, Mr. Darcy (Matthew Macfadyen), arrive in their neighborhood.", "cast": "Keira Knightley, Talulah Riley, Rosamund Pike, Jena Malone", "director": "Joe Wright", "genres": ["Drama", "Romance"], "year": "2005", "rating": "PG"}, "Straight Outta Compton": {"desc": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music. Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A. And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.", "cast": "O'Shea Jackson Jr., Corey Hawkins, Jason Mitchell, Neil Brown Jr.", "director": "F. Gary Gray", "genres": ["Biography", "Drama", "History", "Music"], "year": "2015", "rating": "R"}, "Coach Carter": {"desc": "In 1999, Ken Carter accepts the job of basketball coach for his old high school in a poor area of Richmond, CA. As much dismayed by the poor attitudes of his players as well as their dismal play performance, Carter sets about to change both. He imposes a strict regime typified in written contracts that demand respectful behavior, a dress code and good grades for players. Any initial resistance is soon dispelled as the team under Carter's tutelage becomes a undefeated competitor. However, when the overconfident team's behavior begins to stray with too many doing poorly in class, Carter takes immediate action. To the outrage of the team, the school and the community, Carter cancels all team activities and locks the court until the team shows acceptable academic improvement. In the ensuing debate, Carter fights to keep his methods, determined to show the boys that they need good values for their futures and eventually finds he has affected them more profoundly than he ever expected.", "cast": "Samuel L. Jackson, Rob Brown, Robert Ri'chard, Rick Gonzalez", "director": "Thomas Carter", "genres": ["Biography", "Drama", "Sport"], "year": "2005", "rating": "PG-13"}, "8 Mile": {"desc": "Follows a young rapper in the Detroit area, struggling with every aspect of his life, wants to make it big but his friends and foes make this odyssey of rap harder than it may seem.", "cast": "Eminem, Kim Basinger, Mekhi Phifer, Brittany Murphy", "director": "Curtis Hanson", "genres": ["Drama", "Music"], "year": "2002", "rating": "R"}, "Butter": {"desc": "An obese and bullied high school teen called Butter feels lonely and left out, even if he has his loving mother Marian and one longtime friend supporting him. Feeling desperate, he posts online that he'll eat himself to death on New Year's Eve and will do it live via web streaming. The idea gains ground, and he gains popularity in their school along with it. Soon, Butter finds himself rolling with the popular crowd and thinks about what will happen if he doesn't push through.", "cast": "Alex Kersting, Mira Sorvino, Annabeth Gish, Mykelti Williamson", "director": "Paul A. Kaufman", "genres": ["Comedy", "Drama", "Romance"], "year": "2022", "rating": "PG-13"}, "Poetic Justice": {"desc": "After witnessing the murder of her first and only boyfriend, young Justice (Janet Jackson) decides to forget about college and become a South Central Los Angeles, California hairdresser. Avoiding friends, the only way for her to cope with her depression is by composing beautiful poetry. On her way to a convention in Oakland, she is forced to ride with an independent-minded postal worker with whom she has not gotten along in the past. After various arguments between them and their friends, they start to discover that their thoughts on violence, socially and domestically, are the same. Justice may finally feel that she is not as alone as before.", "cast": "Khandi Alexander, Maya Angelou, Ché J. Avery, Lloyd Avery II", "director": "John Singleton", "genres": ["Drama", "Romance"], "year": "1993", "rating": "R"}, "ATL": {"desc": "An orphaned teen tries to steer his younger brother away from a life of crime on the mean streets of Atlanta. Rapper Tip \"T.I.\" Harris stars in this inspirational drama. Evan Ross, Lauren London, Mykelti Williamson. Directed by Chris Robinson.", "cast": "Tip Harris, Evan Ross, Lauren London, Mykelti Williamson", "director": "Chris Robinson", "genres": ["Comedy", "Crime", "Drama", "Music", "Romance"], "year": "2006", "rating": "PG-13"}, "Fade to Black": {"desc": "An intimate look at hip-hop artist Shawn Carter, Jay-Z, revealing the multiple Grammy Award winning artist as never before, from his background and rise to fame to the recording of his last album. The film chronicles the legendary concert of Jay-Z's performance at Madison Square Garden in November 2003. In an unprecedented event, a hip-hop artist sold out an arena in only two hours. Nearly one year later, fans and artists alike still reflect on this monumental musical night. The event was a spectacular culmination of Jay-Z's recording career prior to his self-proclaimed retirement from solo performing. Yet this one night also defined a musical generation, showcasing the evolution and reach of the world's most popular music genre. Guest performers included Jay-Z's closest friends and music industry colleagues: Beyoncé, Mary J. Blige, Missy Elliott, R. Kelly, Foxy Brown, Pharrell, and Questlove and The Illadelphonics along with appearances by hip hop icons Damon Dash, Rick Rubin, Slick Rick, P. Diddy and many others. Viewers get the rare glimpse of Jay-Z's creative process as he searches for inspiration, poetry, and perfection in his songs. Narrated by Jay-Z, his account of the night takes on reflections of his entire musical career and his journey that led to this one astounding, fabled evening--rightfully called \"Fade To Black.\"", "cast": "Jay-Z, Fonzworth Bentley, Beyoncé, Memphis Bleek", "director": "Patrick Paulson, Michael John Warren", "genres": ["Documentary"], "year": "2004", "rating": "R"}, "White Chicks": {"desc": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.", "cast": "Shawn Wayans, Marlon Wayans, Jaime King, Frankie Faison", "director": "Keenen Ivory Wayans", "genres": ["Comedy", "Crime"], "year": "2004", "rating": "PG-13"}, "Elf": {"desc": "Santa's oversized helper Will Ferrell goes to New York to find his real dad, only to discover he's a mean old grouch. Hit comedy with Zooey Deschanel.", "cast": "Bob Newhart, Edward Asner, Mary Steenburgen, Zooey Deschanel", "director": "Jon Favreau", "genres": ["Adventure", "Comedy", "Family"], "year": "2003", "rating": "PG"}, "The Best Man": {"desc": "Harper's autobiographical novel is almost out, his girlfriend Robin desires commitment, and he's best man at the wedding of Lance, a pro athlete. He goes to New York early (Robin will come for the wedding) to hang out with Lance and other friends, including Jordan, his former almost-lover, now in media and privy to an advance copy of the book. The men discuss women, never facing their own double standard; Jordan wants to try again with Harper, at least for one night; and Harper fears that Lance will read his book and learn that the bride-to-be slept with him once to avenge Lance's many affairs. Can Harper mature before Lance kills him, Jordan seduces him, and he loses Robin?", "cast": "Taye Diggs, Nia Long, Morris Chestnut, Harold Perrineau", "director": "Malcolm D. Lee", "genres": ["Comedy", "Drama", "Romance"], "year": "1999", "rating": "R"}, "Up in the Air": {"desc": "Ryan Bingham is a corporate downsizing expert whose cherished life on the road is threatened just as he is on the cusp of reaching ten million frequent flyer miles, and just after he's met the frequent-traveller woman of his dreams.", "cast": "George Clooney, Vera Farmiga, Anna Kendrick, Jason Bateman", "director": "Jason Reitman", "genres": ["Comedy", "Drama", "Romance"], "year": "2009", "rating": "R"}, "Bridget Jones's Diary": {"desc": "Bridget Jones (Renée Zellweger) is an average woman struggling against her age, her weight, her job, her lack of a man, and her many imperfections. As a New Year's Resolution, Bridget decides to take control of her life, starting by keeping a diary in which she will always tell the complete truth. The fireworks begin when her charming though disreputable boss takes an interest in the quirky Miss Jones. Thrown into the mix are Bridget's band of slightly eccentric friends and a rather disagreeable acquaintance into whom Bridget cannot seem to stop running or help finding quietly attractive.", "cast": "Renée Zellweger, Gemma Jones, Celia Imrie, James Faulkner", "director": "Sharon Maguire", "genres": ["Comedy", "Drama", "Romance"], "year": "2001", "rating": "R"}, "Last Holiday": {"desc": "In morte veritas. Georgia Byrd clerks at a New Orleans department store. She defers pleasure: cooks gourmet meals, eats Lean Cuisine; likes a co-worker in silence; has savings, but hasn't left Louisiana. All that changes when a CT Scan discloses she has three weeks to live. She cashes her savings and heads to Grandhotel Pupp in the Czech Republic, where Chef Didier presides. She checks into the Presidential Suite, orders everything on the menu, snowboards, and comes to the attention of the chef and the hotel's powerful American guests: a Congressman, a Senator, a retail magnate, and his mistress. She has nothing to lose, so she tells them what she thinks. Will the truth set them free?", "cast": "Queen Latifah, LL Cool J, Timothy Hutton, Giancarlo Esposito", "director": "Wayne Wang", "genres": ["Comedy", "Drama", "Romance"], "year": "2006", "rating": "PG-13"}, "Forrest Gump": {"desc": "Six Oscars, including Best Picture and Actor (Tom Hanks), went to this extraordinary tale of a simple man who unwittingly becomes involved in some of the key moments of the 20th century. Meanwhile, as the remarkable parade of his life goes by, Forrest never forgets Jenny, the girl he loved as a boy, who makes her own journey through the turbulence of the 1960s and '70s that is far more troubled than the path Forrest happens upon.", "cast": "Tom Hanks, Robin Wright, Gary Sinise, Mykelti Williamson", "director": "Robert Zemeckis", "genres": ["Drama", "Romance"], "year": "1994", "rating": "PG-13"}, "Inception": {"desc": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.", "cast": "Leonardo DiCaprio, Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard", "director": "Christopher Nolan", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2010", "rating": "PG-13"}, "Juice": {"desc": "4 Harlem teens, Q, Bishop, Raheem and Steel, are out skipping school one day when they find out an old friend was killed in a shootout at a bar. After this, Bishop tells his friends that they have no respect, or juice. To get some, they rob a corner grocery store, but things take an unexpected turn. Only the four friends know what happened, but one of them is out for himself.", "cast": "Omar Epps, Tupac Shakur, Jermaine Hopkins, Khalil Kain", "director": "Ernest R. Dickerson", "genres": ["Action", "Crime", "Drama", "Thriller"], "year": "1992", "rating": "R"}, "Set It Off": {"desc": "Four Black women, all of whom have suffered for lack of money and at the hands of the majority, undertake to rob banks. While initially successful, a policeman who was involved in shooting one of the women's brothers is on their trail. As the women add to the loot, their tastes and interests begin to change and their suspicions of each other increase on the way to a climactic robbery.", "cast": "Jada Pinkett Smith, Queen Latifah, Vivica A. Fox, Kimberly Elise", "director": "F. Gary Gray", "genres": ["Action", "Crime", "Drama", "Romance", "Thriller"], "year": "1996", "rating": "R"}, "Ford V Ferrari": {"desc": "Matt Damon and Christian Bale star in FORD v FERRARI, based on the true story of visionary American car designer Carroll Shelby and fearless British-born driver Ken Miles, who together build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966.", "cast": "Christian Bale, Matt Damon, Caitriona Balfe, Josh Lucas", "director": "James Mangold", "genres": ["Action", "Biography", "Drama"], "year": "2019", "rating": "PG-13"}, "The Fast and the Furious": {"desc": "The thrills come fast and furious again as fugitive ex-con Dom Toretto returns to Los Angeles seeking the truth behind a high-profile crime and teams with Agent Brian O'Conner to take down a common enemy. Speeding from the streets of L.A. into the Mexican desert in convoy heists and precision tunnel crawls, Dom and Brian explore exciting new frontiers in the fine art of racing while closing in on their elusive target.", "cast": "Paul Walker, Vin Diesel, Michelle Rodriguez, Jordana Brewster", "director": "Rob Cohen", "genres": ["Action", "Crime", "Thriller"], "year": "2001", "rating": "PG-13"}, "Baby Driver": {"desc": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.", "cast": "Ansel Elgort, Kevin Spacey, Lily James, Jon Bernthal", "director": "Edgar Wright", "genres": ["Action", "Crime", "Drama", "Music"], "year": "2017", "rating": "R"}, "Saving Private Ryan": {"desc": "Steven Spielberg won the Best Director Oscar for this stunning war drama following a squad of U.S. Army soldiers on a mission to rescue a GI trapped behind enemy lines in France on D-Day after all three of the soldier's brothers are killed in action. As the search commences, the close-knit squad sets out through areas still thick with Nazis.", "cast": "Tom Hanks, Tom Sizemore, Edward Burns, Matt Damon", "director": "Steven Spielberg", "genres": ["Drama", "War"], "year": "1998", "rating": "R"}, "Red Tails": {"desc": "The U.S. military recruits African-American fighter pilots to help reclaim the skies over Europe during WWII in this thrilling war adventure. Despite being discriminated against as both citizens and soldiers, the Tuskegee Airmen fight to defend America.", "cast": "Bryan Cranston, David Oyelowo, Cuba Gooding Jr., Daniela Ruah", "director": "Anthony Hemingway", "genres": ["Action", "Drama", "History"], "year": "2012", "rating": "PG-13"}, "No Entry": {"desc": "Against the backdrop of the Windrush scandal, a Jamaican mother, Valerie Powell, struggles to keep her relationship with her son Eli intact. She suffers in silence as she battles with the government's hostile environment tactics, as she keeps the threat of deportation a secret, her psychological state begins to deteriorate as she grapples with the fear of losing her son and the country, she calls home.", "cast": "Susan Aderin, Ntonga Mwanza", "director": "Kaleb D'Aguilar", "genres": ["Short", "Drama"], "year": "2020", "rating": "NR"}, "Red Velvet": {"desc": "If being black was chocolate ice cream, and being Latina was cherry, the world thinks of Aviva Ardor as a swirl of the two when she's really Red Velvet.", "cast": "Diana Acevedo, Isaac Andrade, Magaly Castellanos, Alesha G", "director": "Danielle Gibson", "genres": ["Horror"], "year": "2021", "rating": "NR"}, "Sons of Toledo": {"desc": "After receiving the news of his younger brother’s murder, a mourning barber pushes through the muddy waters of grief to find the courage to do the impossible - give his brother one last cut.", "cast": "Marcus Temple, Jamal Grant, Shinaul Jones, Cincere Temple", "director": "Monty Cole", "genres": ["Short", "Drama"], "year": "2022", "rating": "NR"}, "Out of Air": {"desc": "In a world where oxygen is commodified, a young black man races against the clock to get clean air for his family from the wealthy family whom he works for.", "cast": "Varda Appleton, Naomi Avery, Jessie B. Evans, Faith Imafidon", "director": "Jessie B. Evans", "genres": ["Short", "Sci-Fi"], "year": "2022", "rating": "PG"}, "Aurinko in Adagio": {"desc": "Isolated from society in a deserted delta community with his austere father, a child musical prodigy prepares for the audition of a lifetime while navigating a newfound skill in ancestral dreaming.", "cast": "Taj Johnson, Dexter Tillis, Erinn Jones", "director": "Elisee Junior St Preux", "genres": ["Short", "Drama"], "year": "2021", "rating": "PG-13"}, "Metal": {"desc": "A grieving grandfather takes up graffiti to overcome the loss of his grandson, a talented graffiti artist.", "cast": "English", "director": "Short, Drama", "genres": ["English"], "year": "2021", "rating": "NR"}, "On the Line": {"desc": "A young man in pursuit of his dreams balances an opportunity of a lifetime and the imminent threat of losing his family.", "cast": "Lamar Usher, Riki Yvette Westmoreland, Darren Lee Campbell", "director": "Brianna Devons", "genres": ["Short", "Drama"], "year": "2022", "rating": "NR"}, "Eye for an I": {"desc": "After the tragic death of a loved one, a young black pianist wrestles with guilt and the immediate pressure to retaliate. Jeremiah feels trapped-stuck in a fit of rage, sorrow, and guilt. He seeks answers from his father, but after finding no solace, chooses to act on his own. Set in Compton, CA, EYE FOR AN i is a contemporary meditation on grief and masculinity within our community", "cast": "James Grisom", "director": "English", "genres": ["English"], "year": "2021", "rating": "NR"}, "Allegiant": {"desc": "After the earth-shattering revelations of Insurgent, Tris must escape with Four beyond the wall that encircles Chicago, to finally discover the shocking truth of the world around them.", "cast": "Shailene Woodley, Theo James, Naomi Watts, Octavia Spencer", "director": "Robert Schwentke", "genres": ["Action", "Adventure", "Mystery"], "year": "2016", "rating": "PG-13"}, "Ocean's Eleven": {"desc": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.", "cast": "George Clooney, Brad Pitt, Matt Damon, Andy García", "director": "Steven Soderbergh", "genres": ["Crime", "Thriller"], "year": "2001", "rating": "PG-13"}, "Maze Runner: The Death Cure": {"desc": "Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary Last City, a WCKD-controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get answers to the questions the Gladers have been asking since they first arrived in the maze.", "cast": "Dylan O'Brien, Kaya Scodelario, Thomas Brodie-Sangster, Ki Hong Lee", "director": "Wes Ball", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2018", "rating": "PG-13"}, "Ocean's Twelve": {"desc": "They pulled off one of the biggest heists ever and now they have another job to complete. Ocean's Eleven, which consisted off Danny Ocean (Clooney), Rusty Ryan (Pitt) and Linus Caldwell (Damon) and others, all thought they would be able to enjoy their money, but someone has other plans. Terry Benedict (Garcia) is still fuming after losing his money and wants it back. The team now have the job of getting all the money they spent back, or risk being thrown in jail. How are they going to get it all back? By pulling off another amazing plan.", "cast": "Brad Pitt, Catherine Zeta-Jones, George Clooney, Ed Kross", "director": "Steven Soderbergh", "genres": ["Crime", "Thriller"], "year": "2004", "rating": "PG-13"}, "Divergent": {"desc": "In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.", "cast": "Shailene Woodley, Theo James, Zoë Kravitz, Miles Teller", "director": "Neil Burger", "genres": ["Action", "Adventure", "Mystery"], "year": "2014", "rating": "PG-13"}, "The Maze Runner": {"desc": "A group of amnesiac teens awaken in a deadly maze, and search desperately for an escape route while gathering clues that could reveal the reason for their imprisonment in this thrilling adaptation of the best-selling YA novel. Meanwhile, dreams of a shadowy organization hint at a sinister agenda.", "cast": "Dylan O'Brien, Kaya Scodelario, Thomas Brodie-Sangster, Will Poulter", "director": "Wes Ball", "genres": ["Action", "Mystery", "Sci-Fi", "Thriller"], "year": "2014", "rating": "PG-13"}, "Ocean's Thirteen": {"desc": "Danny Ocean's team of criminals are back and composing a plan more personal than ever. When ruthless casino owner Willy Bank doublecrosses Reuben Tishkoff, causing a heart attack, Danny Ocean vows that he and his team will do anything to bring down Willy Bank along with everything he's got. Even if it means asking for help from an enemy.", "cast": "George Clooney, Brad Pitt, Matt Damon, Michael Mantell", "director": "Steven Soderbergh", "genres": ["Crime", "Thriller"], "year": "2007", "rating": "PG-13"}, "Maze Runner: The Scorch Trials": {"desc": "Frenetic sci-fi action sequel following a group of teenage survivors trying to stay free of a sinister and controlling organisation.", "cast": "Ki Hong Lee, Kaya Scodelario, Thomas Brodie-Sangster, Dexter Darden", "director": "Wes Ball", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2015", "rating": "PG-13"}, "The Divergent Series: Insurgent": {"desc": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side.", "cast": "Kate Winslet, Jai Courtney, Mekhi Phifer, Shailene Woodley", "director": "Robert Schwentke", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2015", "rating": "PG-13"}, "1917": {"desc": "At the height of the First World War, two young British soldiers must cross enemy territory and deliver a message that will stop a deadly attack on hundreds of soldiers.", "cast": "George MacKay, Dean-Charles Chapman, Mark Strong, Andrew Scott", "director": "Sam Mendes", "genres": ["Action", "Drama", "War"], "year": "2019", "rating": "R"}, "American Sniper": {"desc": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.", "cast": "Bradley Cooper, Sienna Miller, Kyle Gallner, Cole Konis", "director": "Clint Eastwood", "genres": ["Action", "Biography", "Drama"], "year": "2014", "rating": "R"}, "Evil Dead": {"desc": "Five friends head to a remote cabin, where the discovery of a Book of the Dead leads them to unwittingly summon up demons living in the nearby woods.", "cast": "Jane Levy, Shiloh Fernandez, Lou Taylor Pucci, Jessica Lucas", "director": "Fede Alvarez", "genres": ["Horror"], "year": "2013", "rating": "R"}, "Scream": {"desc": "Twenty-five years after a streak of brutal murders shocked the quiet town of Woodsboro, a new killer has donned the Ghostface mask and begins targeting a group of teenagers to resurrect secrets from the town’s deadly past.", "cast": "Neve Campbell, Courteney Cox, David Arquette, Melissa Barrera", "director": "Matt Bettinelli-Olpin, Tyler Gillett", "genres": ["Horror", "Mystery", "Thriller"], "year": "2022", "rating": "R"}, "Get Out": {"desc": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.", "cast": "Daniel Kaluuya, Allison Williams, Bradley Whitford, Catherine Keener", "director": "Jordan Peele", "genres": ["Horror", "Mystery", "Thriller"], "year": "2017", "rating": "R"}, "The Cabin in the Woods": {"desc": "Five friends go for a break at a remote cabin, where they get more than they bargained for, discovering the truth behind the cabin in the woods.", "cast": "Kristen Connolly, Chris Hemsworth, Anna Hutchison, Fran Kranz", "director": "Drew Goddard", "genres": ["Horror", "Mystery", "Thriller"], "year": "2012", "rating": "R"}, "Old": {"desc": "A family on a tropical holiday discovers that the secluded beach where they are staying is somehow causing them to age rapidly, reducing their entire lives into a single day.", "cast": "Gael García Bernal, Vicky Krieps, Alex Wolff, Thomasin McKenzie", "director": "M. Night Shyamalan", "genres": ["Drama", "Horror", "Mystery", "Thriller"], "year": "2021", "rating": "PG-13"}, "War of the Worlds": {"desc": "An alien invasion threatens the future of humanity. The catastrophic nightmare is depicted through the eyes of one American family fighting for survival.", "cast": "Tom Cruise, Dakota Fanning, Miranda Otto, Justin Chatwin", "director": "Steven Spielberg", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2005", "rating": "PG-13"}, "I Know What You Did Last Summer": {"desc": "Jennifer Love Hewitt, Sarah Michelle Gellar, Ryan Phillippe and Freddie Prinze Jr. star in this suspenser. They play friends who accidentally run over a man on a dark road, then dispose of the body. Months later, a menacing figure begins stalking them, claiming to know the \"truth\" about their eventful summer vacation. Anne Heche.", "cast": "Jennifer Love Hewitt, Sarah Michelle Gellar, Ryan Phillippe, Freddie Prinze Jr.", "director": "Jim Gillespie", "genres": ["Horror", "Mystery"], "year": "1997", "rating": "PG-13"}, "Jumanji: Welcome To The Jungle": {"desc": "The tables are turned as four teenagers are sucked into Jumanji's world - pitted against rhinos, black mambas and an endless variety of jungle traps and puzzles. To survive, they'll play as characters from the game.", "cast": "Karen Gillan, Jack Black, Dwayne Johnson, Kevin Hart", "director": "Jake Kasdan", "genres": ["Action", "Adventure", "Comedy"], "year": "2017", "rating": "PG-13"}, "John Wick: Chapter 2": {"desc": "Hit man John Wick is once again called out of retirement in this explosive action sequel, this time by a former colleague who wants him to repay a debt by killing an Italian crime lord. But when the assassination goes awry, Wick finds himself hunted by an international cabal of killers, and his only hope for survival might be a shadowy figure known as the Bowery King.", "cast": "Keanu Reeves, Common, Laurence Fishburne, Ian McShane", "director": "Chad Stahelski", "genres": ["Action", "Crime", "Thriller"], "year": "2017", "rating": "R"}, "John Wick": {"desc": "Prepare to be blown away when retired hit man John Wick returns to the fray to punish the NYC gangsters who destroyed his life.", "cast": "Keanu Reeves, Michael Nyqvist, Alfie Allen, Adrianne Palicki", "director": "David Leitch, Chad Stahelski", "genres": ["Action", "Crime", "Thriller"], "year": "2014", "rating": "R"}, "John Wick: Chapter 3 - Parabellum": {"desc": "The third entry of the franchise sees John Wick on the run with a bounty placed on him after he kills a member of an underground assassin's guild. With every hitman in the world hot on his trail, he enlists the help of a trusted ally to fight his way out of New York City.", "cast": "Keanu Reeves, Halle Berry, Laurence Fishburne, Mark Dacascos", "director": "Chad Stahelski", "genres": ["Action", "Crime", "Thriller"], "year": "2019", "rating": "R"}, "Avengers: Endgame": {"desc": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.", "cast": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth", "director": "Anthony Russo", "genres": ["Action", "Adventure", "Drama"], "year": "2019", "rating": "PG-13"}, "Captain America: The First Avenger": {"desc": "WWII soldier Steve Rogers volunteers for a military experiment that transforms him into a superhero, and he uses his newfound abilities to protect America from a villain known as the Red Skull.", "cast": "Chris Evans, Tommy Lee Jones, Hugo Weaving, Hayley Atwell", "director": "Joe Johnston", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2011", "rating": "PG-13"}, "Iron Man": {"desc": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.", "cast": "Robert Downey Jr., Terrence Howard, Jeff Bridges, Gwyneth Paltrow", "director": "Jon Favreau", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2008", "rating": "PG-13"}, "She's All That": {"desc": "She's All That is your typical high school prom king and queen story and the run in defending the star status in the upcoming election. High school hottie, Zack Siler is dumped by his prom-queen girlfriend, the equally attractive and extremely popular, Taylor Vaughan who fell for a second-hand world reject TV soap star who she met over the spring break. Having been publicly dumped, Zack defends his discomposure by stating that Taylor is all make-up and wonder-bra and he can make any ordinary girl a prom queen with a similar package. His high-school buddy, Dean Sampson, engages him in a bet following this statement and picks the geeky looking Laney Boggs out of the crowd as the girl Zack must transform into the new prom queen. Zack agrees since he has no option, but as time passes and Laney begins to transform, Zack begins to find her attractive. While all that falls beautifully in place, it's not your typical fairy-tale. Throw in Dean Sampson to complicate the situation, as when he first made the bet he never thought that Zack could rise to the challenge but looking at how Laney has transformed, it looks like Zack could be on a winning streak.", "cast": "Freddie Prinze Jr., Rachael Leigh Cook, Matthew Lillard, Paul Walker", "director": "Robert Iscove", "genres": ["Comedy", "Romance"], "year": "1999", "rating": "PG-13"}, "The Waterboy": {"desc": "In this engaging comedy, Adam Sandler plays Bobby Boucher, a lovable dolt from the Louisiana bayou who works as a waterboy for a college football team. But when Bobby gets angry, he becomes a football dynamo, and the coach decides to capitalize on that. There's just one problem: Bobby must hide his new role on the team from his neurotic mom (Kathy Bates). Henry Winkler, Fairuza Balk.", "cast": "Adam Sandler, Kathy Bates, Henry Winkler, Fairuza Balk", "director": "Frank Coraci", "genres": ["Comedy", "Sport"], "year": "1998", "rating": "PG-13"}, "School of Rock": {"desc": "Fired from his band and hard up for cash, guitarist and vocalist Dewey Finn finagles his way into a job as a fifth-grade substitute teacher at a private school, where he secretly begins teaching his students the finer points of rock 'n' roll. The school's hard-nosed principal is rightly suspicious of Finn's activities. But Finn's roommate remains in the dark about what he's doing.", "cast": "Jack Black, Joan Cusack, Mike White, Sarah Silverman", "director": "Richard Linklater", "genres": ["Comedy", "Music"], "year": "2003", "rating": "PG-13"}, "Varsity Blues": {"desc": "In this rousing coming-of-age tale, a second-string high-school quarterback (James Van Der Beek) replaces the injured starter. At first, the quarterback revels in his new role, but then, his relaxed attitude causes problems with his gung-ho coach (Jon Voight). Paul Walker, Rob Lester, Scott Caan, Richard Lineback, Ali Larter, Tiffany C. Love.", "cast": "James Van Der Beek, Amy Smart, Jon Voight, Paul Walker", "director": "Brian Robbins", "genres": ["Comedy", "Drama", "Romance", "Sport"], "year": "1999", "rating": "R"}, "Mean Girls": {"desc": "Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George.", "cast": "Lindsay Lohan, Rachel McAdams, Tina Fey, Tim Meadows", "director": "Mark Waters", "genres": ["Comedy"], "year": "2004", "rating": "PG-13"}, "The Longest Yard": {"desc": "Paul \"Wrecking\" Crewe was a revered football superstar back in his day, but that time has since faded. But when a messy drunk driving incident lands him in jail, Paul finds he was specifically requested by Warden Hazen (James Cromwell), a duplicitous prison official well aware of Paul's athletic skills. Paul has been assigned the task of assembling a team of convicts, to square off in a big football game against the sadistic guards. With the help of fellow convict Caretaker, and an old legend named Nate Scarborough to coach, Crewe is ready for what promises to be a very interesting game. It's only the warden and the guards who have no idea who or what they're up against, with Paul the driving force behind the new team.", "cast": "Adam Sandler, Chris Rock, Burt Reynolds, Nelly", "director": "Peter Segal", "genres": ["Comedy", "Crime", "Sport"], "year": "2005", "rating": "PG-13"}, "Zoolander": {"desc": "Derek Zoolander is VH1's three time male model of the year, but when Hansel wins the award instead, Zoolander's world becomes upside down. His friends disappear, his father is disappointed in him, and he feels that he's not good as a model anymore. But when evil fashion guru Mugatu hires Zoolander, he thinks his life has turned back round again, that is until he finds out that Mugatu has actually brainwashed him to kill the Prime Minister of Malaysia. Can Zoolander and his new friends find out how to prevent the incident before it's too late?", "cast": "Ben Stiller, Owen Wilson, Christine Taylor, Will Ferrell", "director": "Ben Stiller", "genres": ["Comedy"], "year": "2001", "rating": "PG-13"}, "Yesterday": {"desc": "A bus accident knocks out aspiring singer-songwriter Jack Malik. Upon waking up, he discovers that he's living in a world where The Beatles never existed. As a result, he's able to pass off their songs as his own.", "cast": "Himesh Patel, Lily James, Sophia Di Martino, Ellise Chappell", "director": "Danny Boyle", "genres": ["Comedy", "Fantasy", "Music"], "year": "2019", "rating": "PG-13"}, "Stripes": {"desc": "Two friends who are dissatisfied with their jobs decide to join the army for a bit of fun.", "cast": "Bill Murray, Harold Ramis, Warren Oates, P.J. Soles", "director": "Ivan Reitman", "genres": ["Comedy", "War"], "year": "1981", "rating": "R"}, "Beetlejuice": {"desc": "Thanks to an untimely demise via drowning, a young couple end up as poltergeists in their New England farmhouse, where they fail to meet the challenge of scaring away the insufferable new owners, who want to make drastic changes. In desperation, the undead newlyweds turn to an expert frightmeister, but he's got a diabolical agenda of his own.", "cast": "Michael Keaton, Geena Davis, Alec Baldwin, Winona Ryder", "director": "Tim Burton", "genres": ["Comedy", "Fantasy"], "year": "1988", "rating": "PG"}, "Scary Movie": {"desc": "A year after disposing of the body of a man they accidentally killed, a group of dumb teenagers are stalked by a bumbling serial killer.", "cast": "Carmen Electra, Dave Sheridan, Frank B. Moore, Giacomo Baessato", "director": "Keenen Ivory Wayans", "genres": ["Comedy"], "year": "2000", "rating": "R"}, "Book Club": {"desc": "Four lifelong friends have their lives forever changed after reading 50 Shades of Grey in their monthly book club.", "cast": "Diane Keaton, Jane Fonda, Candice Bergen, Mary Steenburgen", "director": "Bill Holderman", "genres": ["Comedy", "Drama", "Romance"], "year": "2018", "rating": "PG-13"}, "Bring It On": {"desc": "A champion high school cheerleading squad discovers its previous captain stole all their best routines from an inner-city school and must scramble to compete at this year's championships.", "cast": "Kirsten Dunst, Eliza Dushku, Jesse Bradford, Gabrielle Union", "director": "Peyton Reed", "genres": ["Comedy", "Romance", "Sport"], "year": "2000", "rating": "PG-13"}, "The Best Exotic Marigold Hotel": {"desc": "Tom Wilkinson headlines this uplifting comedy-drama about several British retirees who pool their resources to move to India, only to find that the hotel they're planning to reside at has fallen into disrepair. In time, they attempt to make the best out of a bad situation.", "cast": "Tom Wilkinson, Maggie Smith, Judi Dench, Bill Nighy", "director": "John Madden", "genres": ["Comedy", "Drama", "Romance"], "year": "2012", "rating": "PG-13"}, "The Way Way Back": {"desc": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.", "cast": "Liam James, Steve Carell, Toni Collette, AnnaSophia Robb", "director": "Nat Faxon, Jim Rash", "genres": ["Comedy", "Drama"], "year": "2013", "rating": "R"}, "The Weekend": {"desc": "A comedian goes away for the weekend with an ex-boyfriend and his new girlfriend.", "cast": "Sasheer Zamata, Tone Bell, DeWanda Wise, Kym Whitley", "director": "Stella Meghie", "genres": ["Comedy", "Drama", "Romance"], "year": "2019", "rating": "R"}, "Forgetting Sarah Marshall": {"desc": "In this fizzy, funny take on the classic screwball comedy, a lovelorn composer flies to a Hawaiian resort in hopes of forgetting the woman who broke his heart. However, soon after arriving he realizes she and her new boyfriend have just checked in.", "cast": "Jason Segel, Kristen Bell, Mila Kunis, Russell Brand", "director": "Nicholas Stoller", "genres": ["Comedy", "Drama", "Romance"], "year": "2008", "rating": "R"}, "Mamma Mia!": {"desc": "The story of a bride-to-be trying to find her real father told using hit songs by the popular 1970s group ABBA.", "cast": "Amanda Seyfried, Stellan Skarsgård, Pierce Brosnan, Nancy Baldwin", "director": "Phyllida Lloyd", "genres": ["Comedy", "Musical", "Romance"], "year": "2008", "rating": "PG-13"}, "Hail, Caesar!": {"desc": "When a Hollywood star mysteriously disappears in the middle of filming, the studio sends their fixer to get him back.", "cast": "Josh Brolin, George Clooney, Alden Ehrenreich, Ralph Fiennes", "director": "Joel Coen, Ethan Coen", "genres": ["Comedy", "Drama", "Mystery"], "year": "2016", "rating": "PG-13"}, "Ferris Bueller's Day Off": {"desc": "A charismatic high-school student convinces his repressed best friend to play hooky with him and his girlfriend and attempts to bring the young man out of his shell during a memorable day in Chicago.", "cast": "Matthew Broderick, Alan Ruck, Mia Sara, Jeffrey Jones", "director": "John Hughes", "genres": ["Comedy"], "year": "1986", "rating": "PG-13"}, "Bridesmaids": {"desc": "This lighthearted comedy from director Paul Feig follows a devoted maid of honor who struggles to put her financial and romantic woes aside as she attempts to plan the perfect wedding for her best friend.", "cast": "Kristen Wiig, Maya Rudolph, Rose Byrne, Wendi McLendon-Covey", "director": "Paul Feig", "genres": ["Comedy"], "year": "2011", "rating": "R"}, "The Nice Guys": {"desc": "A private eye investigates the apparent suicide of a fading porn star in 1970s Los Angeles and uncovers a conspiracy.", "cast": "Russell Crowe, Ryan Gosling, Angourie Rice, Matt Bomer", "director": "Shane Black", "genres": ["Action", "Comedy", "Crime", "Thriller"], "year": "2016", "rating": "R"}, "To Wong Foo, Thanks for Everything! Julie Newmar": {"desc": "A cross country trip to Hollywood is cut short by an unreliable engine & an unpleasant encounter with law enforcement. With the power of drag, three self proclaimed career-girls bring a bit of much needed beauty to rural middle America!", "cast": "Patrick Swayze, Wesley Snipes, John Leguizamo, Stockard Channing", "director": "Beeban Kidron", "genres": ["Comedy", "Drama"], "year": "1995", "rating": "PG-13"}, "The Birdcage": {"desc": "A flamboyantly gay couple pretend to be straight in order to impress the parents of the woman their son wants to marry because the girl's father is a rabidly right-wing U.S. Senator.", "cast": "Robin Williams, Nathan Lane, Dan Futterman, Gene Hackman", "director": "Mike Nichols", "genres": ["Comedy"], "year": "1996", "rating": "R"}, "The Favourite": {"desc": "England, early 18th century. The close relationship between Queen Anne and Sarah Churchill is threatened by the arrival of Sarah's cousin, Abigail Hill, resulting in a bitter rivalry between the two cousins to be the Queen's favourite.", "cast": "Olivia Colman, Emma Stone, Rachel Weisz, Nicholas Hoult", "director": "Yorgos Lanthimos", "genres": ["Biography", "Comedy", "Drama"], "year": "2018", "rating": "R"}, "Smoke Signals": {"desc": "Arnold rescued Thomas from a fire when he was a child. Thomas thinks of Arnold as a hero, while Arnold's son Victor resents his father's alcoholism, violence and abandonment of his family.", "cast": "Adam Beach, Evan Adams, Irene Bedard, Gary Farmer", "director": "Chris Eyre", "genres": ["Comedy", "Drama"], "year": "1998", "rating": "PG-13"}, "The Princess Diaries 2: Royal Engagement": {"desc": "Princess Mia Thermopolis (Anne Hathaway) has just turned 21 and is supposed to succeed her grandmother as the Queen of Genovia. But Viscount Mabrey (John Rhys-Davies), who wants his nephew, who is also in line to the throne, to be the new ruler, reminds everyone of a law that states that an unmarried woman can't be made Queen, and with the backing of Parliament, he opposes Mia's coronation. Queen Clarisse Renaldi (Dame Julie Andrews) asks that Mia be allowed time to find a husband, and she is given 30 days, but Mabrey tries to do what he can to stop that: his nephew, Nicholas Devereaux (Chris Pine) has met Mia and they are attracted to each other, but Mia, upon learning who he is, dislikes and distrusts him, but Queen Clarisse has invited him to stay with them for the 30-day period to keep an eye on him.", "cast": "Anne Hathaway, Julie Andrews, Hector Elizondo, John Rhys-Davies", "director": "Garry Marshall", "genres": ["Comedy", "Family", "Romance"], "year": "2004", "rating": "G"}, "Coco": {"desc": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.", "cast": "Anthony Gonzalez, Gael García Bernal, Benjamin Bratt, Alanna Ubach", "director": "Lee Unkrich", "genres": ["Animation", "Adventure", "Drama"], "year": "2017", "rating": "PG"}, "The Parent Trap": {"desc": "Identical twins Annie and Hallie, separated at birth and each raised by one of their biological parents, discover each other for the first time at summer camp and make a plan to bring their wayward parents back together.", "cast": "Lindsay Lohan, Dennis Quaid, Natasha Richardson, Elaine Hendrix", "director": "Nancy Meyers", "genres": ["Adventure", "Comedy", "Drama", "Family", "Romance"], "year": "1998", "rating": "PG"}, "Ralph Breaks The Internet": {"desc": "Video game bad guy Ralph and fellow misfit Vanellope von Schweetz must risk it all by traveling to the World Wide Web in search of a replacement part to save Vanellope's video game, Sugar Rush. In way over their heads, Ralph and Vanellope rely on the citizens of the internet — the netizens — to help navigate their way, including an entrepreneur named Yesss, who is the head algorithm and the heart and soul of trend-making site BuzzzTube.", "cast": "John C. Reilly, Sarah Silverman, Gal Gadot, Jack McBrayer", "director": "Rich Moore", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "year": "2018", "rating": "PG"}, "Won't You Be My Neighbor?": {"desc": "Charmingly soft-spoken and yet powerfully incisive expressing his profound ideals, Fred Rogers was a unique presence on television for generations. Through interviews of his family and colleagues, the life of this would-be pastor is explored as a man who found a more important calling to provide an oasis for children in a video sea of violent bombardment. That proved to be his landmark series, Mister Rogers' Neighborhood (1968), a show that could gently delve into important subjects no other children's show would have dared for that time. In doing so, Rogers experienced a career where his sweet-tempered idealism charmed and influenced the world whether it be scores of children on TV or recalcitrant authorities in government. However, that beloved personality also hid Rogers' deep self-doubts about himself and occasional misjudgments even as he proved a rock of understanding in times of tragedy for a world that did not always comprehend a man of such noble character.", "cast": "Fred Rogers, Margaret Whitmer, Tom Junod, Joanne Rogers", "director": "Morgan Neville", "genres": ["Documentary", "Biography"], "year": "2018", "rating": "PG-13"}, "Becoming the G.O.A.T.: The Tom Brady Story": {"desc": "Tom Brady is arguably the greatest quarterback of all time with stats that surpass even Peyton Manning, Joe Montana, and Dan Marino. With seven Super Bowl rings and a legendary 60-plus MPH rocket arm, he is the GOAT. Learn the backstory of how this champion rose to the top from his childhood friends, high school and college teammates, coaches, and fellow NFL players.", "cast": "Charlie Weis, Bill Belichick, Tom Brady, Rob Gronkowski", "director": "Johannes Guttenkunst", "genres": ["Documentary"], "year": "2021", "rating": "NR"}, "Senna": {"desc": "A documentary on Brazilian Formula One racing driver Ayrton Senna, who won the F1 world championship three times before his death at age 34.", "cast": "Ayrton Senna, Reginaldo Leme, John Bisignano, Neyde Senna", "director": "Asif Kapadia", "genres": ["Documentary", "Biography", "Sport"], "year": "2011", "rating": "PG-13"}, "The Hurt Locker": {"desc": "An intense portrayal of elite soldiers who have one of the most dangerous jobs in the world: disarming bombs in the heat of combat. When a new sergeant, James, takes over a highly trained bomb disposal team amidst violent conflict, he surprises his two subordinates, Sanborn and Eldridge, by recklessly plunging them into a deadly game of urban combat, behaving as if he's indifferent to death. As the men struggle to control their wild new leader, the city explodes into chaos, and James' true character reveals itself in a way that will change each man forever.", "cast": "Jeremy Renner, Anthony Mackie, Brian Geraghty, Guy Pearce", "director": "Kathryn Bigelow", "genres": ["Drama", "Thriller", "War"], "year": "2009", "rating": "R"}, "Samson and Delilah": {"desc": "This emotional comedy-drama follows two Australian teens (Rowan McNamara, Marissa Gibson) as they leave their isolated Aboriginal community for the world outside and find both danger and love along the way.", "cast": "Rowan McNamara, Marissa Gibson, Mitjili Napanangka Gibson, Scott Thornton", "director": "Warwick Thornton", "genres": ["Drama", "Romance"], "year": "2010", "rating": "Not Rated"}, "Searching for Bobby Fischer": {"desc": "A prepubescent chess prodigy is encouraged to harden himself in order to become a champion like the famous but unlikable Bobby Fischer.", "cast": "Max Pomeranc, Joe Mantegna, Joan Allen, Ben Kingsley", "director": "Steven Zaillian", "genres": ["Biography", "Drama", "Sport"], "year": "1993", "rating": "PG"}, "Kuessipan": {"desc": "Two girls grow up as best friends in an Innu community who promised each other to stick together no matter what. But their friendship is shaken when Mikuan falls for a white boy.", "cast": "Sharon Ishpatao Fontaine, Yamie Grégoire, Étienne Galloy, Cédrick Ambroise", "director": "Myriam Verreault", "genres": ["Drama"], "year": "2019", "rating": "NR"}, "12 Strong": {"desc": "The True Story of the Army's Special Forces \"Green Berets\", who within weeks responded to the 9-11 attack. Green Berets, with the help of the 160th SOAR(A), took over the country and allowed other Special Forces and the rest of the conventional military to begin the more publicly visible war.", "cast": "Chris Hemsworth, Michael Shannon, Michael Peña, Navid Negahban", "director": "Nicolai Fuglsig", "genres": ["Action", "Drama", "History", "War"], "year": "2018", "rating": "R"}, "Birds of Passage": {"desc": "The indigenous Wayuu clans of northern Colombia become entangled in the world of drug trafficking.A young man's attempt to pay the hefty dowry needed to secure the hand in marriage of his intended wife via the drug trade leads to calamity for the entire community.", "cast": "José Acosta, Carmiña Martínez, Jhon Narváez, Natalia Reyes", "director": "Ciro Guerra, Cristina Gallego", "genres": ["Crime", "Drama"], "year": "2018", "rating": "NR"}, "Hacksaw Ridge": {"desc": "World War II American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first man in American history to receive the Medal of Honor without firing a shot.", "cast": "Andrew Garfield, Richard Pyros, Jacob Warner, Milo Gibson", "director": "Mel Gibson", "genres": ["Biography", "Drama", "History", "War"], "year": "2016", "rating": "R"}, "Fury": {"desc": "In April 1945, as the Allies make their final push in the European Theater, a battle-hardened Army sergeant named Wardaddy commands a five-man Sherman tank crew on a deadly mission behind enemy lines. Outnumbered, out-gunned, and with a rookie soldier thrust into their platoon, Wardaddy and his men face overwhelming odds in their heroic attempts to defend a field hospital from Waffen SS troops.", "cast": "Brad Pitt, Shia LaBeouf, Logan Lerman, Michael Peña", "director": "David Ayer", "genres": ["Action", "Drama", "War"], "year": "2014", "rating": "R"}, "In The Heights": {"desc": "The story of Usnavi, a bodega owner who has mixed feelings about closing his store and retiring to the Dominican Republic or staying in Washington Heights.", "cast": "Anthony Ramos, Corey Hawkins, Leslie Grace, Melissa Barrera", "director": "Jon M. Chu", "genres": ["Drama", "Musical", "Romance"], "year": "2021", "rating": "PG-13"}, "American Me": {"desc": "A Mexican-American Mafia kingpin is released from prison, falls in love for the first time, and grows introspective about his gangster lifestyle.", "cast": "Sal Lopez, Vira Montes, Roberto Martín Márquez, Dyana Ortelli", "director": "Edward James Olmos", "genres": ["Biography", "Crime", "Drama", "Romance"], "year": "1992", "rating": "R"}, "Apollo 13": {"desc": "NASA must devise a strategy to return Apollo 13 to Earth safely after the spacecraft undergoes massive internal damage putting the lives of the three astronauts on board in jeopardy.", "cast": "Tom Hanks, Bill Paxton, Kevin Bacon, Gary Sinise", "director": "Ron Howard", "genres": ["Adventure", "Drama", "History"], "year": "1995", "rating": "PG"}, "The One I Love": {"desc": "A troubled couple vacate to a beautiful getaway, but bizarre circumstances further complicate their situation.", "cast": "Mark Duplass, Elisabeth Moss, Ted Danson, Kiana Cason", "director": "Charlie McDowell", "genres": ["Comedy", "Drama", "Fantasy", "Mystery", "Romance", "Sci-Fi", "Thriller"], "year": "2014", "rating": "R"}, "I, Tonya": {"desc": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the activity is thrown into doubt when her ex-husband intervenes.", "cast": "Margot Robbie, Sebastian Stan, Allison Janney, Julianne Nicholson", "director": "Craig Gillespie", "genres": ["Biography", "Comedy", "Drama", "Sport"], "year": "2018", "rating": "R"}, "Jerry Maguire": {"desc": "Tom Cruise stars as a successful sports agent who sticks to his principles and discovers that there's no room for honesty and integrity in the dog-eat-dog corporate world of professional sports. After losing his job with the agency, he sets out on his own with a loyal co-worker his only employee, and an up-and-coming football star (Cuba Gooding Jr.) as his sole client. Renee Zellweger, Kelly Preston, Bonnie Hunt.", "cast": "Tom Cruise, Cuba Gooding Jr., Renee Zellweger, Kelly Preston", "director": "Cameron Crowe", "genres": ["Comedy", "Drama", "Romance"], "year": "1996", "rating": "R"}, "Battle of the Sexes": {"desc": "The true story of the 1973 tennis match between World number one Billie Jean King and ex-champ and serial hustler Bobby Riggs.", "cast": "Emma Stone, Steve Carell, Andrea Riseborough, Sarah Silverman", "director": "Jonathan Dayton", "genres": ["Biography", "Comedy", "Drama", "History", "Sport"], "year": "2017", "rating": "PG-13"}, "Good Will Hunting": {"desc": "Costars and co-writers Matt Damon and Ben Affleck won an Oscar for their tale of a charismatic genius (Damon) who lands in jail after a playground brawl. His hope for the future lies with a sympathetic therapist (Best Supporting Actor Robin Williams), who understands the young man's rebellious nature. Minnie Driver, Stellan Skarsgard, Casey Affleck.", "cast": "Matt Damon, Robin Williams, Ben Affleck, Minnie Driver", "director": "Gus Van Sant", "genres": ["Drama", "Romance"], "year": "1997", "rating": "R"}, "Blue Jasmine": {"desc": "Woody Allen trades New York City for San Francisco with his comedy-drama Blue Jasmine, starring Cate Blanchett as a troubled former Manhattanite who moves to the City by the Bay to live with her sister after her wealthy husband divorces her. Forced to put her life back together piece by piece while under the effect of powerful anti-depressants, she dates a series of men, attempts to build a career, and slowly learns how to count on herself to survive. Alec Baldwin, Louis C.K., and Bobby Cannavale co-star.", "cast": "Alec Baldwin, Cate Blanchett, Sally Hawkins, Andrew Dice Clay", "director": "Woody Allen", "genres": ["Comedy", "Drama", "Romance"], "year": "2013", "rating": "PG-13"}, "The Imitation Game": {"desc": "Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant team of code-breakers at Britain's top-secret Government Code and Cypher School at Bletchley Park, during the darkest days of World War II.", "cast": "Benedict Cumberbatch, Keira Knightley, Matthew Goode, Rory Kinnear", "director": "Morten Tyldum", "genres": ["Biography", "Drama", "Thriller", "War"], "year": "2014", "rating": "PG-13"}, "Call Me By Your Name": {"desc": "In 1980s Italy, a relationship begins between seventeen-year-old teenage Elio and the older adult man hired as his father's research assistant.", "cast": "Armie Hammer, Timothée Chalamet, Michael Stuhlbarg, Amira Casar", "director": "Luca Guadagnino", "genres": ["Drama", "Romance"], "year": "2017", "rating": "R"}, "Joe Bell": {"desc": "In a rural town, a conservative father finds his values are tested when he uncovers the cruel harassment his teenage son endures for being gay. He then vows to walk, alone, across the United States to draw awareness to supporting one's children no matter their identity. Based on true events.", "cast": "Mark Wahlberg, Connie Britton, Gary Sinise, Morgan Lily", "director": "Reinaldo Marcus Green", "genres": ["Biography", "Drama"], "year": "2021", "rating": "R"}, "Indian Horse": {"desc": "Saul is a great native hockey player who overcomes racism in the 1970s then ultimately becomes tempted by alcoholism.", "cast": "Michiel Huisman, Martin Donovan, Forrest Goodluck, Ajuawak Kapashesit", "director": "Stephen S. Campanelli", "genres": ["Drama", "Sport"], "year": "2018", "rating": "NR"}, "Songs My Brothers Taught Me": {"desc": "Two Lakota siblings living on a South Dakota reservation cope with the death of their wayward father in different ways.", "cast": "John Reddy, Jashaun St. John, Irene Bedard, Eléonore Hendricks", "director": "Chloé Zhao", "genres": ["Drama"], "year": "2015", "rating": "NR"}, "Beans": {"desc": "In 1990, two prominent Mohawk communities find their land and livelihood in jeopardy from the encroaching force of gentrification. Determined to protect their rights, the Mohawk take a stand against the government for nearly eighty days of protest. In defiance of government force, the Mohawk demonstrate the significance of preserving their traditional way of life. Based on true events.", "cast": "Kiawentiio, Violah Beauvais, Rainbow Dickerson, Joel Montgrand", "director": "Tracey Deer", "genres": ["Drama"], "year": "2021", "rating": "PG-13"}, "The Twilight Saga: Eclipse": {"desc": "Bella once again finds herself surrounded by danger as Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob, knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella is confronted with the most important decision of her life.", "cast": "Robert Pattinson, Kristen Stewart, Taylor Lautner, Ashley Greene", "director": "David Slade", "genres": ["Action", "Adventure", "Drama", "Fantasy", "Mystery", "Romance", "Thriller"], "year": "2010", "rating": "PG-13"}, "The Twilight Saga: Breaking Dawn - Part 1": {"desc": "The new found married bliss of Bella Swan and vampire Edward Cullen is cut short when a series of betrayals and misfortunes threatens to destroy their world.", "cast": "Robert Pattinson, Kristen Stewart, Taylor Lautner, Ashley Greene", "director": "Bill Condon", "genres": ["Adventure", "Drama", "Fantasy", "Romance", "Thriller"], "year": "2011", "rating": "PG-13"}, "The Twilight Saga: New Moon": {"desc": "Forks, Washington resident Bella Swan is reeling from the departure of her vampire love, Edward Cullen, and finds comfort in her friendship with Jacob Black, a werewolf. But before she knows it, she's thrust into a centuries-old conflict, and her desire to be with Edward at any cost leads her to take greater and greater risks.", "cast": "Robert Pattinson, Kristen Stewart, Taylor Lautner, Billy Burke", "director": "Chris Weitz", "genres": ["Adventure", "Drama", "Fantasy", "Romance"], "year": "2009", "rating": "PG-13"}, "The Twilight Saga: Breaking Dawn - Part 2": {"desc": "After the birth of Renesmee, the Cullens gather other vampire clans in order to protect the child from a false allegation that puts the family in front of the Volturi.", "cast": "Robert Pattinson, Kristen Stewart, Taylor Lautner, Peter Facinelli", "director": "Bill Condon", "genres": ["Adventure", "Drama", "Fantasy", "Romance"], "year": "2012", "rating": "PG-13"}, "Twilight": {"desc": "When Bella Swan moves to a small town in the Pacific Northwest, she falls in love with Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire. Despite Edward's repeated cautions, Bella can't stay away from him, a fatal move that endangers her own life.", "cast": "Robert Pattinson, Kristen Stewart, Billy Burke, Taylor Lautner", "director": "Catherine Hardwicke", "genres": ["Drama", "Fantasy", "Romance"], "year": "2008", "rating": "PG-13"}, "Top Gun: Maverick": {"desc": "After more than thirty years of service as one of the Navy's top aviators, Pete \"Maverick\" Mitchell is where he belongs, pushing the envelope as a courageous test pilot and dodging the advancement in rank that would ground him. When he finds himself training a detachment of Top Gun graduates for a specialized mission, Maverick encounters Lt. Bradley Bradshaw, call sign: \"Rooster,\" the son of Maverick's late friend and Radar Intercept Officer Lt. Nick Bradshaw, aka \"Goose.\"", "cast": "Tom Cruise, Miles Teller, Jennifer Connelly, Jon Hamm", "director": "Joseph Kosinski", "genres": ["Action", "Drama"], "year": "2022", "rating": "PG-13"}, "Top Gun": {"desc": "A maverick Navy fighter pilot (Tom Cruise) romances his instructor (Kelly McGillis) in an elite training program. Goose: Anthony Edwards. Iceman: Val Kilmer. Viper: Tom Skerritt. Jester: Michael Ironside. Carole: Meg Ryan. Merlin: Tim Robbins. Tony Scott directed.", "cast": "Tom Cruise, Kelly McGillis, Val Kilmer, Anthony Edwards", "director": "Tony Scott", "genres": ["Action", "Drama"], "year": "1986", "rating": "PG"}, "The Hunger Games: Catching Fire": {"desc": "In this stunning sci-fi sequel, Katniss and Peeta tour Panem and sense growing unrest as they prepare to participate in the 75th Hunger Games. Meanwhile, President Snow plots their downfall during preparations for the Quarter Quell, which only occurs every 25 years in celebration of the Capitol's victory over the districts.", "cast": "Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson", "director": "Francis Lawrence", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2013", "rating": "PG-13"}, "The Hunger Games: Mockingjay - Part 2": {"desc": "In the fourth and final installment of the electrifying \"Hunger Games\" saga, Katniss and her allies face their biggest challenge yet as the uprising sets its sights on revenge against President Snow during its siege of the Capitol. Meanwhile, Katniss must also deal with her brainwashed ex-lover and tensions with her current beau.", "cast": "Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson", "director": "Francis Lawrence", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2015", "rating": "PG-13"}, "The Hunger Games: Mockingjay - Part 1": {"desc": "Katniss ends up in District 13 following the Quarter Quell, and sets out to save Peeta while forging a fragile alliance with President Coin in this exciting sequel. Meanwhile, Katniss' courage becomes a source of inspiration to the downtrodden masses.", "cast": "Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson", "director": "Francis Lawrence", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "year": "2014", "rating": "PG-13"}, "The Little Giants": {"desc": "When Danny O'Shea's daughter is cut from the Peewee football team just for being a girl, he decides to form his own team, composed of other ragtag players who were also cut. Can his team really learn enough to beat the elite team, coached by his brother, a former pro player?", "cast": "Rick Moranis, Ed O'Neill, Devon Sawa, Shawna Waldron", "director": "Duwayne Dunham", "genres": ["Comedy", "Family", "Sport"], "year": "1994", "rating": "PG"}, "Shrek": {"desc": "Mike Myers, Eddie Murphy and Cameron Diaz lend their voices to this outrageously funny comedy with dazzling computer animation. It's a fractured fairy tale about an ogre who falls in love with a princess. It's also a clever and sophisticated spoof of children's stories and all things Disney. John Lithgow.", "cast": "Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow", "director": "Vicky Jenson, Andrew Adamson", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy", "Romance"], "year": "2001", "rating": "PG"}, "Shrek the Third": {"desc": "Reluctantly designated as the heir to the land of Far, Far Away, Shrek hatches a plan to install the rebellious Artie as the new king while Princess Fiona tries to fend off a coup d'état by the jilted Prince Charming.", "cast": "Mike Myers, Eddie Murphy, Cameron Diaz, Antonio Banderas", "director": "Chris Miller, Raman Hui", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy", "Romance"], "year": "2007", "rating": "PG"}, "Sonic The Hedgehog": {"desc": "Based on the global blockbuster videogame franchise from Sega, Sonic the Hedgehog tells the story of the world’s speediest hedgehog as he embraces his new home on Earth. In this live-action adventure comedy, Sonic and his new best friend team up to defend the planet from the evil genius Dr. Robotnik and his plans for world domination.", "cast": "Ben Schwartz, James Marsden, Jim Carrey, Tika Sumpter", "director": "Jeff Fowler", "genres": ["Action", "Adventure", "Comedy", "Family", "Fantasy", "Sci-Fi"], "year": "2020", "rating": "PG"}, "August Rush": {"desc": "An orphaned musical prodigy uses his gift as a clue to finding his birth parents.", "cast": "Freddie Highmore, Keri Russell, Jonathan Rhys Meyers, Terrence Howard", "director": "Kirsten Sheridan", "genres": ["Drama", "Music"], "year": "2007", "rating": "PG"}, "Nanny McPhee": {"desc": "1860s Victorian England. Sadly, the widowed undertaker, Cedric Brown, has a lot on his plate. As the desperate father works his fingers to the bone to provide for his seven unruly children, in the meantime, they have managed to drive out not one but seventeen nannies with their elaborate practical jokes and bad behaviour. Then, on a stormy night, the hideous government nanny extraordinaire, Nanny McPhee, sets foot in Cedric's household, bent on transforming the children's manners and the house. Will a dash of magic do the trick?", "cast": "Emma Thompson, Colin Firth, Kelly Macdonald, Thomas Brodie-Sangster", "director": "Kirk Jones", "genres": ["Comedy", "Family", "Fantasy"], "year": "2006", "rating": "PG"}, "How To Train Your Dragon": {"desc": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father", "cast": "Jay Baruchel, Gerard Butler, Craig Ferguson, America Ferrera", "director": "Chris Sanders", "genres": ["Animation", "Action", "Adventure"], "year": "2010", "rating": "PG"}, "Brother Bear": {"desc": "Disney presents Brother Bear, an epic adventure full of comedy, heart and great songs. When an impulsive boy named Kenai is magically transformed into a bear, he must literally walk in another's footsteps until he learns some valuable life lessons.", "cast": "Joaquin Phoenix, Jeremy Suarez, Jason Raize, Rick Moranis", "director": "Aaron Blaise, Robert Walker", "genres": ["Animation", "Adventure", "Comedy", "Drama", "Family", "Fantasy", "Musical"], "year": "2003", "rating": "G"}, "Storks": {"desc": "Storks deliver babies…or at least they used to. Now they deliver packages for a global internet retail giant. Junior, the company’s top delivery stork, is about to be promoted when he accidentally activates the Baby Making Machine, producing an adorable and wholly unauthorized baby girl...", "cast": "Andy Samberg, Katie Crown, Kelsey Grammer, Keegan-Michael Key", "director": "Doug Sweetland", "genres": ["Animation", "Adventure", "Comedy"], "year": "2016", "rating": "PG"}, "Casper": {"desc": "An afterlife therapist and his daughter meet a friendly young ghost when they move into a crumbling mansion in order to rid the premises of wicked spirits.", "cast": "Chauncey Leopardi, Spencer Vrooman, Malachi Pearson, Cathy Moriarty", "director": "Brad Silberling", "genres": ["Comedy", "Family", "Fantasy"], "year": "1995", "rating": "PG"}, "Hotel Transylvania": {"desc": "This uproarious animated comedy follows the high jinks that ensue when an ordinary human unwittingly checks in at the Hotel Transylvania during the same time Dracula is busy hosting a monsters-only birthday party for his daughter.", "cast": "Adam Sandler, Andy Samberg, Selena Gomez, Kevin James", "director": "Genndy Tartakovsky", "genres": ["Animation", "Adventure", "Comedy"], "year": "2012", "rating": "PG"}, "Space Jam: A New Legacy": {"desc": "A rogue artificial intelligence kidnaps the son of famed basketball player LeBron James, who then has to work with Bugs Bunny to win a basketball game.", "cast": "LeBron James, Don Cheadle, Khris Davis, Sonequa Martin-Green", "director": "Malcolm D. Lee", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy", "Sci-Fi", "Sport"], "year": "2021", "rating": "PG"}, "Matilda": {"desc": "An extraordinarily intelligent young girl from a cruel and uncaring family discovers she possesses telekinetic powers and is sent off to a school headed by a tyrannical principal.", "cast": "Mara Wilson, Danny DeVito, Rhea Perlman, Embeth Davidtz", "director": "Danny DeVito", "genres": ["Comedy", "Family", "Fantasy"], "year": "1996", "rating": "PG"}, "Nacho Libre": {"desc": "Nacho Libre is loosely based on the story of Fray Tormenta (\"Friar Storm\"), aka Rev. Sergio Gutierrez Benitez, a real-life Mexican Catholic priest who had a 23-year career as a masked luchador. He competed in order to support the orphanage he directed.", "cast": "Jack Black, Ana de la Reguera, Héctor Jiménez, Darius Rose", "director": "Jared Hess", "genres": ["Comedy", "Family", "Sport"], "year": "2006", "rating": "PG"}, "Up": {"desc": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.", "cast": "Edward Asner, Christopher Plummer, Jordan Nagai, Bob Peterson", "director": "Pete Docter", "genres": ["Animation", "Adventure", "Comedy"], "year": "2009", "rating": "PG"}, "Encanto": {"desc": "Deep in the Colombian mountains, the Madrigal family possesses an extraordinary secret. Each member of the family is able to perform magic. Yet at the heart of the family is 15-year-old Mirabel, who does not seem to possess any unusual abilities. Faced with this harsh reality, Mirabel struggles to reconcile her place within her family while searching for who she truly is.", "cast": "Stephanie Beatriz, Diane Guerrero, Wilmer Valderrama, Stephanie Beatriz", "director": "Byron Howard, Jared Bush", "genres": ["Animation", "Comedy", "Family"], "year": "2021", "rating": "PG"}, "Charlie and the Chocolate Factory": {"desc": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.", "cast": "Johnny Depp, Freddie Highmore, David Kelly, Helena Bonham Carter", "director": "Tim Burton", "genres": ["Adventure", "Comedy", "Family"], "year": "2005", "rating": "PG"}, "Finding Nemo": {"desc": "Best Animated Feature about a clown fish who teams up with a ditzy blue tang to search for his missing son. This witty, sweet and beautifully animated undersea adventure was produced by Disney and Pixar Studios, which also released \"Monsters, Inc.\"", "cast": "Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe", "director": "Andrew Stanton, Lee Unkrich", "genres": ["Animation", "Adventure", "Comedy"], "year": "2003", "rating": "G"}, "The Game Plan": {"desc": "Joe Kingman is a huge football star. He's got women, money, and a good career. Everything is perfect for him. Then one day an 8-year-old girl named Peyton shows up at his door and says that she's his daughter from a previous relationship. Once he has proof that she is telling the truth, he tries but fails miserably at \"parenting\". From problems such as his super speedy car with no back seat, to leaving her at a bar at 3am, he's got a lot to deal with. Eventually though, she gets him, (and his football team) wrapped around her finger. When she has a near-death experience and Joe finds out that her mother, Susan, died early that year, he wants her to move in with him. But her Aunt Stella disagrees and takes her home. Joe has to play the game of his life and when he's injured and things don't look good for him, Peyton comes out and gets him right back on the field.", "cast": "Dwayne Johnson, Madison Pettis, Kyra Sedgwick, Roselyn Sanchez", "director": "Andy Fickman", "genres": ["Comedy", "Family", "Sport"], "year": "2007", "rating": "PG"}, "A Cinderella Story": {"desc": "Samantha Montgomery (Hilary Duff) or \"Sam\", has a rough childhood with her father dying in an earthquake and a new stepmother with two awful daughters. But on the bright side, Sam has an awesome best friend named Carter (Dan Byrd) and an e-mail relationship with a guy named Nomad. One day, Sam gets an e-mail from her Nomad saying that he wants to meet her in the middle of the dance floor at their high school Halloween dance. She accepts the invitation and glides into the room wearing the best outfit ever. Her Nomad takes her outside where they share a romantic dance together and Sam realizes that her e-mail friend is the most popular guy in school, Austin Ames (Chad Michael Murray). She runs back to her stepmother's diner before she knows she went to the dance and drops her phone on the way. Austin finds it and starts a search for his Cinderella.", "cast": "Hilary Duff, Jennifer Coolidge, Chad Michael Murray, Dan Byrd", "director": "Mark Rosman", "genres": ["Comedy", "Family", "Romance"], "year": "2004", "rating": "PG"}, "Save the Last Dance": {"desc": "Sara wants to be a dancer, but her dreams are cut short by the sudden death of her mother. She moves in with her father, who she has not seen for a long time. He lives on the other side of town, in a predominantly Black neighborhood. She gets transferred to a new school where she is one of the few White students there. She becomes friends with Chenille, and later, falls in love with Chenille's brother, Derek.", "cast": "Julia Stiles, Sean Patrick Thomas, Kerry Washington, Fredro Starr", "director": "Thomas Carter", "genres": ["Drama", "Music", "Romance"], "year": "2001", "rating": "PG-13"}, "He's Just Not That Into You": {"desc": "Remember that really cute girl/guy who said they'd call – and didn't? Maybe they lost your number. Maybe they're in the hospital. Maybe they're awed by your looks, brains or success. Or maybe... They're just not that into you.", "cast": "Jennifer Aniston, Drew Barrymore, Jennifer Connelly, Scarlett Johansson", "director": "Ken Kwapis", "genres": ["Comedy", "Drama", "Romance"], "year": "2009", "rating": "PG-13"}, "The Wedding Singer": {"desc": "Robbie, a local rock star turned wedding singer, is dumped on the day of his wedding. Meanwhile, waitress Julia finally sets a wedding date with her fiancée Glenn. When Julia and Robbie meet and hit it off, they find that things are more complicated than anybody thought.", "cast": "Adam Sandler, Drew Barrymore, Christine Taylor, Allen Covert", "director": "Frank Coraci", "genres": ["Comedy", "Music", "Romance"], "year": "1998", "rating": "PG-13"}, "Music and Lyrics": {"desc": "A washed-up '80s pop star gets a chance at a comeback when reigning pop diva Cora Corman invites him to write & record a duet with her, but there's a problem--Alex hasn't written a song in years; he's never written lyrics and he has to come up with a hit in a matter of days.", "cast": "Drew Barrymore, Hugh Grant, Toni Trucks, Brad Garrett", "director": "Marc Lawrence", "genres": ["Comedy", "Music", "Romance"], "year": "2007", "rating": "PG-13"}, "Warm Bodies": {"desc": "After a zombie becomes involved with the girlfriend of one of his victims, their romance sets in motion a sequence of events that might transform the entire lifeless world.", "cast": "Nicholas Hoult, Teresa Palmer, Lio Tipton, John Malkovich", "director": "Jonathan Levine", "genres": ["Comedy", "Horror", "Romance"], "year": "2013", "rating": "PG-13"}, "Marry Me": {"desc": "Explores the possibilities of what might happen when a superstar marries an average Joe as a joke and discovers that perhaps there are no accidents.", "cast": "Brady Noon, Jennifer Lopez, Owen Wilson, Maluma", "director": "Kat Coiro", "genres": ["Comedy", "Music", "Romance"], "year": "2022", "rating": "PG"}, "The Broken Hearts Gallery": {"desc": "Lucy is a young gallery assistant who collects mementos from her relationships. She discovers that she must let go of her past to move forward, and comes up with a lovely, artistic way to help herself and others who have suffered heartbreak.", "cast": "Geraldine Viswanathan, Dacre Montgomery, Utkarsh Ambudkar, Nikki Duval", "director": "Natalie Krinsky", "genres": ["Comedy", "Romance"], "year": "2020", "rating": "PG-13"}, "My Best Friend's Wedding": {"desc": "A strong cast and witty script recommend this delightful romantic comedy about a woman (Julia Roberts) and her best pal Michael (Dermot Mulroney). When he gets engaged, she decides that she wants him for herself and plots to sabotage his nuptials. Cameron Diaz, Rupert Everett.", "cast": "Julia Roberts, Dermot Mulroney, Cameron Diaz, Rupert Everett", "director": "P.J. Hogan", "genres": ["Comedy", "Drama", "Romance"], "year": "1997", "rating": "PG-13"}, "Spider-Man: Into The Spider-Verse": {"desc": "After a bite from a radioactive spider, Miles Morales becomes the one and only Spider-Man. When a dimensional gateway opens up, Miles soon realizes he isn't the only spider superhero as he meets many different versions of spiderman from other universes, including the original Peter Parker.", "cast": "Jake Johnson, Shameik Moore, Brian Tyree Henry, Hailee Steinfeld", "director": "Peter Ramsey, Rodney Rothman, Bob Persichetti", "genres": ["Animation", "Action", "Adventure"], "year": "2018", "rating": "PG"}, "Man Of Steel": {"desc": "A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.", "cast": "Henry Cavill, Amy Adams, Michael Shannon, Kevin Costner", "director": "Zack Snyder", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2013", "rating": "PG-13"}, "Arrival": {"desc": "Alien spacecraft plant themselves at various locations around the globe in this riveting science-fiction film, forcing a linguist and a theoretical physicist to find a way to communicate with the mysterious visitors in order to learn what they want.", "cast": "Amy Adams, Jeremy Renner, Forest Whitaker, Michael Stuhlbarg", "director": "Denis Villeneuve", "genres": ["Drama", "Mystery", "Sci-Fi"], "year": "2016", "rating": "PG-13"}, "2001: A Space Odyssey": {"desc": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.", "cast": "Keir Dullea, Gary Lockwood, William Sylvester, Douglas Rain", "director": "Stanley Kubrick", "genres": ["Adventure", "Sci-Fi"], "year": "1968", "rating": "G"}, "Passengers": {"desc": "In this riveting sci-fi romance, two passengers aboard a spacecraft traveling to a distant planet are brought out of suspended animation by a technical glitch—90 years before the vessel is due to reach its destination. Together, they must investigate the malfunction that awakened them, which could threaten the safety of the ship.", "cast": "Jennifer Lawrence, Chris Pratt, Michael Sheen, Laurence Fishburne", "director": "Morten Tyldum", "genres": ["Drama", "Romance", "Sci-Fi", "Thriller"], "year": "2016", "rating": "R"}, "The Fifth Element": {"desc": "In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity.", "cast": "Bruce Willis, Milla Jovovich, Gary Oldman, Ian Holm", "director": "Luc Besson", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "1997", "rating": "PG-13"}, "Minority Report": {"desc": "In a future where a special police unit is able to arrest murderers before they commit their crimes, an officer from that unit is himself accused of a future murder.", "cast": "Tom Cruise, Max von Sydow, Steve Harris, Neal McDonough", "director": "Steven Spielberg", "genres": ["Action", "Crime", "Mystery", "Sci-Fi", "Thriller"], "year": "2002", "rating": "PG-13"}, "Midnight Special": {"desc": "A father and son go on the run after the dad learns his child possesses special powers.", "cast": "Michael Shannon, Jaeden Martell, Joel Edgerton, Kirsten Dunst", "director": "Jeff Nichols", "genres": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "year": "2016", "rating": "PG-13"}, "Talladega Nights: The Ballad of Ricky Bobby": {"desc": "Fast-paced comic joyride about the roller-coaster career of an off-the-wall NASCAR driver and his good-ol'-boy sidekick.", "cast": "Will Ferrell, John C. Reilly, Michael Clarke Duncan, Sacha Baron Cohen", "director": "Adam McKay", "genres": ["Comedy", "Sport"], "year": "2006", "rating": "PG-13"}, "A League of Their Own": {"desc": "A look at the first women's professional baseball league is set during World War II and focuses on the rivalry between sisters, one a sweet-swinging catcher and the other a pouty, impulsive pitcher, who play on the same team, which is managed by a washed-up, hard-drinking ex-Major Leaguer.", "cast": "Tom Hanks, Geena Davis, Lori Petty, Madonna", "director": "Penny Marshall", "genres": ["Comedy", "Drama", "Sport"], "year": "1992", "rating": "PG"}, "Just Go with It": {"desc": "On a weekend trip to Hawaii, a plastic surgeon convinces his loyal assistant to pose as his soon-to-be-divorced wife in order to cover up a careless lie he told to his much-younger girlfriend.", "cast": "Adam Sandler, Jennifer Aniston, Nicole Kidman, Nick Swardson", "director": "Dennis Dugan", "genres": ["Comedy", "Romance"], "year": "2011", "rating": "PG-13"}, "Anchorman: The Legend of Ron Burgundy": {"desc": "Will Ferrell is a barrel of laughs as callow, sexist Ron Burgundy, a TV anchor in 1970s San Diego who's aghast when he's teamed with an ambitious female reporter behind the news desk.", "cast": "Will Ferrell, Christina Applegate, Paul Rudd, Steve Carell", "director": "Adam McKay", "genres": ["Comedy"], "year": "2004", "rating": "PG-13"}, "The Monuments Men": {"desc": "In this stunning thriller based on actual events, Allied WWII-era art experts go behind enemy lines in Germany to recover works of art stolen by the Nazis, which are slated for destruction if the Third Reich falls. With little knowledge of weapons or warfare, the ragtag squadron have their work cut out for them.", "cast": "George Clooney, Matt Damon, Bill Murray, John Goodman", "director": "George Clooney", "genres": ["Comedy", "Drama", "History", "War"], "year": "2014", "rating": "NR"}, "Anchorman 2: The Legend Continues": {"desc": "With the 70s behind him, San Diego's top rated newsman, Ron Burgundy, returns to take New York's first 24-hour news channel by storm.", "cast": "Will Ferrell, Steve Carell, Paul Rudd, David Koechner", "director": "Adam McKay", "genres": ["Comedy"], "year": "2014", "rating": "PG-13"}, "9 To 5": {"desc": "Three female office workers become friends and get revenge against their boss, a sexist egotistical lying hypocritical bigot, and in so doing create a more efficient and pleasant work environment.", "cast": "Jane Fonda, Lily Tomlin, Dolly Parton, Dabney Coleman", "director": "Colin Higgins", "genres": ["Comedy"], "year": "1980", "rating": "PG"}, "Confessions of a Dangerous Mind": {"desc": "George Clooney made his directorial debut with this wry, tongue-in-cheek drama about Chuck Barris (Sam Rockwell), the game-show host from the '60s and '70s who claims that his flamboyant career was a cover for his double life...as a CIA assassin. Screenwriter Charlie Kaufman adapted Barris's \"unauthorized autobiography.\" Drew Barrymore, Julia Roberts, George Clooney, Maggie Gyllenhaal.", "cast": "Sam Rockwell, Drew Barrymore, George Clooney, Julia Roberts", "director": "George Clooney", "genres": ["Biography", "Comedy", "Crime"], "year": "2002", "rating": "R"}, "Guess Who's Coming to Dinner": {"desc": "In Spencer Tracy and Katharine Hepburn's final screen pairing (their ninth), they play an affluent couple whose liberal views are put to the test when their daughter brings home her fiancé, and he turns out to be a black doctor.", "cast": "Katharine Houghton, Sidney Poitier, Katharine Hepburn, Spencer Tracy", "director": "Stanley Kramer", "genres": ["Comedy", "Drama"], "year": "1967", "rating": "TVPG"}, "Raya and the Last Dragon": {"desc": "Kumandra is a place where humans and dragons peacefully coexist. When sinister monsters called the Druun threaten the community, however, the dragons readily make a sacrifice to save the human race. Hundreds of years later, the same threat returns. It is up to Raya, a lone warrior, to stop them once and for all. She tracks down the last dragon alive. But as she embarks on her journey, she realizes that it will take more than a dragon and its magic to save her world.", "cast": "Kelly Marie Tran, Awkwafina, Izaac Wang, Gemma Chan", "director": "Don Hall, Carlos López Estrada", "genres": ["Animation", "Action", "Adventure"], "year": "2021", "rating": "PG"}, "Zootopia": {"desc": "Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery.", "cast": "Ginnifer Goodwin, Jason Bateman, Idris Elba, Jenny Slate", "director": "Byron Howard", "genres": ["Animation", "Adventure", "Comedy", "Crime", "Family"], "year": "2016", "rating": "PG"}, "Queen of Katwe": {"desc": "A young girl overcomes her disadvantaged upbringing in the slums of Uganda to become a Chess master.", "cast": "Madina Nalwanga, David Oyelowo, Lupita Nyong'o, Martin Kabanza", "director": "Mira Nair", "genres": ["Biography", "Drama", "Sport"], "year": "2016", "rating": "PG"}, "Selena": {"desc": "Jennifer Lopez sizzles in this biography of Tejano music sensation Selena Quintanilla Perez (1971-95), beginning with the height of her fame and tracing back in time through her multicultural background in Texas and her music-rich upbringing under her father's guidance. Edward James Olmos, Jon Seda, Constance Marie, Jacob Vargas, Jackie Guerra, Rebecca Lee Meza, Lupe Ontiveros.", "cast": "Jennifer Lopez, Edward James Olmos, Constance Marie, Jon Seda", "director": "Gregory Nava", "genres": ["Biography", "Drama", "Music"], "year": "1997", "rating": "PG"}, "Soul Surfer": {"desc": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.", "cast": "AnnaSophia Robb, Helen Hunt, Dennis Quaid, Carrie Underwood", "director": "Sean McNamara", "genres": ["Biography", "Drama", "Family", "Sport"], "year": "2011", "rating": "PG"}, "The Joy Luck Club": {"desc": "Adaptation of Amy Tan's bestseller about four immigrant Chinese women and their American-born daughters. The story begins in San Francisco, where three of the women have gathered to bid farewell to their deceased friend's daughter, who's departing for China to meet her long-lost half sisters.", "cast": "Ming-Na Wen, Lauren Tom, Tamlyn Tomita, Rosalind Chao", "director": "Wayne Wang", "genres": ["Drama"], "year": "1994", "rating": "R"}, "Frida": {"desc": "Salma Hayek's Oscar-nominated performance drives this fascinating biopic about Mexican surrealist Frida Kahlo and her fiery marriage to fellow painter Diego Rivera (Alfred Molina). The imaginative film also chronicles her political activism and the bus accident that left her in pain for the rest of her life. Geoffrey Rush, Ashley Judd, Antonio Banderas, Edward Norton.", "cast": "Salma Hayek, Alfred Molina, Mía Maestro, Patricia Reyes Spíndola", "director": "Julie Taymor", "genres": ["Biography", "Drama", "Romance"], "year": "2002", "rating": "R"}, "Glory": {"desc": "Robert Gould Shaw leads the US Civil War's first all-black volunteer company, fighting prejudices of both his own Union army and the Confederates.", "cast": "Matthew Broderick, Denzel Washington, Cary Elwes, Morgan Freeman", "director": "Edward Zwick", "genres": ["Biography", "Drama", "History", "War"], "year": "1989", "rating": "R"}, "The Hate U Give": {"desc": "Raised in a poverty-stricken slum, a 16-year-old girl named Starr now attends a suburban prep school. After she witnesses a police officer shoot her unarmed best friend, she's torn between her two very different worlds as she tries to speak her truth.", "cast": "Amandla Stenberg, Regina Hall, Russell Hornsby, K.J. Apa", "director": "George Tillman", "genres": ["Crime", "Drama"], "year": "2018", "rating": "PG-13"}, "The Defiant Ones": {"desc": "Two prisoners, one black and one white, must work together as they make a desperate bid for freedom while being manacled to each other after they escape from a chain gang in the Deep South. An Oscar winner for the screenplay, and stars Sidney Poitier and Tony Curtis were both nominated for Best Actor.", "cast": "Tony Curtis, Sidney Poitier, Theodore Bikel, Charles McGraw", "director": "Stanley Kramer", "genres": ["Crime", "Drama"], "year": "1958", "rating": "TVPG"}, "The Learning Tree": {"desc": "Gordon Parks' adaptation of his own novel about a black teenager living in 1920s Kansas. After witnessing a murder, he must decide if he should come forward to clear the man being framed for the crime.", "cast": "Kyle Johnson, Alex Clarke, Estelle Evans, Dana Elcar", "director": "Gordon Parks", "genres": ["Drama"], "year": "1969", "rating": "TV14"}, "Race": {"desc": "Based on the story of Jesse Owens, the athlete whose quest to become the greatest track and field athlete in history thrusts him onto the world stage of the 1936 Olympics, where he faces off against Adolf Hitler's vision of Aryan supremacy.", "cast": "Stephan James, Jason Sudeikis, Carice van Houten, Jeremy Irons", "director": "Stephen Hopkins", "genres": ["Biography", "Drama", "Sport"], "year": "2016", "rating": "PG-13"}, "12 Years a Slave": {"desc": "The harrowing true story of Solomon Northup, a free black man in 1800s New York who was kidnapped and forced into slavery on a plantation near New Orleans. Later, he fights for his freedom with the help of a Canadian abolitionist.", "cast": "Chiwetel Ejiofor, Michael Fassbender, Benedict Cumberbatch, Paul Giamatti", "director": "Steve McQueen", "genres": ["Biography", "Drama", "History"], "year": "2013", "rating": "R"}, "Little Women": {"desc": "Four sisters come of age in America in the aftermath of the Civil War.", "cast": "Saoirse Ronan, Florence Pugh, Emma Watson, Eliza Scanlen", "director": "Greta Gerwig", "genres": ["Drama", "Romance"], "year": "2019", "rating": "PG"}, "Amistad": {"desc": "In 1839, the slave ship Amistad set sail from Cuba to America. During the long trip, Cinque leads the slaves in an unprecedented uprising. They are then held prisoner in Connecticut, and their release becomes the subject of heated debate. Freed slave Theodore Joadson wants Cinque and the others exonerated and recruits property lawyer Roger Baldwin to help his case. Eventually, John Quincy Adams also becomes an ally.", "cast": "Morgan Freeman, Nigel Hawthorne, Anthony Hopkins, Djimon Hounsou", "director": "Steven Spielberg", "genres": ["Biography", "Drama", "History"], "year": "1997", "rating": "R"}, "42": {"desc": "The powerful story of Jackie Robinson, the legendary baseball player who broke Major League Baseball’s color barrier when he joined the roster of the Brooklyn Dodgers. The film follows the innovative Dodgers’ general manager Branch Rickey, the MLB executive who first signed Robinson to the minors and then helped to bring him up to the show.", "cast": "Chadwick Boseman, Harrison Ford, Nicole Beharie, Christopher Meloni", "director": "Brian Helgeland", "genres": ["Biography", "Drama", "Sport"], "year": "2013", "rating": "PG-13"}, "Harry Potter And The Deathly Hallows - Part 1": {"desc": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.", "cast": "Daniel Radcliffe, Emma Watson, Rupert Grint, Alan Rickman", "director": "David Yates", "genres": ["Adventure", "Family", "Fantasy"], "year": "2010", "rating": "PG-13"}, "Harry Potter And The Goblet Of Fire": {"desc": "Harry starts his fourth year at Hogwarts, competes in the treacherous Triwizard Tournament and faces the evil Lord Voldemort. Ron and Hermione help Harry manage the pressure – but Voldemort lurks, awaiting his chance to destroy Harry and all that he stands for.", "cast": "Daniel Radcliffe, Rupert Grint, Emma Watson, Ralph Fiennes", "director": "Mike Newell", "genres": ["Adventure", "Family", "Fantasy"], "year": "2005", "rating": "PG-13"}, "Harry Potter And The Chamber Of Secrets": {"desc": "Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.", "cast": "Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Harris", "director": "Chris Columbus", "genres": ["Adventure", "Family", "Fantasy"], "year": "2002", "rating": "PG"}, "Harry Potter And The Order Of The Phoenix": {"desc": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students – dubbed 'Dumbledore's Army' – to defend themselves against the dark arts.", "cast": "Daniel Radcliffe, Rupert Grint, Emma Watson, Michael Gambon", "director": "David Yates", "genres": ["Action", "Adventure", "Family"], "year": "2007", "rating": "PG-13"}, "Harry Potter And The Half-Blood Prince": {"desc": "As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past.", "cast": "Daniel Radcliffe, Rupert Grint, Emma Watson, Tom Felton", "director": "David Yates", "genres": ["Action", "Adventure", "Family"], "year": "2009", "rating": "PG"}, "Harry Potter And The Prisoner Of Azkaban": {"desc": "Harry, Ron and Hermione return to Hogwarts for another magic-filled year. Harry comes face to face with danger yet again, this time in the form of escaped convict, Sirius Black—and turns to sympathetic Professor Lupin for help.", "cast": "Daniel Radcliffe, Rupert Grint, Emma Watson, Gary Oldman", "director": "Alfonso Cuarón", "genres": ["Adventure", "Family", "Fantasy"], "year": "2004", "rating": "PG"}, "Harry Potter And The Deathly Hallows - Part 2": {"desc": "Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.", "cast": "Daniel Radcliffe, Rupert Grint, Emma Watson, Alan Rickman", "director": "David Yates", "genres": ["Adventure", "Family", "Fantasy"], "year": "2011", "rating": "PG-13"}, "Harry Potter And The Sorcerer's Stone": {"desc": "This ripping adaptation of J.K. Rowling's kid-lit smash follows the adventures of a young orphan who enrolls at a boarding school for magicians called Hogwarts and unravels a mystery connected to a diabolical wizard who vanished years ago.", "cast": "Daniel Radcliffe, Emma Watson, Rupert Grint, Maggie Smith", "director": "Chris Columbus", "genres": ["Adventure", "Family", "Fantasy"], "year": "2001", "rating": "PG"}, "Mission: Impossible - Fallout": {"desc": "After a mission goes wrong, Ethan Hunt and his IMF team are blamed and their loyalty is questioned. They attempt to fulfill their initial mission while also trying to outrun a ruthless CIA agent tasked with taking them out. As Hunt fends off these old and new threats, he also realizes allies within IMF might have other motives.", "cast": "Tom Cruise, Henry Cavill, Ving Rhames, Simon Pegg", "director": "Christopher McQuarrie", "genres": ["Action", "Adventure", "Thriller"], "year": "2018", "rating": "PG-13"}, "Mission: Impossible III": {"desc": "In the slick and stylish third installment in the \"Mission: Impossible\" series, retired superspy Ethan Hunt is called back into action to battle a ruthless arms dealer.", "cast": "Tom Cruise, Philip Seymour Hoffman, Ving Rhames, Billy Crudup", "director": "J.J. Abrams", "genres": ["Action", "Adventure", "Thriller"], "year": "2006", "rating": "PG-13"}, "Mission: Impossible": {"desc": "Secret agent Ethan Hunt (Tom Cruise) is framed for the deaths of his espionage team, and must flee government assassins to find the truth. This blockbuster film, inspired by the TV series, was shot on location in Europe. Jon Voight, Emmanuelle Beart, Henry Czerny, Jean Reno, Ving Rhames.", "cast": "Tom Cruise, Jon Voight, Henry Czerny, Emmanuelle Béart", "director": "Brian De Palma", "genres": ["Action", "Adventure", "Thriller"], "year": "1996", "rating": "PG-13"}, "Mission: Impossible - Rogue Nation": {"desc": "Ethan Hunt and his teammates reunite for this pulse-pounding sequel, in which they attempt to take down a secret international organization known as the Syndicate—highly skilled ex-IMF agents who are intent on bringing down their former outfit.", "cast": "Tom Cruise, Jeremy Renner, Simon Pegg, Rebecca Ferguson", "director": "Christopher McQuarrie", "genres": ["Action", "Adventure", "Thriller"], "year": "2013", "rating": "PG-13"}, "Mission: Impossible II": {"desc": "With computer genius Luther Stickell at his side and a beautiful thief on his mind, agent Ethan Hunt races across Australia and Spain to stop a former IMF agent from unleashing a genetically engineered biological weapon called Chimera. This mission, should Hunt choose to accept it, plunges him into the center of an international crisis of terrifying magnitude.", "cast": "Tom Cruise, Dougray Scott, Thandiwe Newton, Ving Rhames", "director": "John Woo", "genres": ["Action", "Adventure", "Thriller"], "year": "2000", "rating": "PG-13"}, "Mission: Impossible - Ghost Protocol": {"desc": "When the Kremlin is bombed and the blame falls on the Impossible Mission Force, Ethan Hunt (Tom Cruise) assembles a new team to uncover the truth by using every high-tech trick in the book in this white-knuckle sequel.", "cast": "Tom Cruise, Paula Patton, Simon Pegg, Jeremy Renner", "director": "Brad Bird", "genres": ["Action", "Adventure", "Thriller"], "year": "2011", "rating": "PG-13"}, "Puss in Boots": {"desc": "Swashbuckling feline Puss in Boots (voice of Antonio Banderas) fights to save his town with the help of Kitty Softpaws (voice of Salma Hayek) and Humpty Dumpty (voice of Zach Galifianakis) in this sweeping animated adventure for the whole family.", "cast": "Antonio Banderas, Salma Hayek, Zach Galifianakis, Billy Bob Thornton", "director": "Chris Miller", "genres": ["Animation", "Action", "Adventure"], "year": "2011", "rating": "PG"}, "Kung Fu Panda": {"desc": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.", "cast": "Jack Black, Dustin Hoffman, Angelina Jolie, Jackie Chan", "director": "Mark Osborne", "genres": ["Animation", "Action", "Adventure", "Comedy", "Family", "Fantasy"], "year": "2008", "rating": "PG"}, "Bee Movie": {"desc": "Honey of an animated comedy was co-written and co-produced by Jerry Seinfeld, who lends his voice to lead character Barry B. Benson. Barry's a worker bee who sets out from the hive to experience the outside world, where he bee-friends a human bee-ing, a florist named Vanessa Bloome (voice of Renee Zellweger). Other voices include Sting, Ray Liotta and Larry King as their cartoon selves, plus former \"Seinfeld\" cast mates Michael Richards and Patrick Warburton.", "cast": "Jerry Seinfeld, Renée Zellweger, Jim Cummings, Matthew Broderick", "director": "Steve Hickner, Simon J. Smith", "genres": ["Animation", "Adventure", "Comedy", "Drama", "Family"], "year": "2007", "rating": "PG"}, "Madagascar": {"desc": "A group of animals who have spent all their life in a New York zoo end up in the jungles of Madagascar, and must adjust to living in the wild.", "cast": "Ben Stiller, Chris Rock, David Schwimmer, Jada Pinkett Smith", "director": "Eric Darnell, Tom McGrath", "genres": ["Animation", "Adventure", "Comedy", "Family"], "year": "2005", "rating": "PG"}, "The Gravedigger's Wife": {"desc": "In times of misfortune, Guled and his family have to push themselves to the limits in order to reunite with their family.", "cast": "Omar Abdi, Yasmin Warsame, Kadar Abdoul-Aziz Ibrahim, Samaleh Ali Obsieh", "director": "Khadar Ayderus Ahmed", "genres": ["Drama"], "year": "2021", "rating": "NR"}, "The Knower (Al Aref)": {"desc": "The film tackles cybercrime through the story of Younis, a man who lives with his wife and their baby girl, as he decides to rob a bank through the internet, but then finds himself chased by a dangerous gang.", "cast": "Ahmed Ezz, Ahmad Fahmy, Mahmoud Hemida, Mostafa Khater", "director": "Ahmad Alaa Aldeeb", "genres": ["Action", "Crime", "Thriller"], "year": "2021", "rating": "PG"}, "Long Live Love!": {"desc": "‘Long Live Love’ tells the story of a disheartened couple, Sati and Metta. The two are about to part ways due to their broken relationship, but destiny is playing a joke on them when Sati gets into an accident and wakes up with amnesia. The only way to bring back parts of his memory is to retrieve old photographs where he is faced with his awful past.", "cast": "Sunny Suwanmethanont, Araya A. Hargate, Rebecca Patricia 'Becky' Armstrong, Niti Chaichitatorn", "director": "Piyakarn Butprasert", "genres": ["Comedy", "Drama", "Romance"], "year": "2023", "rating": "NR"}, "Ride On": {"desc": "Washed-up stuntman Luo can barely make ends meet let alone take care of his beloved stunt horse, Red Hare. Luo reluctantly seeks help from his estranged daughter and her lawyer boyfriend when notified that the horse may be auctioned off to cover his debts. Unexpectedly, Luo and Red Hare become an overnight media sensation when their real-life fight with debt collectors goes viral. And Luo gets a second chance to choose between his stunt career and his family.", "cast": "Jackie Chan, Haocun Liu, Kevin Guo, Yueting Lang", "director": "Larry Yang", "genres": ["Action", "Comedy", "Drama"], "year": "2023", "rating": "G"}, "Spring in Between": {"desc": "Haru is a magazine editor in her third year at a publishing company. She is constantly scolded by her boss and finds it difficult to communicate with her live-in boyfriend. One day, she encounters the painter Tohru Okunai, who only uses blue in his paintings. In spite of being hailed as a genius, Okunai suffers from a learning disability. He says what he thinks without a filter, is open about his feelings and is unable to lie. Haru, finds herself more and more drawn to him as his honesty wins our self-conscious heroine over. Although Haru attempts to close the physical distance between them, she is hurt when Okunai cannot understand her intentions. On the other hand, a female photographer who works on a shoot with Haru and Okunai, appears to strike up a more solid bond with the painter. Haru is tossed and torn between many elements in her life in this touching love story.", "cast": "Hio Miyazawa, Sakurako Konishi, Hamaru Asuka, Hosoda Yoshihiko", "director": "Rika Katsu", "genres": ["Drama", "Romance", "Sci-Fi"], "year": "2023", "rating": "G"}, "Annapurna": {"desc": "Two men, one recently out of the army, walk a trail to a mountain. Uphill and downhill, cool breezes in the shadows of the trees, shouts from the mountaintop. They go hiking and share their regretful love stories.", "cast": "Kim Kang-hyun, Cha Sun-woo, Han Soo-yeon, Shin Yeon-suh", "director": "Hwang Seung-jae", "genres": ["Thriller"], "year": "2023", "rating": "G"}, "Lost in the Stars": {"desc": "He Fei's wife, Li Muzi, disappears during their anniversary trip. When she reappears, he insists that she is not his wife. As Chen Mai, a top lawyer gets involved in this bizarre case, more mysteries start to emerge.", "cast": "Yilong Zhu, Ni Ni, Janice Man, Jiang Du", "director": "Rui Cui, Xiang Liu", "genres": ["Crime", "Drama", "Mystery"], "year": "2023", "rating": "NR"}, "Shadows": {"desc": "Ching is a forensic psychiatrist who has the power to enter a person's subconscious. On her latest case, she suspects that another psychiatrist is responsible or a brutal murder-suicide involving a social worker. While investigating the case with a police detective, Ching finds herself under suspicion as she comes face-to-face with a trauma from her own past.", "cast": "Justin Cheung, Babyjohn Choi, Philip Keung, Man-Lung Ling", "director": "Glenn Chan, Bure Li", "genres": ["Thriller"], "year": "2023", "rating": "PG-13"}, "The Roundup: No Way Out": {"desc": "Seven years after the roundup in Vietnam, Ma Seok-do joins a new squad to investigate a murder case. He soon starts to dig deeper when he finds out the case involves a synthetic drug and a gang of thugs.", "cast": "Ma Dong-seok, Lee Jun-hyuk, Munetaka Aoki, Se-ho Ahn", "director": "Sang-yong Lee", "genres": ["Action", "Crime", "Thriller"], "year": "2023", "rating": "NR"}, "Love My Scent": {"desc": "Changsu happens to get a special perfume. The perfume has a special thing that appeals to women. Ara is also attracted to the perfume and meets Changsu", "cast": "Yoon Shi-Yoon, Seol In-ah, Kim Young-woong, Lee Dong-chan", "director": "Lim Seongyong", "genres": ["Romance", "Comedy"], "year": "2023", "rating": "PG-13"}, "Say I Do to Me": {"desc": "Ping, a Youtuber, concocts a plan to put on a show of marrying herself in what was meant to secure both money and likes. However, the scam ultimately ended up in the discovery of her true self in this coming-of-age fairy tale comedy.", "cast": "Ping Ng, Kin Long Chan, Candy Lo, Jacky Hoo-Yin Tong", "director": "Kiwi Chow", "genres": ["Comedy"], "year": "2023", "rating": "NR"}, "The Devil's Deal": {"desc": "Hae-woong an assembly member candidate, is taken out of the running because he became a thorn in the side of a local bigwig, Soon-tae. Hounded by loan sharks, due to defaulting a campaign loan, he decides to get his hands dirty.", "cast": "Cho Jin-woong, Mu-Yeol Kim, Lee Sung-min, Yeo-Eun Son", "director": "Won-Tae Lee", "genres": ["Crime", "Drama", "Thriller"], "year": "2023", "rating": "NR"}, "And Yet, You Are So Sweet": {"desc": "Maaya is in her second year in high school, and she has just been turned down after confessing her love to a boy for the first time in her life. Chigira is the ace runner on the track team and the school’s hottest heartthrob. He gives everyone the cold shoulder despite being every girl’s idol, but when he sees Maaya all heartbroken, for some reason he proposes a game of “pretend crush,” saying “If you’re gonna try and find someone to crush on, why not crush on me?” And the rules of the game? Do not under any circumstance actually fall in love, and do not let anyone find out. Although Maaya’s not allowed to fall in love with Chigira, she finds it hard to resist temptation in the face of this secret relationship where he constantly babies her. So how does Chigira really feel? And what will become of their “romance”?", "cast": "Kyohei Takahashi, Mei Hata, Rihito Itagaki, Riko", "director": "Takehiko SHINJYOU", "genres": ["Romance"], "year": "2023", "rating": "G"}, "Rebound": {"desc": "This true story retells the incredible tale of the 2012 National High School Basketball Championship, in which a new coach and six players from the weakest basketball team ran nonstop for eight days.", "cast": "Jae-hong Ahn, Jinwoon Jeong, Geon-joo Jung, Lee Sin-young", "director": "Hang-jun Jang", "genres": ["Drama", "Sport"], "year": "2023", "rating": "NR"}, "Gold Kingdom and Water Kingdom": {"desc": "Once upon a time, two countries who shared a border wouldn't stop squabbling over petty issues. Their spats eventually escalated into war...over an incident involving dog poop. Finally, the gods declared that both nations had to call a truce. The most beautiful girl in the Gold Kingdom would marry the smartest man in the Water Kingdom, paving the way to a new era of peace! When Sarah, a princess from the Gold Kingdom, meets a charming man named Naranbayar from the Water Kingdom, they decide to do what it takes to stop more pointless conflict between their countries--by pretending to be in love. Will their plan work? And what if real romantic feelings blossom between them?", "cast": "Chafûrin, Banjô Ginga, Minami Hamabe, Kento Kaku", "director": "Kotono Watanabe", "genres": ["Animation", "Drama", "Fantasy", "Romance"], "year": "2023", "rating": "PG"}, "Twelve Days": {"desc": "Twelve scenes of a tumultuous marriage, from its happy beginning to its harsh end.", "cast": "Stephy Tang, Edward Ma, Oi-Wah Lam, Jam Yau", "director": "Oi-Wah Lam", "genres": ["Drama", "Romance"], "year": "2023", "rating": "PG-13"}, "Small, Slow But Steady": {"desc": "A hearing-impaired woman with dreams of becoming a professional boxer due to the pandemic is threatened closure of her boxing club and the illness of its ageing president, who has been her biggest supporter, push her to the limit.", "cast": "Yukino Kishii, Tomokazu Miura, Masaki Miura, Shinichiro Matsuura", "director": "Sho Miyake", "genres": ["Drama", "Sport"], "year": "2022", "rating": "G"}, "Shylock's Children": {"desc": "A million yen goes missing at the Nagahara Branch of Tokyo Daiichi Bank. Long-time customer service staff Nishiki sets out on a mission to uncover the truth together with his colleagues Airi and Tabata . After coming across one tiny question, they find themselves in the face of the massive corruption hidden behind the missing money… but this was merely the beginning of a scandal that would shake the megabank to its very core.", "cast": "Sadawo Abe, Aya Ueto, Yuta Tamamori, Toshirō Yanagiba", "director": "Katsuhide Motoki", "genres": ["Drama"], "year": "2023", "rating": "G"}, "Soulmate": {"desc": "Mi-so and Ha-eun meet in elementary school and quickly become best friends. In high school, Ha-eun meets Jin-woo and starts to have feelings for him, but he starts to have feelings for Mi-so. When they all meet again as adults, they are very different people, but they try to remember what friendship is really about.", "cast": "Kim Da-mi, Jeon So-nee, Byeon Woo-seok, Jang Hye-jin", "director": "Min Yong-keun", "genres": ["Drama", "Romance"], "year": "2023", "rating": "PG-13"}, "Bernadette": {"desc": "At the Elysée Palace, Bernadette Chirac expects to finally get the place she deserved, she who had always worked in the shadow of her husband to make him president. Put aside because she is considered too old-fashioned, Bernadette decides to take her revenge by becoming a major media figure.", "cast": "Artus, Olivier Breitman, Catherine Deneuve, Sara Giraudeau", "director": "Léa Domenach", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "Father & Soldier": {"desc": "1917. Bakary Diallo enlists in the French army to join his 17-year-old son, Thierno, who has been forcibly recruited. Sent to the front, they will have to face the war together. While Thierno learns to become a man, Bakary will do everything to bring him back safely.", "cast": "Omar Sy, Alassane Diong, Jonas Bloquet, Bamar Kane", "director": "Mathieu Vadepied", "genres": ["Action", "Drama", "History"], "year": "2023", "rating": "PG-13"}, "The Truth About La Dolce Vita": {"desc": "On October 20th, 1959, producer Giuseppe Amato is alone in a screening room, watching Federico Fellini 's most famous movie. The working print is more than four-hour long. Fellini would not allow any cut, and distributor Angelo Rizzoli wants to drop the movie. It is the hardest moment in Giuseppe Amato's long career.", "cast": "Luigi Petrucci, Mauro Racanati, Andrea Andreotti, Virginia Cosentini Pallavicino", "director": "Giuseppe Pedersoli", "genres": ["Documentary"], "year": "2020", "rating": "NR"}, "Mission: School of Fun (Die (un)langweiligste Schule der Welt)": {"desc": "Action fan and prank king Maxi has a tough time. He attends the most boring school in the world, has trouble following all the rules and, on top of everything else, has the nerdy Frieda as a seatmate. His vibrant, bubbly nature is a thorn in the headmaster’s side – he wants to ensure law and order and numerous bans. It is exactly at the right moment that the inspector of the Boredom Control Authority shows up and an exciting and unforgettable class trip begins!", "cast": "Felicitas Woll, Oliver Korittke, Max Giermann, Daniela Preuß", "director": "Ekrem Ergün", "genres": ["Comedy", "Family"], "year": "2023", "rating": "NR"}, "Parallel Mothers": {"desc": "In a maternity ward, two women of disparate backgrounds find their lives entwining in an unexpected way. Middle-aged Janis eagerly awaits her new arrival as Ana, a traumatized teen, fears what the future may hold for her and her new child. As the women navigate the trials of childbirth and the impending expectations of motherhood, they develop an intricate, complex bond that irrevocably alters the course of their lives.", "cast": "Penélope Cruz, Milena Smit, Israel Elejalde, Aitana Sánchez-Gijón", "director": "Pedro Almodóvar", "genres": ["Drama"], "year": "2021", "rating": "R"}, "En Los Márgenes (On the Fringe)": {"desc": "Three intertwined stories of individuals trying to keep it together and get through 24 vital hours that will change their lives. They will discover how friendship and solidarity can get us through life’s most difficult moments. A thrilling race against the clock on the fringe of a big city.", "cast": "Penélope Cruz, Luis Tosar, Christian Checa, Aixa Villagrán", "director": "Juan Diego Botto", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "L’amour et les Forêts (Just the Two of Us)": {"desc": "Follows Blanche Renard who meets Greg Lamoureux and believes he is the one, but soon she finds herself caught up in a toxic relationship with a possessive and dangerous man.", "cast": "Virginie Efira, Melvil Poupaud, Dominique Reymond, Romane Bohringer", "director": "Valérie Donzelli", "genres": ["Drama", "Thriller"], "year": "2023", "rating": "NR"}, "Manta, Manta - Zwoter Teil": {"desc": "30 years later, Berti and Uschi are divorced, but their son wants to follow in his father's footsteps and become a racing driver.", "cast": "Sami Nasser, Jan-Philipp Jarke, Lukas Podolski, Jean Pierre Kraemer", "director": "Til Schweiger", "genres": ["Action", "Comedy"], "year": "2023", "rating": "PG-13"}, "Io vivo altrove (What a Life!)": {"desc": "Fausto Perbellini and Fausto Biasutti are middle-aged loners who strike up an unlikely friendship on account of a shared first name. They share a common goal: living a frugal life in the countryside escaping from Rome's hustle. After their relocation into the Biasutti's inherited house in the Friuli hills, they clumsily attempt to farm, while trying to ingratiate themselves with the local folk. What doesn't kill you makes you stronger, and Perbellini and Biasutti grow from their mistakes. They learn how to listen to nature, how to love, and how to build community with others. Ultimately, they win the greatest of all rewards: the gift of true friendship.", "cast": "Giuseppe Battiston, Rolando Ravello, Teco Celio, Diane Fleri", "director": "Giuseppe Battiston", "genres": ["Comedy"], "year": "2023", "rating": "NR"}, "Jeanne du Barry": {"desc": "The life of Jeanne Bécu who was born as the illegitimate daughter of an impoverished seamstress in 1743 and went on to rise through the Court of Louis XV to become his last official mistress.", "cast": "Maïwenn, Johnny Depp, Benjamin Lavernhe, Melvil Poupaud", "director": "Maïwenn", "genres": ["Biography", "Drama", "History"], "year": "2023", "rating": "NR"}, "The Kids Are Alright": {"desc": "When Ricardo, a responsible father, decides to personally take his son to a camp in Asturias, other parents propose that he should also take care of their children. When the train is about to leave, Felipe, a flamboyant individual and grandfather of two of the children, shows up at the station.", "cast": "Santiago Segura, Leo Harlem, El Cejas, David Guapo", "director": "Santiago Segura", "genres": ["Comedy"], "year": "2021", "rating": "G"}, "La vie pour de vrai (Life For Real)": {"desc": "Tridan Lagache has spent his life at Club Med, changing friends every 8 days. At 50, he resigned from the Mexican holiday club where he was born, determined to find, 42 years later, his great childhood love, Violette. He arrives in Paris, naive and lost but happy to be staying with Louis, a half-brother he did not know existed. To get rid of a cumbersome Tridan, Louis begs one of his conquests, Roxane, to pretend to be Violette, whom Tridan thinks he recognizes at first sight.", "cast": "Dany Boon, Kad Merad, Charlotte Gainsbourg, Maxime Gasteuil", "director": "Dany Boon", "genres": ["Comedy"], "year": "2023", "rating": "NR"}, "Todos Lo Saben (Everybody Knows)": {"desc": "Laura returns to her hometown just outside of Madrid for her sister's wedding. What was meant to be a joyous occasion turns into a living nightmare as her daughter gets abducted. With no one left to turn to, she enlists the help of an old friend in hopes of finding any trace of her daughter's abductors.", "cast": "Penélope Cruz, Javier Bardem, Ricardo Darín, Bárbara Lennie", "director": "Asghar Farhadi", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "year": "2018", "rating": "R"}, "The Chapel": {"desc": "Twenty three year old virtuoso pianist Jennifer Rogiers has been living with a terrible secret most of her life. When she enters the world famous Queen Elisabeth competition the memory of a traumatic childhood experience surfaces again.", "cast": "Kevin Janssens, Ruth Becquart, Pierre Bokma, Lydia Indjova", "director": "Dominique Deruddere", "genres": ["Drama", "Thriller"], "year": "2023", "rating": "NR"}, "Un beau matin (One Fine Morning)": {"desc": "With a father suffering from neurodegenerative disease, a young woman lives with her eight-year-old daughter. While struggling to secure a decent nursing home, she runs into an unavailable friend with whom she embarks on an affair.", "cast": "Léa Seydoux, Pascal Greggory, Melvil Poupaud, Nicole Garcia", "director": "Mia Hansen-Løve", "genres": ["Drama", "Romance"], "year": "2023", "rating": "R"}, "Coupez! (Final Cut)": {"desc": "Things go badly for a small film crew shooting a low-budget zombie movie when they are attacked by real zombies.", "cast": "Romain Duris, Bérénice Bejo, Grégory Gadebois, Finnegan Oldfield", "director": "Michel Hazanavicius", "genres": ["Comedy", "Horror"], "year": "2022", "rating": "NR"}, "Les pires (The Worst Ones)": {"desc": "The dramedy follows a group of teenagers on their first acting experience. A Belgian director named Gabriel recruits non-professional actors for his working-class feature film. The volatile teenagers who join his film bring an unexpected authenticity to their roles, but Gabriel starts doubting his street casting decisions.", "cast": "Johan Heldenbergh, Matthias Jacquin, Mallory Wanecque, Loïc Pech", "director": "Lise Akoka, Romane Gueret", "genres": ["Comedy", "Drama"], "year": "2023", "rating": "NR"}, "In einem Land, das es nicht mehr gibt (In a Land That No Longer Exists)": {"desc": "It's 1989 in East Berlin: Suzie is kicked out of school shortly before she graduates from high school and has to defend herself as a worker in the cable factory. However, a randomly taken photo leads them to the fashion world of the GDR. The editor-in-chief Elsa Wilbrodt put them on the cover of Sibylle, the fashion magazine of the GDR. In the Berlin underground scene she made the acquaintance of the gay fashion designer Rudi and the photographer Coyote. Suzie must decide if she's brave enough to leave the old strands behind forever.", "cast": "Marlene Burow, Claudia Michelsen, Peter Schneider, David Schütter", "director": "Aelrun Goette", "genres": ["Drama"], "year": "2022", "rating": "NR"}, "The Spring of My Life (La primavera della mia vita)": {"desc": "Musical duo Colapesce & Dimartino star in a road movie exploring a beautiful and unconventional version of Sicily, caught between gags, self-deprecation, friendship and cosmic trees. After the breakup of their professional partnership and a long period of silence, Antonio (Dimartino) re-contacts Lorenzo (Colapesce) for a new, mysterious and fascinating project. This time the music has nothing to do with it, but the stakes are so high as to dismantle Lorenzo's initial distrust and the deadline so tight as to drag the two friends into a reckless, as reckless, race against time in which the surprises they never end. And Antonio and Lorenzo will have to come to terms with their past and with themselves, until a shocking revelation.", "cast": "Colapesce, Dimartino, Stefania Rocca, Madame", "director": "Zavvo Nicolosi", "genres": ["Comedy"], "year": "2023", "rating": "PG"}, "La (très) grande évasion": {"desc": "Welcome to the world of capital flight. A funny, shocking and true in-depth investigation - a unique and hopeful cinematic call for change.", "cast": "Daniel Bertossa, Yves Bertossa, John Christensen, Antoine Deltour", "director": "Yannick Kergoat", "genres": ["Documentary"], "year": "2022", "rating": "NR"}, "K.G.F: Chapter 2": {"desc": "The blood-soaked land of Kolar Gold Fields (KGF) has a new overlord now - Rocky, whose name strikes fear in the heart of his foes. His allies look up to Rocky as their Savior, the government sees him as a threat to law and order; enemies are clamoring for revenge and conspiring for his downfall. Bloodier battles and darker days await as Rocky continues on his quest for unchallenged supremacy.", "cast": "Yash, Sanjay Dutt, Raveena Tandon, Srinidhi Shetty", "director": "Prashanth Neel", "genres": ["Action", "Crime", "Drama", "Thriller"], "year": "2022", "rating": "PG-13"}, "Pathaan": {"desc": "Indian RAW agent \"Pathaan\" (Shah Rukh Khan) gets to know of a major impending attack against India, mounted by a mercenary group led by the ruthless enigma Jim (John Abraham), who has a history of his own. With the doomsday clock ticking away and an agent Rubai (Deepika Padukone) his only possible ally, Pathaan must fight countless betrayals and deal with destruction as he takes on Jim.", "cast": "Shah Rukh Khan, Deepika Padukone, John Abraham, Dimple Kapadia", "director": "Siddharth Anand", "genres": ["Action", "Adventure", "Thriller"], "year": "2023", "rating": "Not Rated"}, "Dasvi": {"desc": "Jailed under a tough cop, an uneducated politician decides to spend his time studying for high school while his scheming wife has plans of her own.", "cast": "Abhishek Bachchan, Yami Gautam, Nimrat Kaur, Manu Rishi Chadha", "director": "Tushar Jalota", "genres": ["Comedy", "Drama"], "year": "2022", "rating": "PG-13"}, "Jayeshbhai Jordaar": {"desc": "A non-confrontational Jayesh decides to defy his patriarchal family and flee with his pregnant wife Mudra to save their unborn daughter from foeticide. A screwball, hilarious chase begins as Jayesh's father assembles all his might to nab them. Will this unlikely hero manage to create a safe and equal haven for his daughter?", "cast": "Ranveer Singh, Shalini Pandey, Boman Irani, Ratna Pathak", "director": "Divyang Thakkar", "genres": ["Comedy", "Drama"], "year": "2022", "rating": "NR"}, "Selfiee": {"desc": "Bollywood superstar Vijay Kumar needs to obtain a new driving license from RTO officer Om Prakash Agarwal, a diehard fan of Vijay. A misunderstanding escalates into a feud which is played out in front of the entire country.", "cast": "Mrunal Thakur, Akshay Kumar, Emraan Hashmi, Adah Sharma", "director": "Raj Mehta", "genres": ["Action", "Comedy", "Drama", "Thriller"], "year": "2023", "rating": "PG-13"}, "Dhaakad": {"desc": "Special Agent Agni is tasked to find information and eventually, eliminate Rudraveer, an international human trafficker and a coal mafioso. Things turn personal when Agni discovers a truth that connects her to Rudraveer.", "cast": "Kangana Ranaut, Arjun Rampal, Divya Dutta, Saswata Chatterjee", "director": "Razneesh Ghai", "genres": ["Action", "Thriller"], "year": "2022", "rating": "NR"}, "Jungle Cry": {"desc": "The unlikely but true story of fourteen impoverished boys in India who learn rugby for a tournament in just four months. Their instructor Rudra tells the boys to stop practicing soccer, which infuriates their regular instructor. Instead, they must concentrate on rugby so they can travel to the United Kingdom for a once-in-a-lifetime opportunity to see the world outside of India by participating in the 2007 Under-Fourteen Rugby World Cup.", "cast": "Abhay Deol, Emily Shah, Atul Kumar, Stewart Wright", "director": "Sagar Ballary", "genres": ["Drama", "Sport"], "year": "2022", "rating": "NR"}, "Ninguém É de Ninguém (Nobody Belongs to Anyone)": {"desc": "A loving family is destroyed by the insane jealousy and toxic masculinity of the father, Roberto (Danton Mello). Gabriela (Carol Castro) is growing up in a career as a lawyer and receives support from a couple of children whenever her husband provokes conflicts. Dead in tragic circumstances, Roberto does not accept the fact and continues to pursue his family. Based on the novel by Zíbia Gasparetto, \"Nobody Belongs To Anyone\" tells the story of a journey of healing and forgiveness.", "cast": "Renata Castro Barbosa, Paloma Bernardi, Carol Castro, Danton Mello", "director": "Wagner de Assis", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "The Restoration": {"desc": "Tato just moved back home penniless. He decides to sell his bedridden mother’s house. Now he must build a replica of his mother’s bedroom to create the illusion that she is still in her home.", "cast": "Paul Vega, Muki Sabogal, Attilia Boschetti, Delfina Paredes", "director": "Alonso Llosa", "genres": ["Comedy"], "year": "2020", "rating": "NR"}, "Argentina, 1985": {"desc": "A team of lawyers takes on the heads of Argentina's bloody military dictatorship during the 1980s in a battle against odds and a race against time.", "cast": "Ricardo Darín, Gina Mastronicola, Francisco Bertín, Santiago Armas Estevarena", "director": "Santiago Mitre", "genres": ["Biography", "Crime", "Drama", "History"], "year": "2022", "rating": "R"}, "Huesera: The Bone Woman": {"desc": "Valeria has long dreamed about becoming a mother. After learning that she's pregnant, she expects to feel happy, yet something's off.", "cast": "Natalia Solián, Alfonso Dosal, Mayra Batalla, Mercedes Hernández", "director": "Michelle Garza Cervera", "genres": ["Drama", "Horror"], "year": "2023", "rating": "NR"}, "Virgilio": {"desc": "Virgilio Martinez is much more than a chef, he is an artist. Although his Central restaurant in Lima, Peru, is considered to be the best of the decade in Latin America and number 2 in the world, and his wife Pía León is considered to be the world's best female chef, his inspiration, research and creative work goes much further than these recognitions. Virgilio is an explorer of Peru's different regions, giving its origin to the revolutionary concept of the \"World in Altitudes\", based on the elevations of the earth that forever changed the way local gastronomy is seen in today's world.", "cast": "Alfred Oliveri", "director": "Spanish (Latin)", "genres": ["Latin"], "year": "2022", "rating": "NR"}, "Pan's Labyrinth": {"desc": "A chilling mix of war-ravaged reality and fairy-tale magic marks this phantasmagorical yarn, in which a girl in 1944 fascist Spain escapes her hellish surroundings and sadistic stepfather by completing a series of trials in an imaginative fantasy realm.", "cast": "Ivana Baquero, Maribel Verdú, Sergi López, Doug Jones", "director": "Guillermo del Toro", "genres": ["Drama", "Fantasy", "War"], "year": "2006", "rating": "R"}, "I Carry You With Me": {"desc": "An epic love story spanning decades is sparked by a chance encounter between two men in provincial Mexico. Based on a true story, ambition and societal pressure propel an aspiring chef to leave his soulmate and make the treacherous journey to New York, where life will never be the same.", "cast": "Armando Espitia, Christian Vázquez, Michelle Rodríguez, Ángeles Cruz", "director": "Heidi Ewing", "genres": ["Drama"], "year": "2020", "rating": "NR"}, "El Plan Divino": {"desc": "Two altar boys that live in a small church in the middle of the jungle. They grew under the tutelage of Father Roberto, an elderly priest who was their mentor. Now, at the end of his life, they must protect and take care of him. Eustaquio pretends to be in command of the church and Heriberto only thinks about Maria, a beautiful young woman that barely pays attention to him. These young men face their frst existential crisis that leads them to launch a risky plan, a heavenly plan", "cast": "Gastón Pauls, Víctor Laplace, Javier Lester, Paula Sartor", "director": "Víctor Laplace", "genres": ["Spanish (Latin)"], "year": "2019", "rating": "NR"}, "1976": {"desc": "Chile, 1976. Carmen heads off to her beach house to supervise its renovation. Her husband, children and grandchildren come back and forth during the winter vacation. When the family priest asks her to take care of a young man he is sheltering in secret, Carmen steps onto unexplored territories, away from the quiet life she is used to.", "cast": "Aline Küppenheim, Alejandro Goic, Hugo Medina, Nicolás Sepúlveda", "director": "Manuela Martelli", "genres": ["Drama"], "year": "2022", "rating": "NR"}, "Capernaum": {"desc": "A 12-year-old Lebanese street boy decides to sue his parents for bringing him into the world. Born into urban squalor and a hard life on the streets of Beirut, and already serving a five-year sentence for murder, Zain's case against his parents reveals grim details about a home life that is far more troublesome that originally thought.", "cast": "Fadi Kamel Youssef, Cedra Izam, Alaa Chouchnieh, Elias Khoury", "director": "Nadine Labaki", "genres": ["Drama"], "year": "2018", "rating": "R"}, "Say Anything...": {"desc": "An unlikely teen romance begins when an underachieving high-school graduate falls for a valedictorian, much to her disapproving father's dismay.", "cast": "John Cusack, Ione Skye, John Mahoney, Lili Taylor", "director": "Cameron Crowe", "genres": ["Comedy", "Drama", "Romance"], "year": "1989", "rating": "PG-13"}, "Groundhog Day": {"desc": "A narcissistic TV weatherman, along with his attractive-but-distant producer, and his mawkish cameraman, is sent to report on Groundhog Day in the small town of Punxsutawney, where he finds himself repeating the same day over and over.", "cast": "Bill Murray, Andie MacDowell, Chris Elliott, Stephen Tobolowsky", "director": "Harold Ramis", "genres": ["Comedy", "Drama", "Fantasy", "Romance"], "year": "1993", "rating": "PG"}, "La La Land": {"desc": "In this wondrous musical, struggling actress Mia and aspiring jazz pianist Sebastian begin a whirlwind romance as they both pursue their dreams in L.A. However, their relationship is challenged when their careers pull them in different directions.", "cast": "Ryan Gosling, Emma Stone, John Legend, Rosemarie DeWitt", "director": "Damien Chazelle", "genres": ["Comedy", "Drama", "Music"], "year": "2016", "rating": "PG-13"}, "An Affair To Remember": {"desc": "A man and woman meet and fall in love while aboard an ocean liner en route to New York. They agree to meet at the top of the Empire State building in six months to resume their romance provided they've both ended their current respective relationships. Remake of the 1939 classic \"Love Affair.\"", "cast": "Cary Grant, Deborah Kerr, Richard Denning, Cathleen Nesbitt", "director": "Leo McCarey", "genres": ["Drama", "Romance"], "year": "1957", "rating": "NR"}, "500 Days Of Summer": {"desc": "Greeting-card copywriter Tom falls for his coworker Summer in this hilarious and highly unconventional romantic comedy. Tom is sure he's found his soul mate, but Summer claims not to believe in true love and is only interested in having some fun with Tom. The film moves forward and backward through various incidents in Tom and Summer's 500-day love affair.", "cast": "Joseph Gordon-Levitt, Zooey Deschanel, Geoffrey Arend, Chloe Grace Moretz", "director": "Marc Webb", "genres": ["Comedy", "Drama", "Romance"], "year": "2009", "rating": "PG-13"}, "Casablanca": {"desc": "Romance, World War II intrigue, a heroic American expatriate, a brave Czech freedom fighter, arrogant Nazis, patriotic Frenchmen, blackmail, black-marketeers and the usual suspects make this Best Picture even more an audience favorite as time goes by. Director Michael Curtiz scored an Oscar, as did the script.", "cast": "Humphrey Bogart, Ingrid Bergman, Claude Rains, Paul Henreid", "director": "Michael Curtiz", "genres": ["Drama", "Romance", "War"], "year": "1943", "rating": "PG"}, "Four Weddings and A Funeral": {"desc": "Over the course of five social occasions, a committed bachelor must consider the notion that he may have discovered love.", "cast": "Hugh Grant, Andie MacDowell, James Fleet, Simon Callow", "director": "Mike Newell", "genres": ["Comedy", "Drama", "Romance"], "year": "1994", "rating": "R"}, "A Star Is Born": {"desc": "Seasoned musician Jackson Maine discovers — and falls in love with — struggling artist Ally. She has just about given up on her dream to make it big as a singer — until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons.", "cast": "Bradley Cooper, Lady Gaga, Sam Elliott, Andrew Dice Clay", "director": "Bradley Cooper", "genres": ["Drama", "Music", "Romance"], "year": "2018", "rating": "R"}, "Hitch": {"desc": "Dating coach Alex 'Hitch' Hitchens mentors a bumbling client, Albert, who hopes to win the heart of the glamorous Allegra Cole. While Albert makes progress, Hitch faces his own romantic setbacks when proven techniques fail to work on Sara Melas, a tabloid reporter digging for dirt on Allegra Cole's love life. When Sara discovers Hitch's connection to Albert – now Allegra's boyfriend – it threatens to destroy both relationships.", "cast": "Will Smith, Eva Mendes, Kevin James, Amber Valletta", "director": "Andy Tennant", "genres": ["Comedy", "Romance"], "year": "2005", "rating": "PG-13"}, "Love, Simon": {"desc": "Everyone deserves a great love story. But for seventeen-year old Simon Spier it's a little more complicated: he's yet to tell his family or friends he's gay and he doesn't know the identity of the anonymous classmate he's fallen for online.", "cast": "Nick Robinson, Jennifer Garner, Josh Duhamel, Katherine Langford", "director": "Greg Berlanti", "genres": ["Comedy", "Drama"], "year": "2018", "rating": "PG-13"}, "Me Before You": {"desc": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.", "cast": "Emilia Clarke, Sam Claflin, Janet McTeer, Charles Dance", "director": "Thea Sharrock", "genres": ["Drama", "Romance"], "year": "2016", "rating": "PG-13"}, "Crazy, Stupid, Love.": {"desc": "Cal Weaver is living the American dream. He has a good job, a beautiful house, great children and a beautiful wife, named Emily. Cal's seemingly perfect life unravels, however, when he learns that Emily has been unfaithful and wants a divorce. Over 40 and suddenly single, Cal is adrift in the fickle world of dating. Enter, Jacob Palmer, a self-styled player who takes Cal under his wing and teaches him how to be a hit with the ladies.", "cast": "Steve Carell, Julianne Moore, Emma Stone, Ryan Gosling", "director": "Glenn Ficarra", "genres": ["Comedy", "Drama", "Romance"], "year": "2011", "rating": "PG-13"}, "Guardians Of The Galaxy Vol. 2": {"desc": "The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage.", "cast": "Chris Pratt, Zoe Saldana, Dave Bautista, Vin Diesel", "director": "James Gunn", "genres": ["Action", "Adventure", "Comedy"], "year": "2017", "rating": "PG-13"}, "Shang-Chi and the Legend of the Ten Rings": {"desc": "Shang-Chi must confront his father, leader of the Ten Rings organization.", "cast": "Simu Liu, Tony Leung Chiu-Wai, Tony Chiu-Wai Leung, Michelle Yeoh", "director": "Destin Daniel Cretton", "genres": ["Action", "Adventure", "Fantasy"], "year": "2021", "rating": "PG-13"}, "Deadpool": {"desc": "In this irreverent spin on the superhero genre, a mercenary reinvents himself as a wisecracking antihero called Deadpool after an experiment leaves him with advanced healing powers and a disfigured face. He then sets out to seek revenge on those responsible for his transformation.", "cast": "Stefan Kapicic, Ryan Reynolds, Morena Baccarin, Ed Skrein", "director": "Tim Miller", "genres": ["Action", "Comedy"], "year": "2016", "rating": "R"}, "Spider-Man: Homecoming": {"desc": "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.", "cast": "Tom Holland, Michael Keaton, Robert Downey Jr., Marisa Tomei", "director": "Jon Watts", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2017", "rating": "PG-13"}, "Joker": {"desc": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.", "cast": "Joaquin Phoenix, Robert De Niro, Zazie Beetz, Frances Conroy", "director": "Todd Phillips", "genres": ["Crime", "Drama", "Thriller"], "year": "2019", "rating": "R"}, "Captain Marvel": {"desc": "The story follows Carol Danvers as she becomes one of the universe’s most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. Set in the 1990s, Captain Marvel is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe.", "cast": "Brie Larson, Samuel L. Jackson, Ben Mendelsohn, Jude Law", "director": "Ryan Fleck", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2019", "rating": "PG-13"}, "Saw X": {"desc": "John Kramer (Tobin Bell) is back. The most chilling installment of the SAW franchise yet explores the untold chapter of Jigsaw's most personal game. Set between the events of SAW I and II, a sick and desperate John travels to Mexico for a risky and experimental medical procedure in hopes of a miracle cure for his cancer - only to discover the entire operation is a scam to defraud the most vulnerable. Armed with a newfound purpose, John returns to his work, turning the tables on the con artists in his signature visceral way through a series of ingenious and terrifying traps.", "cast": "Tobin Bell, Shawnee Smith, Synnøve Macody Lund, Steven Brand", "director": "Kevin Greutert", "genres": ["Horror", "Mystery", "Thriller"], "year": "2023", "rating": "R"}, "The Creator": {"desc": "Amid a future war between the human race and the forces of artificial intelligence, Joshua, a hardened ex-special forces agent grieving the disappearance of his wife, is recruited to hunt down and kill the Creator, the elusive architect of advanced AI who has developed a mysterious weapon with the power to end the war-and mankind itself.", "cast": "John David Washington, Madeleine Yuna Voyles, Gemma Chan, Allison Janney", "director": "Gareth Edwards", "genres": ["Action", "Adventure", "Drama"], "year": "2023", "rating": "PG-13"}, "The Nun II": {"desc": "A follow-up to the enigmatic gothic horror about a strong evil that haunts and causes supernatural harm to everybody it comes into contact with. After the events of the first film, the said powerful evil now begins to spread in 1956 throughout a town in France as word gets out that a priest has been violently murdered. A finished contemplative in her novitiate, Sister Irene, begins to investigate the murder, only to find a demon behind it -- the same evil that terrorized her in the original film as a nun -- Valak, whom she once again soon comes to encounter.", "cast": "Taissa Farmiga, Jonas Bloquet, Storm Reid, Anna Popplewell", "director": "Michael Chaves", "genres": ["Horror", "Mystery", "Thriller"], "year": "2023", "rating": "R"}, "The Kill Room": {"desc": "THE KILL ROOM is a dark comedy / crime-thriller about a hitman, his boss (Jackson), an art dealer (Thurman) and their money laundering scheme that accidentally turns the hitman into an overnight, avant garde, sensation forcing the dealer to play the art world against the underworld.", "cast": "Samuel L. Jackson, Maya Hawke, Uma Thurman, Joe Manganiello", "director": "Nicol Paone", "genres": ["Comedy", "Thriller"], "year": "2023", "rating": "R"}, "Desperation Road": {"desc": "In a small Mississippi town, justice and the law are two very different things. Academy Award Winner Mel Gibson (Braveheart), Garret Hedlund (TRON: Legacy), and Willa Fitzgerald (Scream: The TV Series) star in a modern noir thriller based on the acclaimed novel by Michael Farris Smith about two lost souls tortured by the mistakes of their past and bound by a secret that keeps them running.", "cast": "Mel Gibson, Willa Fitzgerald, Ryan Hurst, Garrett Hedlund", "director": "Nadine Crocker", "genres": ["Action", "Mystery", "Thriller"], "year": "2023", "rating": "R"}, "The Exorcist: Believer": {"desc": "When victors daughter, Angela, and her friend Katherine, show signs of demonic possession, it unleashes a chain of events that forces single father Victor Fielding to confront the nadir of evil. Terrified and desperate, he seeks out Chris MacNeil, the only person alive who's witnessed anything like it before.", "cast": "Ellen Burstyn, Jennifer Nettles, Leslie Odom Jr., Ann Dowd", "director": "David Gordon Green", "genres": ["Horror"], "year": "2023", "rating": "R"}, "Retribution": {"desc": "A bank executive receives a bomb threat while driving his children to school that his car will explode if they stop and get out.", "cast": "Matthew Modine, Liam Neeson, Jack Champion, Embeth Davidtz", "director": "Nimród Antal", "genres": ["Action", "Thriller"], "year": "2023", "rating": "R"}, "River Wild": {"desc": "Follows a pair of siblings who love but distrust each other as they embark on a white-water rafting trip with a small group. One of their friends from childhood turns out to be more dangerous than he appears.", "cast": "Adam Brody, Courtney Chen, Eve Connolly, Matt Devere", "director": "Ben Ketai", "genres": ["Action", "Adventure", "Thriller"], "year": "2023", "rating": "PG-13"}, "The Good Mother": {"desc": "A journalist who, after the murder of her estranged son, forms an unlikely alliance with his pregnant girlfriend to track down those responsible for his death. Together, they confront a world of drugs and corruption.", "cast": "Olivia Cooke, Hilary Swank, Jack Reynor, Hopper Penn", "director": "Miles Joris-Peyrafitte", "genres": ["Crime", "Drama", "Mystery"], "year": "2023", "rating": "R"}, "Meg 2: The Trench": {"desc": "Get ready for the ultimate adrenaline rush this summer in \"Meg 2: The Trench,\" a literally larger-than-life thrill ride that supersizes the 2018 blockbuster and takes the action to higher heights and even greater depths with multiple massive Megs and so much more. Dive into uncharted waters with Jason Statham and global action icon Wu Jing as they lead a daring research team on an exploratory dive into the deepest depths of the ocean. Their voyage spirals into chaos when a malevolent mining operation threatens their mission and forces them into a high-stakes battle for survival. Pitted against colossal Megs and relentless environmental plunderers, our heroes must outrun, outsmart, and outswim their merciless predators in a pulse-pounding race against time. Immerse yourself in the most electrifying cinematic experience of the year with \"Meg 2: The Trench\" - where the depths of the ocean are matched only by the heights of sheer, unstoppable excitement.", "cast": "Jason Statham, Jing Wu, Shuya Sophia Cai, Cliff Curtis", "director": "Ben Wheatley", "genres": ["Action", "Adventure", "Horror"], "year": "2023", "rating": "PG-13"}, "Insidious: The Red Door": {"desc": "Ten years after he first ventured into the Further, Josh Lambert heads east to drop his son Dalton off at an idyllic, ivy-covered university. However, Dalton's college dream becomes a nightmare when the repressed demons of his past suddenly resurface.", "cast": "Patrick Wilson, Ty Simpkins, Rose Byrne, Lin Shaye", "director": "Patrick Wilson", "genres": ["Horror", "Mystery", "Thriller"], "year": "2023", "rating": "PG-13"}, "Indiana Jones and the Dial of Destiny": {"desc": "Daredevil archaeologist Indiana Jones races against time to retrieve a legendary dial that can change the course of history. Accompanied by his goddaughter, he soon finds himself squaring off against Jürgen Voller, a former Nazi who works for NASA.", "cast": "Harrison Ford, Mads Mikkelsen, Boyd Holbrook, Phoebe Waller-Bridge", "director": "James Mangold", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2023", "rating": "PG-13"}, "Fast X": {"desc": "Dom Toretto and his family are targeted by the vengeful son of drug kingpin Hernan Reyes.", "cast": "Vin Diesel, Michelle Rodriguez, Jason Statham, Jordana Brewster", "director": "Louis Leterrier", "genres": ["Action", "Adventure", "Crime"], "year": "2023", "rating": "PG-13"}, "Cobweb": {"desc": "Horror strikes when an eight-year-old boy named Peter tries to investigate the mysterious knocking noises that are coming from inside the walls of his house and a dark secret that his sinister parents kept hidden from him.", "cast": "Lizzy Caplan, Antony Starr, Cleopatra Coleman, Ellen Dubin", "director": "Samuel Bodin", "genres": ["Horror", "Thriller"], "year": "2023", "rating": "NR"}, "Surrounded": {"desc": "Former Buffalo Soldier Mo Washington travels West to lay claim on a gold mine. After her stagecoach is ambushed, Mo is tasked with holding a dangerous outlaw captive and must survive the day when the bandit's gang tries to free him.", "cast": "Letitia Wright, Jamie Bell, Michael Kenneth Williams, Jeffrey Donovan", "director": "Anthony Mandler", "genres": ["Drama", "Western"], "year": "2023", "rating": "R"}, "The Lesson": {"desc": "Liam, an aspiring and ambitious young writer, eagerly accepts a tutoring position at the family estate of his idol, renowned author JM Sinclair. But soon, Liam realizes that he is ensnared in a web of family secrets, resentment, and retribution.", "cast": "Richard E. Grant, Julie Delpy, Daryl McCormack, Stephen McMillan", "director": "Alice Troughton", "genres": ["Thriller"], "year": "2023", "rating": "R"}, "Transformers: Rise of the Beasts": {"desc": "Primarily influenced by the Beast Wars storyline, Transformers: Rise of the Beasts will take audiences on a '90s globetrotting adventure with the Autobots and introduce a whole new faction of Transformers - the Maximals - to join them as allies in the existing battle for earth. .", "cast": "Michelle Yeoh, Pete Davidson, Colman Domingo, Peter Dinklage", "director": "Steven Caple Jr.", "genres": ["Action", "Adventure", "Sci-Fi"], "year": "2023", "rating": "PG-13"}, "Polite Society": {"desc": "Ria Khan believes she must save her older sister Lena from her impending marriage. After enlisting her friends' help, she attempts to pull off the most ambitious of all wedding heists in the name of independence and sisterhood.", "cast": "Priya Kansara, Ritu Arya, Renu Brindle, Rekha John-Cheriyan", "director": "Nida Manzoor", "genres": ["Action", "Comedy"], "year": "2023", "rating": "PG-13"}, "The Blackening": {"desc": "Seven black friends reunite at a stranded cabin in the woods for Juneteenth, but, unbeknownst to them, they’re trapped with a killer with a vendetta.", "cast": "Antoinette Robertson, Sinqua Walls, Dewayne Perkins, X Mayo", "director": "Tim Story", "genres": ["Comedy", "Horror", "Thriller"], "year": "2023", "rating": "NR"}, "Mercy": {"desc": "An ex-military doctor finds herself in a deadly battle for survival when the Irish mafia seize control of the hospital at which she works. When her son is taken hostage, she is forced to rely upon her battle-hardened past and lethal skills after realizing there's no one left to save the day but her.", "cast": "Leah Gibson, Jonathan Rhys Meyers, Jon Voight, Sebastien Roberts", "director": "Tony Dean Smith", "genres": ["Action"], "year": "2023", "rating": "R"}, "Kandahar": {"desc": "A CIA operative and his translator flee from special forces in Afghanistan after exposing a covert mission.", "cast": "Gerard Butler, Navid Negahban, Ali Fazal, Bahador Foladi", "director": "Ric Roman Waugh", "genres": ["Action", "Thriller"], "year": "2023", "rating": "R"}, "Master Gardener": {"desc": "A meticulous horticulturist who is devoted to tending the grounds of a beautiful estate and pandering to his employer, the wealthy dowager.", "cast": "Joel Edgerton, Sigourney Weaver, Quintessa Swindell, Esai Morales", "director": "Paul Schrader", "genres": ["Drama", "Thriller"], "year": "2023", "rating": "R"}, "Evil Dead Rise": {"desc": "Two sisters find an ancient vinyl that gives birth to bloodthirsty demons that run amok in a Los Angeles apartment building and thrusts them into a primal battle for survival as they face the most nightmarish version of family imaginable.", "cast": "Lily Sullivan, Alyssa Sutherland, Morgan Davies, Gabrielle Echols", "director": "Lee Cronin", "genres": ["Talk-Show"], "year": "2023", "rating": "R"}, "Big George Foreman: The Miraculous Story of the Once and Future Heavyweight Champion of the World": {"desc": "The life and boxing career of George Foreman.", "cast": "Khris Davis, Jasmine Mathews, Sullivan Jones, Lawrence Gilliard Jr.", "director": "George Tillman Jr.", "genres": ["Biography", "Drama", "Sport"], "year": "2023", "rating": "PG-13"}, "Resident Evil: Death Island": {"desc": "D.S.O. agent Leon S. Kennedy is on a mission to rescue Dr. Antonio Taylor from kidnappers, when a mysterious woman thwarts his pursuit. Meanwhile, B.S.A.A. agent Chris Redfield is investigating a zombie outbreak in San Francisco, where the cause of the infection cannot be identified. The only thing the victims have in common is that they all visited Alcatraz Island recently. Following that clue, Chris and his team head to the island, where a new horror awaits them.", "cast": "Erin Cahill, Kevin Dorman, Matthew Mercer, Stephanie Panisello", "director": "Eiichirô Hasumi", "genres": ["Animation", "Action", "Horror"], "year": "2023", "rating": "R"}, "Hypnotic": {"desc": "A detective becomes entangled in a mystery involving his missing daughter and a secret government program while investigating a string of reality-bending crimes.", "cast": "Ben Affleck, Alice Braga, William Fichtner, J. D. Pardo", "director": "Robert Rodriguez", "genres": ["Action", "Mystery", "Thriller"], "year": "2023", "rating": "R"}, "Guy Ritchie's The Covenant": {"desc": "During the war in Afghanistan, a local interpreter risks his own life to carry an injured sergeant across miles of grueling terrain.", "cast": "Jake Gyllenhaal, Dar Salim, Sean Sagar, Jason Wong", "director": "Guy Ritchie", "genres": ["Action", "Drama", "Thriller", "War"], "year": "2023", "rating": "R"}, "The Trouble with Jessica": {"desc": "Successful professional London couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in deep financial trouble. Their situation takes a terrifying nosedive with the shocking behavior of uninvited dinner guest, Jessica (Indira Varma). Faced with the moral dilemma of their lives - and dragging their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) with them - they make a series of choices that could either be their salvation or destruction.", "cast": "Rufus Sewell, Alan Tudyk, Indira Varma, Olivia Williams", "director": "Matt Winn", "genres": ["Comedy"], "year": "2023", "rating": "NR"}, "Dumb Money": {"desc": "Dumb Money is the ultimate David vs. Goliath tale, based on the insane true story of everyday people who flipped the script on Wall Street and got rich by turning GameStop (the video game store) into the world's hottest company. In the middle of everything is regular guy Keith Gill (Paul Dano), who starts it all by sinking his life savings into the stock and posting about it. When his social posts start blowing up, so does his life and the lives of everyone following him. As a stock tip becomes a movement, everyone gets rich - until the billionaires fight back, and both sides find their worlds turned upside down.", "cast": "Paul Dano, Pete Davidson, Vincent D'Onofrio, America Ferrera", "director": "Craig Gillespie", "genres": ["Biography", "Comedy", "Drama"], "year": "2023", "rating": "R"}, "The Adults": {"desc": "The plan to make a trip back home as short as possible begins to unravel as Eric finds himself balancing the challenging relationship with his two sisters and his addiction to a local poker game.", "cast": "Michael Cera, Hannah Gross, Sophia Lillis, Wavyy Jonez", "director": "Dustin Guy Defa", "genres": ["Comedy", "Drama"], "year": "2023", "rating": "R"}, "The Miracle Club": {"desc": "There's just one dream for the women of Ballygar to taste freedom: to win a pilgrimage to the sacred French town of Lourdes.", "cast": "Laura Linney, Kathy Bates, Maggie Smith, Agnes O'Casey", "director": "Thaddeus O'Sullivan", "genres": ["Comedy", "Drama"], "year": "2023", "rating": "PG"}, "Theater Camp": {"desc": "In this original comedy, two best friends are drama instructors at a crumbling theater camp. When a clueless tech-bro arrives to run the property — into the ground — the staff and young students unite for the ultimate show to save their beloved camp. Warning: Some flashing-lights scenes in this film may affect photosensitive viewers.", "cast": "Ben Platt, Molly Gordon, Noah Galvin, Jimmy Tatro", "director": "Molly Gordon", "genres": ["Comedy"], "year": "2023", "rating": "PG-13"}, "Down Low": {"desc": "A deeply repressed man, the uninhibited young man that gives him a happy ending, and all the lives they ruin along the way.", "cast": "Zachary Quinto, Lukas Gage, Judith Light, Simon Rex", "director": "Rightor Doyle", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "Corner Office": {"desc": "Orson, a compulsive bureaucrat who discovers a secret room.", "cast": "Jon Hamm, Danny Pudi, Christopher Heyerdahl, Allison Riley", "director": "Joachim Back", "genres": ["Comedy"], "year": "2022", "rating": "PG-13"}, "Asteroid City": {"desc": "Following a writer on his world famous fictional play about a grieving father who travels with his tech-obsessed family to small rural Asteroid City to compete in a junior stargazing event, only to have his world view disrupted forever.", "cast": "Bryan Cranston, Edward Norton, Jason Schwartzman, Jake Ryan", "director": "Wes Anderson", "genres": ["Comedy", "Drama", "Romance", "Sci-Fi"], "year": "2023", "rating": "PG-13"}, "No Hard Feelings": {"desc": "On the brink of losing her home, Maddie finds an intriguing job listing: helicopter parents looking for someone to bring their introverted 19-year-old son out of his shell before college. She has one summer to make him a man or die trying.", "cast": "Jennifer Lawrence, Andrew Barth Feldman, Laura Benanti, Matthew Broderick", "director": "Gene Stupnitsky", "genres": ["Comedy", "Romance"], "year": "2023", "rating": "R"}, "Honor Society": {"desc": "Senior student Honor's life revolves around getting into Harvard. Willing to do whatever it takes to succeed, Honor comes up with a plan to take down her competition. Things go awry when she starts to develop feelings for one of them.", "cast": "Angourie Rice, Gaten Matarazzo, Christopher Mintz-Plasse, Armani Jackson", "director": "Oran Zegman", "genres": ["Comedy", "Romance"], "year": "2022", "rating": "R"}, "Book Club: The Next Chapter": {"desc": "Follows the new journey of four best friends as they take their book club to Italy for the fun girls trip they never had.", "cast": "Diane Keaton, Jane Fonda, Candice Bergen, Mary Steenburgen", "director": "Bill Holderman", "genres": ["Comedy"], "year": "2023", "rating": "PG-13"}, "Mafia Mamma": {"desc": "An American mom inherits her grandfather's mafia empire in Italy. Guided by the firm's consigliere, she hilariously defies everyone's expectations as the new head of the family business.", "cast": "Monica Bellucci, Alessandro Bressanello, Eduardo Scarpetta, Toni Collette", "director": "Catherine Hardwicke", "genres": ["Action", "Comedy", "Crime"], "year": "2023", "rating": "R"}, "Renfield": {"desc": "Having grown sick and tired of his centuries as Dracula's lackey, Renfield finds a new lease on life — and maybe even redemption — when he falls for feisty, perennially angry traffic cop Rebecca Quincy.", "cast": "Nicholas Hoult, Nicolas Cage, Awkwafina, Ben Schwartz", "director": "Chris McKay", "genres": ["Talk-Show"], "year": "2023", "rating": "R"}, "Buddy Games: Spring Awakening": {"desc": "Faced with their biggest challenge yet, the gang sets out to honor a lost friend only to find themselves in the middle of where it all began – Spring Break – where they learn their old school ways of partying hardly compete with today's generation.", "cast": "Dan Bakkedahl, Kevin Dillon, Josh Duhamel, James Roday Rodriguez", "director": "Josh Duhamel", "genres": ["Comedy"], "year": "2023", "rating": "R"}, "About My Father": {"desc": "When Sebastian tells his old-school Italian immigrant father Salvo that he is going to propose to his all-American girlfriend, Salvo insists on crashing a weekend with her tony parents.", "cast": "Robert De Niro, Sebastian Maniscalco, Leslie Bibb, Kim Cattrall", "director": "Laura Terruso", "genres": ["Comedy"], "year": "2023", "rating": "PG-13"}, "The Little Mermaid": {"desc": "“The Little Mermaid” is visionary filmmaker Rob Marshall’s live-action reimagining of Disney’s beloved animated musical classic, the story of Ariel, a beautiful and spirited young mermaid with a thirst for adventure. The youngest of King Triton’s daughters and the most defiant, Ariel longs to find out more about the world beyond the sea and, while visiting the surface, falls for the dashing Prince Eric. While mermaids are forbidden to interact with humans, Ariel must follow her heart. She makes a deal with the evil sea witch, Ursula, which gives her a chance to experience life on land but ultimately places her life – and her father’s crown – in jeopardy. “The Little Mermaid” is directed by Rob Marshall with a screenplay by David Magee, and is produced by Marc Platt, Lin-Manuel Miranda, John DeLuca and Rob Marshall. Warning: Some flashing-lights scenes in this film may affect photosensitive viewers.", "cast": "Halle Bailey, Jonah Hauer-King, Melissa McCarthy, Javier Bardem", "director": "Rob Marshall", "genres": ["Adventure", "Family", "Fantasy"], "year": "2023", "rating": "PG"}, "Carlos": {"desc": "At the age of 5, in his native Mexico, he learned to play the violin. At 8, he developed a lifelong love for the guitar. At 14, he honed those guitar virtuoso skills and his performance style working as a street musician, starting his own band long after, while still a teenager. At 22 — just before his first album was released to acclaim — Carlos Santana became one of the major discoveries of Woodstock, anchoring the famous festival’s second afternoon on August 16, 1969. A music industry legend for 50 years and a 10-time Grammy-winning global sensation, as well as a recipient of a Kennedy Center Honor and a Billboard Century award, Santana continues to be one of the music world’s premiere artists, blending jazz, blues, and the Mariachi sound with a rock n’ roll spirituality and a sense of connection to music’s primal connection to our deepest emotions. The electric documentary CARLOS utilizes new interviews with Santana and his family alongside extraordinary, never-before-seen archival footage — including home video recordings Santana himself made; concert footage; and behindthe-scenes moments — as two-time Emmy-winning director Rudy Valdez (The Sentence; Through Our Eyes; We Are: The Brooklyn Saints) creates an intimate, rich documentary about a man whose sound casts a spell on fans who love — as one of Santana’s famous titles says— “how his rhythm goes.”", "cast": "Carlos Santana, Rudy Valdez, Sara Bernstein, Ryan Carli", "director": "Rudy Valdez", "genres": ["Documentary"], "year": "2023", "rating": "R"}, "Calendar Girls": {"desc": "Florida's most dedicated dance team for women over 60, shaking up the outdated image of \"the little old lady,\" and calling for everyone to dance their hearts out, while they still can.", "cast": "Maria Loohufvud, Love Martinsen, Maria Loohufvud, Love Martinsen", "director": "Maria Loohufvud, Love Martinsen", "genres": ["Documentary"], "year": "2023", "rating": "NR"}, "Lakota Nation vs. United States": {"desc": "A chronicle about how the Lakota Indians fight to reclaim control of the Black Hills. Will investigate how the sacred land was stolen in violation of treaty agreements and feature interviews with Indigenous citizens.", "cast": "Candi Brings Plenty, Phyllis Young, Nick Estes, Krystal Two Bulls", "director": "Jesse Short Bull, Laura Tomaselli", "genres": ["Documentary", "History"], "year": "2022", "rating": "NR"}, "Every Body": {"desc": "Focuses on three individuals who overcame shame, secrecy, and unauthorized surgery throughout their childhoods to enjoy successful adulthoods. Choosing to ignore medical advice to conceal their bodies and coming out as who they truly were.", "cast": "Sean Saifa Wall, Alicia Roth Weigel, River Gallo, Julie Cohen", "director": "Julie Cohen", "genres": ["Documentary"], "year": "2023", "rating": "R"}, "The Last Out": {"desc": "Three young Cuban baseball players leave their families and risk exile to train in Central America and chase their dreams of playing in the Major Leagues.", "cast": "Victor Baró, Carlos O. González, Happy Oliveros, Michael Gassert", "director": "Michael Gassert, Sami Khan", "genres": ["Documentary", "Sport"], "year": "2023", "rating": "NR"}, "It's Quieter in the Twilight": {"desc": "In an unremarkable office space, a select group of aging engineers find themselves at the leading edge of discovery. Fighting outdated technology and time, Voyager's flight-team pursues humankind's greatest exploration. (World Premiere)", "cast": "Andrea Angrum, Todd Barber, Suzanne Dodd, Jefferson Hall", "director": "Billy Miossi", "genres": ["Documentary"], "year": "2023", "rating": "NR"}, "Runner": {"desc": "A refugee marathoner strives to raise his new country's flag at the Olympics.", "cast": "Bill Gallagher", "director": "English", "genres": ["English"], "year": "2019", "rating": "NR"}, "Judy Blume Forever": {"desc": "Judy Blume and the generations of readers who have sparked to her work. It will examine her impact on pop culture and the occasional controversies over her frankness about puberty and sex.", "cast": "Judy Blume, Molly Ringwald, Tayari Jones, Lena Dunham", "director": "Davina Pardo", "genres": ["Documentary", "Biography"], "year": "2023", "rating": "16+"}, "Cassius X: Becoming Ali": {"desc": "Life story on how Cassius Clay fought his way to become World Heavyweight Champion Muhammad Ali.", "cast": "Jim Lampley, Attallah Shabazz, Dee Dee Sharp, Thomas Hauser", "director": "Muta'Ali Muhammad", "genres": ["Documentary"], "year": "2023", "rating": "NR"}, "The Other Fellow": {"desc": "An energetic exploration of masculine identity through the lives, personalities and adventures of a diverse band of men - real men across the globe all sharing the name James Bond. Spanning tales from Swedish 007 super-fan with a Nazi past, a gay New York theatre director, an African American Bond accused of murder, and two resilient women caught up in it all.", "cast": "Gunnar James Bond Schäfer, James Alexander Bond, James Bond Jr., Gregory Itzin", "director": "Matthew Bauer", "genres": ["Documentary", "Biography", "Thriller"], "year": "2023", "rating": "NR"}, "BS High": {"desc": "In 2021, a nationally televised high school football game between top-ranked IMG Academy and unknown Bishop Sycamore High School ended with multiple injuries and a 58-0 blowout win for IMG, igniting a media circus as audiences questioned the legitimacy of Bishop Sycamore and its head coach, Roy Johnson. Revealing one of the most intriguing sagas in the world of high school sports, this eye-opening documentary explores the origins of a fabricated school amid the lucrative, cut-throat world of football prep programs, where the dreams of young athletes hang in the balance. Directed by Academy Award®-winning filmmakers Travon Free (HBO's 38 at the Garden, Two Distant Strangers) and Martin Desmond Roe (Two Distant Strangers), BS High sheds light on how one man's schemes dashed the hopes of his teenage wards, leaving a trail of devastation in his wake.", "cast": "Korey Coleman, Joe Maimone, Quincy Talmadge, Travon Free", "director": "Travon Free, Martin Desmond Roe", "genres": ["Documentary"], "year": "2023", "rating": "TVMA"}, "Miranda's Victim": {"desc": "The true story of Trish Weir who in 1963 was kidnapped and brutally raped by Ernesto Miranda. Committed to putting her assailant in prison, Trish's life is destroyed by America's legal system as she triggers a law that transforms the nation.", "cast": "Abigail Breslin, Donald Sutherland, Andy Garcia, Taryn Manning", "director": "Michelle Danner", "genres": ["English", "French (Parisian)"], "year": "2023", "rating": "NR"}, "Reality": {"desc": "Profiles the arrest of 25 year-old Air Force linguist and NSA contractor Reality Winner for leaking classified information pertaining to Russian interference in the 2016 US Presidential election to the press. Adapted from the 2019 stage play, with dialogue pulled directly from Reality Winner's FBI interview.", "cast": "Sydney Sweeney, Josh Hamilton, Marchánt Davis, Benny Elledge", "director": "Tina Satter", "genres": ["Drama"], "year": "2023", "rating": "TVMA"}, "Brother": {"desc": "Sons of Caribbean immigrants, Francis and Michael face questions of masculinity, identity and family amid the pulsing beat of Toronto's early hip-hop scene.", "cast": "Lamar Johnson, Aaron Pierre, Marsha Stephanie Blake, Kiana Madeira", "director": "Clement Virgo", "genres": ["Drama", "Music"], "year": "2023", "rating": "NR"}, "Jules": {"desc": "Milton lives a quiet life of routine in a small western Pennsylvania town, but finds his day upended when a UFO and its extra-terrestrial passenger crash land in his backyard.", "cast": "Ben Kingsley, Harriet Sansom Harris, Zoe Winters, Jane Curtin", "director": "Marc Turtletaub", "genres": ["Comedy", "Drama", "Sci-Fi"], "year": "2023", "rating": "PG-13"}, "BlackBerry": {"desc": "The story of the meteoric rise and catastrophic demise of the world's first smartphone.", "cast": "Jay Baruchel, Glenn Howerton, Matt Johnson, Cary Elwes", "director": "Matt Johnson", "genres": ["Biography", "Comedy", "Drama", "History"], "year": "2023", "rating": "R"}, "The Angry Black Girl and Her Monster": {"desc": "Vicaria is a brilliant teenager who believes death is a disease that can be cured. After the brutal murder of her brother, she embarks on a dangerous journey to bring him back to life.", "cast": "Chad L. Coleman, Laya DeLeon Hayes, Denzel Whitaker, Reilly Brooke Stith", "director": "Bomani J. Story", "genres": ["Drama", "Fantasy", "Horror"], "year": "2023", "rating": "NR"}, "Tell It Like a Woman": {"desc": "Stories of women, both in front of and behind the camera.", "cast": "Cara Delevingne, Marcia Gay Harden, Eva Longoria, Leonor Varela", "director": "Silvia Carobbio, Catherine Hardwicke, Taraji P. Henson, Mipo Oh", "genres": ["Action", "Comedy", "Drama"], "year": "2023", "rating": "NR"}, "Carmen": {"desc": "Benjamin Millepied's complete reimagining of CARMEN tells a story through an experimental dreamscape featuring an original score and songs.", "cast": "Paul Mescal, Melissa Barrera, Elsa Pataky, Nicole da Silva", "director": "Benjamin Millepied", "genres": ["Drama", "Musical"], "year": "2023", "rating": "R"}, "Pretty Red Dress": {"desc": "Follows a South London family and how one red dress is the center of their lives.", "cast": "Tsemaye Bob-Egbe, Chevone Stewart, Katrina Pollard, Misha Malcolm", "director": "Dionne Edwards", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "The Starling Girl": {"desc": "17-year-old Jem Starling struggles with her place within her Christian fundamentalist community. But everything changes when her magnetic youth pastor Owen returns to their church.", "cast": "Eliza Scanlen, Lewis Pullman, Jimmi Simpson, Wrenn Schmidt", "director": "Laurel Parmet", "genres": ["Drama"], "year": "2023", "rating": "R"}, "A Thousand and One": {"desc": "Struggling but unapologetically living on her own terms, Inez is moving from shelter to shelter in mid-1990s New York City. With her 6-year-old son Terry in foster care and unable to leave him again, she kidnaps him so they can build their life together. As the years go by, their family grows and Terry becomes a smart yet quiet teenager, but the secret that has defined their lives threatens to destroy the home they have so improbably built.", "cast": "Teyana Taylor, William Catlett, Josiah Cross, Aven Courtney", "director": "A.V. Rockwell", "genres": ["Crime", "Drama"], "year": "2023", "rating": "R"}, "Riceboy Sleeps": {"desc": "In the 1990s, Korean native So-young loses her husband and decides to immigrate to Canada with her only son, Dong-hyun. Both experience their respective hardships and battles. Primarily, they are subjected to racism. Dong-hyun has to contend with bullying from classmates, while So-young contends with sexism. As a result, a rift forms between them, making it harder to cope and adjust.", "cast": "Choi Seung-yoon, Ethan Hwang, Dohyun Noel Hwang, Anthony Shim", "director": "Anthony Shim", "genres": ["Drama", "Family", "History", "Romance"], "year": "2023", "rating": "NR"}, "Chevalier": {"desc": "In the eighteenth century, Joseph Bologne, Chevalier de Saint-Georges, arrives in Paris, causing a stir amongst the French aristocracy, given his controversial lineage as the illegitimate son yet sole heir of an enslaved African and a French plantation owner. Yet the young man's palpable talent for the violin soon transforms his fate, allowing him to rise through the ranks of society to pursue a career as a composer until a torrid affair causes his star to burn out. Based on true events.", "cast": "Kelvin Harrison Jr., Samara Weaving, Lucy Boynton, Alex Fitzalan", "director": "Stephen Williams", "genres": ["Biography", "Drama", "History", "Music"], "year": "2023", "rating": "PG-13"}, "Haunted Mansion": {"desc": "Inspired by the classic theme park attraction, “Haunted Mansion” tells the story of Gabbie (Rosario Dawson), a single mom, who discovers that the home she and her son share is haunted by irksome ghosts. Hoping to restore domestic tranquility, Gabbie recruits a motley crew of so-called spiritual experts to help rid the house of the supernatural squatters. A nonstop blend of action, adventure and comedy featuring an all-star cast that includes LaKeith Stanfield, Tiffany Haddish, Owen Wilson, Danny DeVito, Daniel Levy, Jamie Lee Curtis and Jared Leto, “Haunted Mansion” was written by Katie Dippold and directed by Justin Simien. The film’s producers are Dan Lin and Jonathan Eirich, with Nick Reynolds and Tom Peitzman serving as executive producers.", "cast": "Lakeith Stanfield, Tiffany Haddish, Owen Wilson, Jared Leto", "director": "Justin Simien", "genres": ["Comedy", "Drama", "Family", "Fantasy", "Horror", "Mystery"], "year": "2023", "rating": "PG-13"}, "Teenage Mutant Ninja Turtles: Mutant Mayhem": {"desc": "The Turtle brothers as they work to earn the love of New York City while facing down an army of mutants.", "cast": "Ayo Edebiri, Rose Byrne, Seth Rogen, Jackie Chan", "director": "Jeff Rowe, Kyler Spears", "genres": ["Animation", "Action", "Adventure", "Comedy", "Family", "Fantasy", "Sci-Fi"], "year": "2023", "rating": "PG"}, "The Super Mario Bros. Movie": {"desc": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi.", "cast": "Chris Pratt, Charlie Day, Anya Taylor-Joy, Jack Black", "director": "Michael Jelenic, Aaron Horvath", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "year": "2023", "rating": "PG-13"}, "PAW Patrol: The Mighty Movie": {"desc": "When a magical meteor crash lands in Adventure City, it gives the PAW Patrol pups superpowers, transforming them into The MIGHTY PUPS. For Skye, the smallest member of the team, her new powers are a dream come true. But things take a turn for the worse when the pups' archival Humdinger breaks out of jail and teams up with a mad scientist to steal the superpowers for the two villains. With the fate of Adventure City hanging in the balance, the Mighty Pups have to stop the supervillains before it's too late,and Skye will need to learn that even the smallest pup can make the biggest difference.", "cast": "Mckenna Grace, Taraji P. Henson, Marsai Martin, Christian Convery", "director": "Cal Brunker", "genres": ["Action", "Adventure", "Animation", "Family"], "year": "2023", "rating": "PG"}, "Elemental": {"desc": "In a city where fire, water, land, and air residents live together, a fiery young woman and a go-with-the-flow guy are about to discover something elemental: How much they actually have in common.", "cast": "Leah Lewis, Mamoudou Athie, Ronnie Del Carmen, Shila Ommi", "director": "Peter Sohn", "genres": ["Animation", "Adventure", "Comedy", "Drama", "Family", "Fantasy", "Romance"], "year": "2023", "rating": "PG"}, "Rally Road Racers": {"desc": "Racers compete in a high-stakes rally along the famous Silk Road trade route.", "cast": "Chloe Bennet, Sharon Horgan, J.K. Simmons, Catherine Tate", "director": "Ross Venokur", "genres": ["Animation", "Comedy", "Family", "Sport"], "year": "2023", "rating": "PG"}, "Ready Jet Go! Space Camp": {"desc": "Jet Propulsion, an alien from the planet Bortron 7, is always on the quest for adventure. Inspired by his favorite TV show character Great Galacto, Jet and his pet Sunspot go comet surfing, riding waves in outer space. When Sunspot gets too close to dangerous comet dust, he develops an allergic reaction that causes him to shrink. Jet must now search for a cure before Sunspot shrinks away completely. Will Jet and his friends be able to come up with a plan before time runs out?", "cast": "Ashleigh Ball, Anthony Bolognese, Vienna Leacock", "director": "Mucci Fassett", "genres": ["Animation", "Family"], "year": "2023", "rating": "G"}, "Spider-Man: Across the Spider-Verse": {"desc": "Miles Morales returns for the next chapter of the Spider-Verse saga, an epic adventure that will transport Brooklyn’s full-time, friendly neighborhood Spider-Man across the Multiverse to join forces with Gwen Stacy and a new team of Spider-People to face off with a villain more powerful than anything they have ever encountered.", "cast": "Shameik Moore, Hailee Steinfeld, Oscar Isaac, Jake Johnson", "director": "Joaquim Dos Santos, Justin K. Thompson, Kemp Powers", "genres": ["Animation", "Action", "Adventure"], "year": "2023", "rating": "PG"}, "This Place": {"desc": "A coming-of-adulthood story about two women falling in love for the first time. As they grow closer, each is forced to confront their family histories in unexpected ways, while navigating multiple legacies of grief and love.", "cast": "Devery Jacobs, Priya Guns, Janïsa Weekes, Alex Joseph", "director": "V.T. Nayani", "genres": ["Drama"], "year": "2023", "rating": "NR"}, "Shortcomings": {"desc": "A trio of young Bay Area urbanites--Ben Tanaka, Miko Hayashi, and Alice Kim--as they navigate a range of interpersonal relationships, traversing the country in search of the ideal connection.", "cast": "Justin H. Min, Sherry Cola, Ally Maki, Tavi Gevinson", "director": "Randall Park", "genres": ["Comedy", "Drama", "Romance"], "year": "2023", "rating": "R"}, "Red, White & Royal Blue": {"desc": "When the son of the American President and Britain's prince public feud threatens to drive a wedge in U.S./British relations, the two are forced into a staged truce that sparks something deeper.", "cast": "Jemma Redgrave, Thomas Flynn, Bridget Benstead, Nicholas Galitzine", "director": "Matthew López", "genres": ["Comedy", "Romance"], "year": "2023", "rating": "R"}, "Sun Moon": {"desc": "After being left at the altar, a young woman escapes to Taiwan on a quest for hope and healing.", "cast": "Michael Jong-Quin Huang, Madison McLaughlin, Leanne Morgan, Mackenzie Mauzy", "director": "Sydney Tooley", "genres": ["Drama", "Romance"], "year": "2023", "rating": "PG"}, "Love Again": {"desc": "It centers on a woman who, after tragically losing her fiancé, starts to send romantic texts to his old cell. It turns out the number has been reassigned to a man across town suffering from a similar heartbreak. The two meet and feel an undeniable connection but can’t seem to leave the past behind. Until Celine Dion and her music gives them the courage to take a chance on love again.", "cast": "Sam Heughan, Priyanka Chopra Jonas, Céline Dion, Celia Imrie", "director": "Jim Strouse", "genres": ["Comedy", "Drama", "Romance"], "year": "2023", "rating": "PG-13"}, "Guardians of the Galaxy Vol. 3": {"desc": "Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.", "cast": "Chris Pratt, Zoe Saldaña, Bradley Cooper, Dave Bautista", "director": "James Gunn", "genres": ["Action", "Adventure", "Comedy"], "year": "2023", "rating": "PG-13"}, "Simulant": {"desc": "Faye attempts to replace her newly deceased husband, Evan, with an android simulant (SIM). Although SIM Evan appears like human Evan in every way, Faye does not feel the same love for SIM Evan as it does for her. SIM Evan tries to win Faye back while at the same time being on-the-run from a government agent chasing down SIMs who have become “conscious” and could potentially be a threat to humankind.", "cast": "Robbie Amell, Jordana Brewster, Simu Liu, Sam Worthington", "director": "April Mullen", "genres": ["Crime", "Sci-Fi", "Thriller"], "year": "2023", "rating": "Not Rated"}, "The Martian": {"desc": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.", "cast": "Matt Damon, Jessica Chastain, Kristen Wiig, Jeff Daniels", "director": "Ridley Scott", "genres": ["Adventure", "Drama", "Sci-Fi"], "year": "2015", "rating": "PG-13"}, "The Goonies": {"desc": "Kids find a treasure map and go searching for pirate's booty in a subterranean cavern, but they run into a band of outlaws and their ringleader, whose soft-hearted son comes to the kids' rescue.", "cast": "Sean Astin, Josh Brolin, Jeff Cohen, Corey Feldman", "director": "Richard Donner", "genres": ["Adventure", "Comedy", "Family"], "year": "1985", "rating": "PG"}, "Interstellar": {"desc": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.", "cast": "Matthew McConaughey, Jessica Chastain, Anne Hathaway, Michael Caine", "director": "Christopher Nolan", "genres": ["Adventure", "Drama", "Sci-Fi"], "year": "2014", "rating": "PG-13"}, "The Matrix": {"desc": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.", "cast": "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving", "director": "Lilly Wachowski", "genres": ["Action", "Sci-Fi"], "year": "1999", "rating": "R"}, "The Chronicles Of Narnia: The Lion, The Witch and The Wardrobe": {"desc": "C.S. Lewis's beloved fantasy novels come to life in this enchanting adventure, which features scenes not shown in theaters. It's the tale of four British children who enter a magical world, where they befriend wondrous creatures and battle a witch (Tilda Swinton). Georgie Henley, Skandar Keynes, William Moseley, Anna Popplewell. Directed by Andrew Adamson.", "cast": "Georgie Henley, Skandar Keynes, William Moseley, Anna Popplewell", "director": "Andrew Adamson", "genres": ["Adventure", "Family", "Fantasy"], "year": "2005", "rating": "PG"}}